{
    "name": "t3_1mkunl",
    "title": "TCMV Tuesday - 09/17/13",
    "body": "Welcome to TCMV Tuesday, our weekly post where we can celebrate our ability to adopt a new mindset or gain another perspective. Tell us what experiences you've had outside our subreddit, either recently or in your lifetime, that made you think \"**This Changed My View**\". Give us your stories in the comments!\n\nYou can consider these questions to help get you thinking:\n\n* Known or met someone with an interesting ideology or opinion that caused you to reconsider your own?\n\n* Had an experience, good or bad, that changed your perspective?\n\n* Learned something new that challenged what you believed?\n\n* Ever have your tastes or interests changed?\n\n* Read an article or seen a video that got you thinking differently?\n\nAnd just as a reminder, comment discussions here are not debate-oriented, so there's no obligation to take opposing sides in conversations here (in other words, Rule 1 does not apply here).",
    "author": "AutoModerator",
    "num_comments": 1,
    "created_utc": 1379433606.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1mkunl/tcmv_tuesday_091713/",
    "comments": [
        {
            "name": "t1_ccaevxv",
            "parent_id": "t3_1mkunl",
            "body": "I know this is rather silly, but South Park has really changed my view on a few things. For example, I used to really judge smokers. I thought that there was no point to smoking and that I was better than them (only in that regard) for not doing it. Then I saw the episode with the [cigarette song](http://www.youtube.com/watch?v=YpQdqWfuL-U) and it made me really think about why I was being so judgmental and snobby. Heck, I have my own vices - nobody is perfect, and if it can get someone through the day, then who am I to judge. Of course I still think that cigarettes are bad, but I'm not judgmental towards those who smoke. ",
            "author": "RashaGirl",
            "created_utc": 1379458881.0,
            "replies": []
        }
    ]
}