{
    "name": "t3_1cd5dm",
    "title": "I genuinely believe the Connecticut school shooting was fake/fabricated. CMV.",
    "body": "IMPORTANT: I want to be wrong about this! I realize it's an absolutely terrible thing to fake, but through all of the research I've done, all signs point to government fabrication to sway the public's views about gun control. \n\nThe only information I have to back up my claim are videos on youtube, and articles on the internet, as well as other incidents in the past that have allegedly been staged/performed by the governments of multiple nations. Here are links: \n\nVideos suggesting the shooting was a hoax:\n-http://www.youtube.com/watch?v=IFo3x_UgQ80\n- http://www.youtube.com/watch?v=-mlszDIRZb0\n\nIt appears that this type of this has happened before, with 911, the England bus bombing, etc. Internet research. \n\nSo to conclude, I really want to see what you guys think. I don't WANT it to be fake, but I think it was.",
    "author": "TwasAConspiracy",
    "num_comments": 6,
    "created_utc": 1365993516.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1cd5dm/i_genuinely_believe_the_connecticut_school/",
    "comments": [
        {
            "name": "t1_c9fcqwc",
            "parent_id": "t3_1cd5dm",
            "body": "911 is accepted as a terrorist attack on the United States by Muslim Extremists.\n\nit was not a hoax, or a set up. \n\nthe people who believe these things are generally considered to be crazy (see UFO enthusiasts, and Moon Landing denalists)\n\nGenerally belief in such conspiracies is a result of people refusing to believe such an event could occur because it clashes with their world view.\n\nwhat part of the sandy hook shooting do you have the biggest problem with?",
            "author": "PrimeLegionnaire",
            "created_utc": 1365994429.0,
            "replies": [
                {
                    "name": "t1_c9fd6ev",
                    "parent_id": "t1_c9fcqwc",
                    "body": "I think that that is a bit of a blanket statement to put on conspiracy theorists. Considering the 9/11 attacks, I personally believe that they were not a hoax, but I have seen some evidence that makes you stop and think. One professor did the math (fall times, debris scatter, etc.) and found that how one of the buildings collapsed matches a controlled demolition, and does not match a catastrophic impact. He states that he didn't believe they were a hoax before, so he didn't come into it biased, but now he is not so sure. Like I said, I don't think 9/11 was a hoax, and maybe his math has an error that he missed, or maybe this is just a crazy coincidence, but I think that some conspiracy theorists have more to go on than that they can't accept that such a thing would happen.",
                    "author": "cashmo",
                    "created_utc": 1365995694.0,
                    "replies": []
                },
                {
                    "name": "t1_c9fdkq5",
                    "parent_id": "t1_c9fcqwc",
                    "body": "The things I have the hardest time accepting are: \n- It was a small town. Many of these small towns come with people knowing each other. Literally no one involved in the incident has stepped forward and said that they knew, or even knew of the shooter (who reportedly lived in the community) Before the shooting. \n-The people interviewed show absolutely no sadness. If someone's child was shot to death, wouldn't they be visibly sad? I know the mind can do weird things at times of tragedy, so I realize this point has some potential skepticism. \n-Columbine shooting. There is an actual video of the shooting taking place. I don't know of any footage of the shooting taking place with sandy hook. \n- I've seen that some of the people who were said to be parents and other people involved in the media process of the media are involved with the Screen Actors Guild, but I'm not sure of this. This fact isn't any different than any of us have seen on mainstream media, though. \n",
                    "author": "TwasAConspiracy",
                    "created_utc": 1365996874.0,
                    "replies": [
                        {
                            "name": "t1_c9ffpm2",
                            "parent_id": "t1_c9fdkq5",
                            "body": "&gt; Many of these small towns come with people knowing each other. Literally no one involved in the incident has stepped forward and said that they knew, or even knew of the shooter (who reportedly lived in the community) Before the shooting.\n\nIt seems odd to just come out and go \"Hey, guys, I did know this person!\" when it's scattered all over the news. Even so, he could've been reclusive and a big loner. I was in High School; I doubt many people knew my name, and I seriously doubt any of them remember me now. \n\n&gt; If someone's child was shot to death, wouldn't they be visibly sad?\n\nHonestly, I would expect shock more than sadness, and that's definitely what I saw. Not everyday a shooting happens at an Elementary school. Most of the parents had this very thought going through their heads: *is it my child?*\n\nHere's an anecdote. When I was around 7, me, my sister and my mom were driving home from the dollar store. Mom noticed an ambulance which was stuck in traffic. \n\n\"Jeez, someone is injured, and people are just sitting there!\"\n\n\"Yeah, right? People are crazy.\"\n\nAbout 5 minutes later, we made it home. My dad is visibly distraught, and some person I don't know is in the house. Turns out, my brother, aged 15 or 16, got hit by a car while walking home from school. Pretty seriously. I believe the car was speeding, doing something like 60 MPH. The news hit: my sister is crying, my dad is blubbering like an old man, but my mom is *stone-faced*. Absolutely stone-faced. She remained like this throughout the day. Yadda yadda, brother is fine after surgery and months of therapy, all is eventually well. My point is, don't expect visible sadness in such a situation. Only my dad knew what it was like to lose a son (past family, Navy, long story.) I assume the parents of such young children do not, and can only ride the shock out.\n\n\nBack to the point at hand--\n\nI remember the older brother wandering onto the scene, reportedly shouting \"I didn't do it!\" (all on the news, mind you.) I'm sure you can find footage of some people bawling, and I'm *especially* sure people bawled in their own privacy. Additionally, I'd think an interviewer would want someone who kept it together, so they could actually get some information. \n\n&gt; There is an actual video of the shooting taking place.\n\nNot every school has video surveillance in every room, especially not an Elementary school. Even if they did, why would they *release* it? Here's a room full of dead children, for all you skeptics out there.\n\n&gt; I've seen that some of the people who were said to be parents and other people involved in the media process of the media are involved with the Screen Actors Guild, but I'm not sure of this.\n\nWeird sentence. Quick Google leads me to believe the Screen Actors Guild dissolved in early 2012. ",
                            "author": "[deleted]",
                            "created_utc": 1366003873.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_c9fdjt4",
            "parent_id": "t3_1cd5dm",
            "body": "Do you really think the government has this much power? Governments like conspiracy theories because it makes the government seem much more powerful than it is. I didn't watch the video in its entirety, but at one point he was blasting an interview with a father. After the shooting, of course there is an agenda. There always is. You swear vengeance on the thing that harmed your family. They probably blame bad gun control laws. ",
            "author": "CommanderShep",
            "created_utc": 1365996803.0,
            "replies": []
        },
        {
            "name": "t1_c9fdpqa",
            "parent_id": "t3_1cd5dm",
            "body": "Snopes examined the claim and [found it wanting](http://www.snopes.com/politics/guns/newtown.asp).",
            "author": "spblat",
            "created_utc": 1365997300.0,
            "replies": []
        }
    ]
}