{
    "name": "t3_1m40qn",
    "title": "TCMV Tuesday - 09/10/13",
    "body": "Welcome to TCMV Tuesday, our weekly post where we can celebrate our ability to adopt a new mindset or gain another perspective. Tell us what experiences you've had outside our subreddit, either recently or in your lifetime, that made you think \"**This Changed My View**\". Give us your stories in the comments!\n\nYou can consider these questions to help get you thinking:\n\n* Known or met someone with an interesting ideology or opinion that caused you to reconsider your own?\n\n* Had an experience, good or bad, that changed your perspective?\n\n* Learned something new that challenged what you believed?\n\n* Ever have your tastes or interests changed?\n\n* Read an article or seen a video that got you thinking differently?\n\nAnd just as a reminder, comment discussions here are not debate-oriented, so there's no obligation to take opposing sides in conversations here (in other words, Rule 1 does not apply here).",
    "author": "AutoModerator",
    "num_comments": 3,
    "created_utc": 1378828808.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1m40qn/tcmv_tuesday_091013/",
    "comments": [
        {
            "name": "t1_cc5kmq0",
            "parent_id": "t3_1m40qn",
            "body": "When I grew up my parents were fairly liberal.  They liked Clinton, hated Bush, and made lots of comments about both.  In high school, I started working at a Dairy Queen and had an awesome coworker who was more libertarian.  We would discuss politics and I would repeat things my parents had said and he would challenge them and I was at a complete loss.  I learned to just shut up and listen to people, a wide range of people, for a while.  \n\nI also learned that a great way to engage in a conversation when I don't actually know anything is to challenge other people, especially by *asking them to clarify* (sorry, too many people \"challenge\" others by being obnoxious assholes.  I wanted to clarify what I meant).  You learn so much when you get someone to really lay out what their beliefs are and why they hold them.",
            "author": "Personage1",
            "created_utc": 1378832040.0,
            "replies": [
                {
                    "name": "t1_cc5m3xt",
                    "parent_id": "t1_cc5kmq0",
                    "body": "I have a bit of an opposite CMV experience to yours, though I agree that it's excellent to be open minded to new ideas like that, and ask questions!\n\nI always grew up with the assumption that capitalism and free enterprise are just the best thing ever, and that socialism and communism were bad (thanks, oversimplification in the public school system!). My misunderstanding for the longest time was that socialism = the government owns everything, takes everyone's money no matter how hard they work, and gives it equally to all other people. I never really questioned that view, since I was exposed to a lot of conservative media that seemed to treat it that way.\n\nWhen I met my husband (then boyfriend), I realized he had a dramatically different view on capitalism vs. socialism, and we started talking a lot about it. I did some more research, and even read through some of the Communist Manifesto (which my dad had in his bookshelf - he loves collecting/dissecting even very controversial political ideas). It turns out that socialism does not entail taking money from hard workers and giving it to \"lazy people\", but rather that it attempts to fix the way we value labor. (As in, the benefits should go directly to the people producing the value, and not so much to an upper tier of investors.) I'm not of the belief that socialism is a perfect system, but until I opened my mind to new ideas, I never even considered re-evaluating the way we view value in our society.\n\nSo definitely keep an open mind and debate conflicting ideas calmly. You may learn things you never even knew you didn't know.",
                    "author": "Neurotikitty",
                    "created_utc": 1378836165.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cc5r592",
            "parent_id": "t3_1m40qn",
            "body": "I had always wanted to join the military.  I wanted to go to West point with one of my friends.  I loved to learn about guns and wwii then I saw the documentary why we fight and that really changed my view. ",
            "author": "LtMelon",
            "created_utc": 1378849089.0,
            "replies": []
        }
    ]
}