{
    "name": "t3_1r3id3",
    "title": "Zunes were never cool. CMV.",
    "body": "Let's face it: Zune (the media delivery service, the actual device) was just a blatant attempt by Microsoft to compete and stay relevant when faced with an ascendant Apple. I'm by no means an Apple fanboy, but nothing is less cool than copying wholesale what is currently popular. The mp3 players looked bad, the sites were godawful, and Zune is generally considered to be emblematic of the tack the Microsoft has taken to compete with Apple, which hasn't been great. \"Leasing\" songs to your Zune-having friends was two steps forward idea-wise, but 3 steps back CRM-wise. Watching the build up and \"hype\" to the release of Zune was like watching a car crash in slow motion.\n\nI'm not saying that Zune was useless or uninteresting or ineffective, my view is simply that it isn't, and never was, cool. Hip. Desirable to have. You will have changed my view when you make me (or some past version of me) desire a Zune.",
    "author": "Basman_",
    "num_comments": 2,
    "created_utc": 1384990078.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1r3id3/zunes_were_never_cool_cmv/",
    "comments": [
        {
            "name": "t1_cdj818j",
            "parent_id": "t3_1r3id3",
            "body": "I was one of the no people that got a launch zune. I thought it was really cool actually. It has about the exact same specs as an ipod at the time, but I slightly larger screen. The software was cool, worked well enough. It played music and videos as expected. Not cool? When most people saw my zune they thought it was AWESOME. They just didn't know about it. They're brains are so filled with ipod that they couldn't even fathom that there were other options. I got lots of compliments on the zune - despite it's poopy brownness. \n\n**It had radio.** I used this single feature far more than anything else. It has a really nice radio tuner that picked up singles really crisp and nice. The iPod didn't have this. ",
            "author": "[deleted]",
            "created_utc": 1384992521.0,
            "replies": [
                {
                    "name": "t1_cdjeri8",
                    "parent_id": "t1_cdj818j",
                    "body": "The Zune Pass stuff was really cool, too! It was essentially Spotify before Spotify became available in the US. I loved that.",
                    "author": "cyanoacrylate",
                    "created_utc": 1385008350.0,
                    "replies": []
                }
            ]
        }
    ]
}