{
    "name": "t3_1eo2kq",
    "title": "I don't think I should bother with going to prom next year. CMV",
    "body": "I'll be in a gym full of people I hate with music I hate even more, and having to pay $80 for all of it. Change my view!",
    "author": "BladeNoob",
    "num_comments": 9,
    "created_utc": 1369015044.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1eo2kq/i_dont_think_i_should_bother_with_going_to_prom/",
    "comments": [
        {
            "name": "t1_ca23apa",
            "parent_id": "t3_1eo2kq",
            "body": "Honestly, I felt the same way as you do now. No compelling reason to go.\n\nHowever, years after the fact, it's one of those things that, regardless of how much fun you had, can be looked back upon fondly. I would just look at it as a milestone in your ever-changing life. Nothing too special about the night itself, but having gone is what really matters 10 years down the road.",
            "author": "SkepticJoker",
            "created_utc": 1369015736.0,
            "replies": [
                {
                    "name": "t1_ca23e0m",
                    "parent_id": "t1_ca23apa",
                    "body": "Hmmm, an interesting point of view. Thanks for the response",
                    "author": "BladeNoob",
                    "created_utc": 1369015998.0,
                    "replies": [
                        {
                            "name": "t1_ca23oal",
                            "parent_id": "t1_ca23e0m",
                            "body": "[deleted]",
                            "author": "[deleted]",
                            "created_utc": 1369016780.0,
                            "replies": [
                                {
                                    "name": "t1_ca23vo9",
                                    "parent_id": "t1_ca23oal",
                                    "body": "Haha I'm with this ~~guy~~ girl, didn't go, no regrets at all",
                                    "author": "Otiac",
                                    "created_utc": 1369017360.0,
                                    "replies": [
                                        {
                                            "name": "t1_ca23xz8",
                                            "parent_id": "t1_ca23vo9",
                                            "body": "[deleted]",
                                            "author": "[deleted]",
                                            "created_utc": 1369017547.0,
                                            "replies": [
                                                {
                                                    "name": "t1_ca24am5",
                                                    "parent_id": "t1_ca23xz8",
                                                    "body": "&gt;Us chicks are supposed really care about that stuff, right?\n\nWomen traditionally have vanity issues as much as men have power issues.\n\nSo yeah; the majority of women will; but it's as irrational as bar fights over an insult.",
                                                    "author": "monkyyy",
                                                    "created_utc": 1369018546.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_ca24nsn",
                                                            "parent_id": "t1_ca24am5",
                                                            "body": "[deleted]",
                                                            "author": "[deleted]",
                                                            "created_utc": 1369019616.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_ca25eld",
                                                                    "parent_id": "t1_ca24nsn",
                                                                    "body": "&gt;so women will tend to place a lot more of their self worth on the event\n\nNow this is the only productive part of modern feminism, their willingness to solve their own self-caused problems.",
                                                                    "author": "monkyyy",
                                                                    "created_utc": 1369021861.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ca23ykr",
            "parent_id": "t3_1eo2kq",
            "body": "I was you once upon a time.  \"Waste of money, waste of time, the music will suck, I hate everyone.\"  That was pretty much my disposition.  \n\nBut, of course, my friends dragged me along.  I managed to get a date (I heard from the guys that went stag that they had a blast, too) and we got a party bus and then took 900 pictures before finally going to the actual prom (where more pictures took place).  I felt like the pictures were going to kill me.  Possibly the only complaint I have (I don't like pictures).  Otherwise, I had a great time.  Sure, I didn't like the music, but it's not like you're actually listening to it.  You just dance to it.  There's something very different about using the beat to move and actually listening to see if you like the song.  When I wasn't dancing, I was wondering what the hell was playing.  When I was, I wasn't paying much attention to how \"good\" the song was.\n\nRegardless, with a couple of friends and some self-convincing (you won't have fun if you tell yourself you're not going to have fun) you'll end up having a great time.  I'd suggest an afterparty to share all the inside jokes that have been made.\n\nAnd, looking back, all the pictures bring back good memories and I'm glad I went.  I hated the idea at first, but even though it may seem so superficial and costly (which it is), at the end of the day you get out what you put in and I would've beat myself over the head had I chosen not to go.  \n\nThe $80 is only a good investment if you're willing to get together with a friend or two (or a group) and have a good time.  Otherwise, I don't know what to tell you.  I *can* tell you that you don't need a huge group of friends to have a good time.  Kids from my school that notably have very small groups of friends (2-3) showed up and had a great time.  \n\nThe only people that left not having a good time were\n\n1) People that convinced themselves prom sucks and everything about it sucks\n\n2) Kids who were just biding their time to go to a house party and bang their date.\n\n",
            "author": "Joined_Today",
            "created_utc": 1369017596.0,
            "replies": [
                {
                    "name": "t1_ca24dau",
                    "parent_id": "t1_ca23ykr",
                    "body": "Essentially. Things are typically exactly as fun as you make them. If you go into it thinking it'll suck, it will. If you go into it saying \"this will be a blast\" you'll probably end up having a great time.",
                    "author": "TheNoodlyMessiah",
                    "created_utc": 1369018757.0,
                    "replies": []
                },
                {
                    "name": "t1_ca24zer",
                    "parent_id": "t1_ca23ykr",
                    "body": "You have made wished I could go to a prom again.  The last one I attended was 1996",
                    "author": "urnbabyurn",
                    "created_utc": 1369020563.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_ca27qym",
            "parent_id": "t3_1eo2kq",
            "body": "I went to mine with no date and no plans or anything. I didn't care and I didn't make much of it, which I slightly regret. Everything in life is on par with doing and not doing, it was what we make of these experiences that count. I met some lovely people that night.\n\nI made some makeshift plans during Prom and while everyone else was bitching about how dreadful the after-party was, I was at my house with four of my closest friends drinking, laughing and talking. Since then we've gotten together every year on that day.\n\nGo not because it's going to be great, go because you will make it great. ",
            "author": "SORRYFORCAPS",
            "created_utc": 1369030837.0,
            "replies": []
        }
    ]
}