{
    "name": "t3_1ie2ew",
    "title": "I'm disgusted by the African-American community response to the Zimmerman verdict/trial. CMV",
    "body": "Well, I should really say certain segment of the African American population, not all, but a vocal majority.\n\nEvery day black teens are killed by other black teens and not a word is said.  No one from the AA community seeks justice.  No one wants to help the police seek justice.  That would be \"snitching\", and highly discouraged.  No, the only time the AA community wants to seek justice is when they can blame the white man.  Then, its a travesty beyond words.\n\nThis would never have been the spectacle it has become if Martin and Zimmerman were both black, or both white for that matter.  This simply looks like, IMO, the need to play the victim and glorify victim-hood.  In the argument all these Trayvon supporters preach they all conveniently ignore the fact that Trayvon attacked Zimmerman.  I dont care if he was being followed, I dont care if he felt like he was being profilied, you NEVER have the right to put your hands on someone because you feel like the deserve a beat down.  It was a self defense case, plain and simple.\n\nThink about it this way, if Zimmerman had been black, and just a part of a neighborhood watch in an area that had been victimized by home invasions recently, and saw a sketchy looking white teenager walking through his neighborhood, now would would question Zimmerman in thinking it was suspicious and following.  No one would bat an eye.  And if Martin acted like some white trash punk and started a fight, no one would have given a shit if he was shot dead.  Because he initiated the physical violence.  Thats all this case should be buts its been twisted into something disgusting and I've unfortunately lost a lot of respect for a large segment of the black community that are protesting in the face of plain facts (as well as all the white guilt-ridden protesters joining them) who are simply ignoring what actually happened in this case.\n\nCMV.",
    "author": "ZimmTrayThrowaway",
    "num_comments": 44,
    "created_utc": 1373947119.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1ie2ew/im_disgusted_by_the_africanamerican_community/",
    "comments": [
        {
            "name": "t1_cb3jjs2",
            "parent_id": "t3_1ie2ew",
            "body": "&gt; Every day black teens are killed by other black teens and not a word is said. No one from the AA community seeks justice. No one wants to help the police seek justice. \n\nThis a misinformed exaggeration. You think the families of black people don't seek justice? You don't think ANY black people snitch? Your view of black people sounds like it was made by watching crime dramas.  You don't think there are marches and protests when gang violence claims black teenagers lives? The only reason you know about the Trayvon ones is because it extends beyond the black community, which you are clearly not a part of.\n\n&gt; I dont care if he was being followed, I dont care if he felt like he was being profilied, you NEVER have the right to put your hands on someone because you feel like the deserve a beat down\n\nSo you don't believe in self defense? Interesting. A dude is following you around. You don't know why. Maybe he's trying to rob you. Maybe he's trying to hurt you. How was Trayvon supposed to know this guy following him wasn't going to jack him up and steal his wallet? Just because he's not black? Zimmerman was invading Trayvon's space and profiling him and following him around. I'd be really sketched out and concerned if that was happening to me.\n\nYou have no way of knowing Trayvon put his hands on Zimmerman \"because he thought he deserved a beat down.\" That phrasing also postures it as if Trayvon were following Zimmerman around, which was not the case.\n\nI agree this case has been twisted and the media should keep their nose out of this and all cases in my opinion. However, you clearly do not understand why this is important to people of color.\n\n\n",
            "author": "[deleted]",
            "created_utc": 1373948240.0,
            "replies": [
                {
                    "name": "t1_cb3kab0",
                    "parent_id": "t1_cb3jjs2",
                    "body": "&gt; So you don't believe in self defense?\n\nAccording to America's self-defense laws, you must attempt to remove yourself from a dangerous situation before acting violently in self-defense (though this is negated by Florida's Stand Your Ground law). But even with Stand Your Ground, you must have reason to believe you are in danger, and you cannot escalate the level of violence. So, if someone punches me, I can punch back, but not shoot them. If someone pulls a gun on me, I can use lethal force. \n\nUnder Stand Your Ground, Martin had the right to confront Zimmerman, but not to attack him. Under self-defense laws, Zimmerman had the right to use lethal force as soon as he believed his life was seriously threatened.",
                    "author": "holyhellitsmatt",
                    "created_utc": 1373950548.0,
                    "replies": [
                        {
                            "name": "t1_cb3kir7",
                            "parent_id": "t1_cb3kab0",
                            "body": "Martin was trying to remove himself. He was continuing to walk back from the store. \n\nOnly they know what happened. ",
                            "author": "[deleted]",
                            "created_utc": 1373951322.0,
                            "replies": [
                                {
                                    "name": "t1_cb3krcz",
                                    "parent_id": "t1_cb3kir7",
                                    "body": "Martin had about 4 minutes to go the remaining 100 meters to his house (between Zimmerman's 911 call and the approximate beginning of the fight). He  didn't go. That's not removing himself.\n\nBut you are right that only they know what happened, which is exactly why the case turned out the way it did. There isn't enough evidence for any form of guilty verdict.",
                                    "author": "holyhellitsmatt",
                                    "created_utc": 1373952107.0,
                                    "replies": [
                                        {
                                            "name": "t1_cb3nynv",
                                            "parent_id": "t1_cb3krcz",
                                            "body": "Zimmerman had the same four minutes. Obviously, he thought it was a dangerous situation, or he wouldn't have called 911 and followed Martin. Why didn't he do the same?",
                                            "author": "shemperdoodle",
                                            "created_utc": 1373967578.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cb3qcwp",
                                                    "parent_id": "t1_cb3nynv",
                                                    "body": "Because the claim that Martin acting in self defense (as an attempt to prevent a claim that Zimmerman acted in self-defense) makes no sense when you acknowledge that the \"terrified\" Martin chose not to escape the situation when given more than enough time.  If I thought I was being chased by someone who might hurt me, I'd be behind a locked door and calling the cops in under a minute.\n\nZimmerman did not, at the time, think that Martin was attacking him.  He thought he found the burglar, whose reactions, including the first flight, fit the expected profile of a criminal caught red handed.  Assuming Zimmeran's story was true (we just don't know), that makes Martin the one who initiated the physical conflict that led to Zimmerman fearing for his life and shooting Martin.\n\nFrom common sense and forensics point of view, there are more unknowns that work in Zimmerman's favor than Martin's.  Martin is terrified and running away, but chooses not to move to safety.  Why?\n\nZimmerman somehow ended up on his back with a wounded head before shooting Martin (who was directly on top of him).  How?\n\nEven their attitudes.  Zimmerman was don't-let-him-escape angry, while Martin seemed \"do anything to survive\" scared... It would be flip-a-coin over who started it, except that Martin seems to have chosen fight over flight in those 4 minutes when Zimmerman hadn't even gotten that far.",
                                                    "author": "novagenesis",
                                                    "created_utc": 1373981535.0,
                                                    "replies": []
                                                },
                                                {
                                                    "name": "t1_cb3tns6",
                                                    "parent_id": "t1_cb3nynv",
                                                    "body": "He's a neighborhood watch; he is supposed to keep the neighborhood safe. How could he do that if he ran from every potentially unsafe situation? ",
                                                    "author": "holyhellitsmatt",
                                                    "created_utc": 1373991172.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cb3zy7m",
                                                            "parent_id": "t1_cb3tns6",
                                                            "body": "The neighborhood watch is supposed to call the police, not get directly involved",
                                                            "author": "grooooms",
                                                            "created_utc": 1374006353.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cb40krr",
                                                                    "parent_id": "t1_cb3zy7m",
                                                                    "body": "Hypothetically, if a person committed a crime less than 100 meters from an armed neighborhood watch, everyone would be up in arms over how the watch did nothing. Zimmerman was probably acting just in case Martin was a criminal. \n\nThere's a reason Zimmerman didn't already have his weapon drawn; he wasn't about to act violently without reason.",
                                                                    "author": "holyhellitsmatt",
                                                                    "created_utc": 1374007856.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_cb421mo",
                                                                            "parent_id": "t1_cb40krr",
                                                                            "body": "&gt; Hypothetically, if a person committed a crime less than 100 meters from an armed neighborhood watch, everyone would be up in arms over how the watch did nothing.\n\nNo they wouldn't. The watch's job is to collect information/evidence for the police and to liaise with police. Not to prevent a crime from taking place.",
                                                                            "author": "r3m0t",
                                                                            "created_utc": 1374011602.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "name": "t1_cb4i5qs",
                                            "parent_id": "t1_cb3krcz",
                                            "body": "Say you're being followed by some guy you think is trying to maybe rape/rob/harm you. Are you going to let him see exactly where you and your family live?\n\nMaybe you would, you don't sound to streetwise...",
                                            "author": "[deleted]",
                                            "created_utc": 1374072765.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cb4lucm",
                                                    "parent_id": "t1_cb4i5qs",
                                                    "body": "And you think it's more \"streetwise\" to stay out in the open? Or maybe that attacking the person following you is most \"streetwise?\" \n\nThe best thing Martin could have done was go home, lock the doors, and call the police. He even could have called the police before he got home, since he had a phone on him. ",
                                                    "author": "holyhellitsmatt",
                                                    "created_utc": 1374082242.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cb4mafq",
                                                            "parent_id": "t1_cb4lucm",
                                                            "body": "Zimmerman sounds like the aggressor to me in this whole transaction. He followed the kid. He called 911 on the kid. He confronted the kid after 911 told him not to. Why is it so hard to believe he shoved or punched first? \n\nAlso, black people don't love calling the police. People of color in general. Police historically racially profile, maim, rape, and kill people of color. That would not be his first instinct. ",
                                                            "author": "[deleted]",
                                                            "created_utc": 1374083306.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cb4n4oh",
                                                                    "parent_id": "t1_cb4mafq",
                                                                    "body": "&gt; Zimmerman sounds like the aggressor to me in this whole transaction. He followed the kid. He called 911 on the kid. He confronted the kid after 911 told him not to. Why is it so hard to believe he shoved or punched first?\n\nThis is where self-defense and Stand Your Ground laws come into play. You aren't allowed to escalate a situation.\n\n So even if Zimmerman pushed/punched Martin, all he could do back is throw a punch. Instead, Martin got him on the ground, crouched over him, and beat his head into the concrete. That's escalating the situation. Since Martin had exactly 0 injuries, it's easy to see who did the escalating.\n\nAnd just because black people \"don't love calling the police\" doesn't mean a black person can be excused for not calling the police. I can say that I don't love feeding my cat, but that doesn't mean it's okay for me to not feed my cat.\n",
                                                                    "author": "holyhellitsmatt",
                                                                    "created_utc": 1374085306.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_cb4y0cn",
                                                                            "parent_id": "t1_cb4n4oh",
                                                                            "body": "I don't agree with that law. If someone threatens to kill you with a knife and you use karate to break their arm, is that not okay?\n\nAs for the police...it's hard to say why he didn't. My guess would be that he had bad experiences with the police or feared he would be arrested because he was black, regardless of the real situation. When's the last time you heard about an innocent white guy being shot 50 times by police?",
                                                                            "author": "[deleted]",
                                                                            "created_utc": 1374113762.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_cb4z7u1",
                                                                                    "parent_id": "t1_cb4y0cn",
                                                                                    "body": "If someone threatens to kill you with a knife, you can use karate to break their arm. But in this case, since there is no evidence supporting the claim that Zimmerman threatened Martin, we must assume that he didn't, and that Martin escalated the situation. As I've said earlier, Martin had every right to confront Zimmerman, but no right to attack.",
                                                                                    "author": "holyhellitsmatt",
                                                                                    "created_utc": 1374117341.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cb46pb4",
                    "parent_id": "t1_cb3jjs2",
                    "body": "Feel like you're being followed?  CALL 911! ",
                    "author": "domeier",
                    "created_utc": 1374024886.0,
                    "replies": [
                        {
                            "name": "t1_cb4hol9",
                            "parent_id": "t1_cb46pb4",
                            "body": "Oh yeah they won't take 30 minutes to show up.",
                            "author": "[deleted]",
                            "created_utc": 1374071367.0,
                            "replies": [
                                {
                                    "name": "t1_cb4i249",
                                    "parent_id": "t1_cb4hol9",
                                    "body": "Did it take police 30 mins to show up when Zimmerman called?  Didn't think so.",
                                    "author": "domeier",
                                    "created_utc": 1374072471.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cb3jkfw",
            "parent_id": "t3_1ie2ew",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1373948299.0,
            "replies": [
                {
                    "name": "t1_cb3jlzl",
                    "parent_id": "t1_cb3jkfw",
                    "body": "Removed due to Rule 1 (see sidebar ---&gt;).",
                    "author": "GameboyPATH",
                    "created_utc": 1373948430.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cb3pf8r",
            "parent_id": "t3_1ie2ew",
            "body": "First of all. If you look at the protest photos it's not just the black community. Many people of all backgrounds feel different than you about the case. I'm sure you also noticed this as frankly it's impossible not to, but just felt the need to express your disgust for Black people as you have said. \n\nLikewise you're just generalizing terribly to fit your agenda. Black people don't care about justice unless it's against white men? That's ridiculous. \n\nWhat makes you so sure if Zimmerman and Martin switched races things would workout like your fantasy scenario? If anything, Black Zimmerman would have been more likely to be arrested and condemned. Our legal system is known to give harsher sentences to Blacks than their White counterparts. Or are you under the delusions that racial bias can't exist in the police department? The emotional attachment to the case began when Martin's parents felt that they were being ignored. It took six weeks for the police to press the charges after much pressure. \n\nAlthough I agree with the ruling due to legal reasons, the case is hardly a black and white issue. There are tons of other matters to be questioned such as morality of Zimmerman's actions or the Stand Your Ground Laws. Why does it make you \"lose respect\" for black people who have different opinion on the matter than you? (Although I doubt you ever had any) Should everyone happily accept every legal decision? A 17 year old kid died, it's still a tragedy that will provoke emotions even if in your mind, he's just some thug trash. Also, they're simply protesting. They're not out breaking things, but expressing their opinion in a legal matter. \n\nAlso I'm so goddamn sick of Zimmerman posts. Every 2 hours, another guy feels the need to voice his trite opinion under the guise of \"wanting to change their views\". ",
            "author": "LunaRosa",
            "created_utc": 1373977455.0,
            "replies": [
                {
                    "name": "t1_cb3qdsx",
                    "parent_id": "t1_cb3pf8r",
                    "body": "&gt; What makes you so sure if Zimmerman and Martin switched races things would workout like your fantasy scenario? If anything, Black Zimmerman would have been more likely to be arrested and condemned. \n\nNot with this kind of press.  I'll be the first to agree that, in the absence of media, minorities get shit on in defence cases.  That doesn't mean we should drop reasonable doubt for everyone...it means the opposite.  Everyone should get reasonable doubt.\n\n&gt; or the Stand Your Ground Laws\n\nWhy should anyone bring up Stand Your Ground?  Nothing in this case had anything to do with that law.",
                    "author": "novagenesis",
                    "created_utc": 1373981630.0,
                    "replies": [
                        {
                            "name": "t1_cb3un1d",
                            "parent_id": "t1_cb3qdsx",
                            "body": "I doubt it will get much press if the stories were switched. Even if the defense didn't use the stand your ground, it's still very related. The anger and protests aren't just completely about Zimmerman. But on race relations with the police as well as the of force/gun in today's society. \n\nNot to mention, \n\n&gt; While Zimmerman did not ultimately use the \"stand your ground\" defense in his case, Sanford police did not arrest him until almost two months after the shooting because of the Florida stand your ground rules that require police to have specific evidence to refute a self defense claim in order to arrest someone claiming self defense.\n ",
                            "author": "LunaRosa",
                            "created_utc": 1373993596.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cb3q90x",
            "parent_id": "t3_1ie2ew",
            "body": "&gt;I dont care if he was being followed, I dont care if he felt like he was being profilied, you NEVER have the right to put your hands on someone because you feel like the deserve a beat down\n\nI have 2 responses to this. \n\n1. You never got in a fight in your life?\n\n2. Only 2 people know who threw the first punch, Zimmerman and martin. Zimmerman got to tell everyone that martin threw the first punch and Martin can not tell anyone his side of the story because Zimmerman shot him. \n\nNow, Zimmerman started following and calling the police because he saw a suspicious man, now the question becomes what makes him suspicious. What makes a guy sketchy looking? It was because he was a black kid in a hoodie and thus he had to be guilty of something. ",
            "author": "trophymursky",
            "created_utc": 1373981121.0,
            "replies": [
                {
                    "name": "t1_cb3vnb9",
                    "parent_id": "t1_cb3q90x",
                    "body": "&gt; Zimmerman got to tell everyone that martin threw the first punch and Martin can not tell anyone his side of the story because Zimmerman shot him. \n\nI fail to see why this is a valid point. Obviously if Martin had survived, he would have claimed Zimmerman threw the first punch and Zimmerman would have claimed the opposite. So we would be in exactly the same position on trying to prove who did what first. The problem isn't what either party has to say, it is what either party can prove. ",
                    "author": "Astromachine",
                    "created_utc": 1373995978.0,
                    "replies": [
                        {
                            "name": "t1_cb3zc3f",
                            "parent_id": "t1_cb3vnb9",
                            "body": "&gt;The problem isn't what either party has to say, it is what either party can prove\n\nmy point exactly, there is no evidence that Martin threw the first punch so I don't see how it is self defense. ",
                            "author": "trophymursky",
                            "created_utc": 1374004866.0,
                            "replies": [
                                {
                                    "name": "t1_cb40le7",
                                    "parent_id": "t1_cb3zc3f",
                                    "body": "&gt; my point exactly, there is no evidence that Martin threw the first punch so I don't see how it is self defense.\n\nBecause we have the concept of innocent until proven guilty, Zimmerman is under no burden to prove it was self-defense. This is actually why he did not use the stand your ground provision in FL self-defense laws. Under that provision, if a person can with a 51% reasonability prove what they did was in self-defense they can use the stand your ground provisions and actually be protected from prosecution. However, since there were no witnesses of the actual initiation of the event, it would be useless to try. Ultimately, the burden of proof is on the state.",
                                    "author": "Astromachine",
                                    "created_utc": 1374007897.0,
                                    "replies": [
                                        {
                                            "name": "t1_cb49fs5",
                                            "parent_id": "t1_cb40le7",
                                            "body": "3 big points i have to make about it. \n\n\n1. This isn't like most murder cases (Casey Anthony and OJ come to mind) where the question is whether or not the defendant killed the victim. There is no reasonable doubt in that George Zimmerman killed Trayvon. \n\n2. I actually didn't know that stand your ground wasn't used. That makes it more ridiculous and unreasonable to me to view that an unarmed kid that you got in a fist fight with is a life threatening situation that gives you the right to kill him for. It is unreasonable to me that an killing an unarmed kid can be self defense. \n\n3. The beyond a reasonable doubt is a redicuous standard that gets used extremely unevenly. Scott Peterson was convicted with 0 physical evidence that he murdered his wife and was conviced on circumstancial evicence. He almost certainly did kill her imo but I see a lot more reasonable doubt there than in the zimmerman case. Also Assata Shakur was convicted when it was pretty much proven that she couldn't have shot the gun by medical evidence. Point being it's a rediculous standard that can't be universally applied and let's way too many guilty people go free. ",
                                            "author": "trophymursky",
                                            "created_utc": 1374032684.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cb4b5km",
                                                    "parent_id": "t1_cb49fs5",
                                                    "body": "&gt; This isn't like most murder cases (Casey Anthony and OJ come to mind) where the question is whether or not the defendant killed the victim. There is no reasonable doubt in that George Zimmerman killed Trayvon.\n\nKilling is not always murder. If you want to prove something is murder, you must prove it beyond reasonable doubt. \n\n&gt; I actually didn't know that stand your ground wasn't used.\n\nIt's not surprising, a lot of people are terribly misinformed about the case and what happened. \n\n&gt; That makes it more ridiculous and unreasonable to me to view that an unarmed kid that you got in a fist fight with is a life threatening situation that gives you the right to kill him for. It is unreasonable to me that an killing an unarmed kid can be self defense.\n\nThis wasn't a mere fistfight. According to the testimony of John Good, Trayvon was mounted on top of  Zimmerman in what he described as an MMA style similar to [this](http://lordn.files.wordpress.com/2009/10/mma-mount.jpg). We know this was going on for at least 45 seconds do to the [phonecall from one of the neighbors](http://en.wikipedia.org/wiki/File:Trayvon_Martin_Shooting_Call3.ogg). Most likely more, since she dialed 911 because she heard screams for help, so you could likely say about a minute. And yes, you can easily beat someone to death by repeatedly punching them in the head. We also know from the autopsy reports Trayvon didn't have any trauma to the face, so it wasn't a boxing match type of fight with the two trading blows. It was a savage beating. \n\nNow, imagine for a second, if this same sort of attack was happening to a woman. Do you think she should be able to use deadly force?\n\n&gt; The beyond a reasonable doubt is a redicuous standard that gets used extremely unevenly.\n\nIt gets used in the best way possible for our justice system, which is to ask a jury of your peers what they think. Keep in mind it is not 'any' doubt, it is a 'reasonable' amount of doubt.\n\n&gt; Scott Peterson was convicted with 0 physical evidence that he murdered his wife and was convicted on circumstancial evicence. He almost certainly did kill her imo but I see a lot more reasonable doubt there than in the zimmerman case. Also Assata Shakur was convicted when it was pretty much proven that she couldn't have shot the gun by medical evidence. \n\nI think you're misunderstanding just what circumstantial evidence is and what it does in a case. Using your examples, you feel that it is wrong that Scott Peterson was convicted based on circumstantial evidence. However, you use expert testimony (that of a doctor) to show that Assata could not have fired a gun. Expert testimony is also circumstantial evidence. Fingerprints are also circumstantial evidence, so lets say we find a murder weapon, and your prints are on it. That's pretty big right? Well it is also circumstantial. ",
                                                    "author": "Astromachine",
                                                    "created_utc": 1374038253.0,
                                                    "replies": []
                                                },
                                                {
                                                    "name": "t1_cbcwihs",
                                                    "parent_id": "t1_cb49fs5",
                                                    "body": "As to point number 2, you ask me if I've ever been in a fight, yet you clearly fail to grasp that being punched repeatedly in the head can absolutely be fatal.  It happens all the time.\n\nIf I have someone on top of me, punch my head, bouncing it off the cement, with no sign of stopping....am I supposed to wait until I pass out and hope he doesnt continue?  No, absolutely not.  In that situation, as Zimmerman has claimed (and the evidence has pointed to) he was 100% well within his right to defend himself with lethal force if he felt like his life might be in danger.\n\nAnd I think in that situation, given the circumstance, it should be easy to think that anyone could feel that their life could be in danger if it was an ongoing attack that showed no signs of slowing down or stopping.\n\nTrayvon Martin is dead because Trayvon Martin threw the first punch, and then mount and continue to beat Zimmerman bloody.  \n\nIf Martin simply gets in his face and starts a verbal argument, and then Zimmerman shoots, its a completely different story and Zimmerman would be jail.  Martin sealed his fate with the vicious, continuing attack.  Plain and simple.  I don't know how someone with an honest bone in their body could argue otherwise.\n\nTrayvon was not \"unarmed\", fists can absolutely be a deadly weapon.",
                                                    "author": "ZimmTrayThrowaway",
                                                    "created_utc": 1375138869.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cbcz0ji",
                                                            "parent_id": "t1_cbcwihs",
                                                            "body": "First, Zimmerman picked the fight, and no one knows who threw the first punch. The likelihood of a regular street fight going into murder is next to none (in fact, i'd like to look at the percentage of fights that end in death, and i'll take an educated guess that it rounds down to 0 percent). \n\nSecond, the idea that it was an on going one sided attack is george zimmerman's story, of course he would say that. He was sure that Martin was guilty of something because he was a black guy in a hoodie and was angry about crimes that happened in the neighborhood. Of course he's going to tell that side of the story. The evidence was that a grown man was in a fight against a kid, the grown man was bigger and had formal training while the kid had none and didn't participate in a sport in years. \n\nWhat the evidence points to is there was a fight, it was even until Zimmerman started loosing, he pulled out his gun, martin started screaming, then zimmerman pulled the trigger. ",
                                                            "author": "trophymursky",
                                                            "created_utc": 1375145881.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cb4019l",
                    "parent_id": "t1_cb3q90x",
                    "body": "&gt;Only 2 people know who threw the first punch, Zimmerman and martin. Zimmerman got to tell everyone that martin threw the first punch and Martin can not tell anyone his side of the story because Zimmerman shot him.\n\nYou realize that in 2013  we have doctors and coroners who can analyze these things based on bruises on the body right? As in the very evidence used in the case.",
                    "author": "tableman",
                    "created_utc": 1374006553.0,
                    "replies": [
                        {
                            "name": "t1_cb49a96",
                            "parent_id": "t1_cb4019l",
                            "body": "sure, let's go over the evidence,\n\nZimmerman lied about following him. \n\nDoctor said zimmermans wounds (less than an inch) were not consistent with head being repeatedly slammed against the concrete. \n\nNone of zimmerman's blood was found on trayvon's hands.\n\nWitness said bigger man was on top, zimmerman is bigger (taller and heavier) than martin. \n\nZimmerman had a years worth of mma training, martin had no formal training. \n\nSeems unlikely to me that martin threw the first punch, and even if he did there is no sane court that would punish assault with the death penalty. ",
                            "author": "trophymursky",
                            "created_utc": 1374032233.0,
                            "replies": [
                                {
                                    "name": "t1_cb4g3rk",
                                    "parent_id": "t1_cb49a96",
                                    "body": "&gt; Zimmerman lied about following him.\n\nHow so? If Zimmerman followed Martin after hanging up with the 911 operator, I'd think he'd need more than 30 feet to catch up with Martin (the fight ended a mere 30' south of the t-intersection).\n\n&gt;Doctor said zimmermans wounds (less than an inch) were not consistent with head being repeatedly slammed against the concrete.\n\nA paid witness for the prosecution said one thing. A paid witness for the defense said another thing.\n\n&gt;None of zimmerman's blood was found on trayvon's hands.\n\nIt was raining and they only checked under his fingernails. Your fingernails are well hidden in a fist.\n\n&gt;Witness said bigger man was on top, zimmerman is bigger (taller and heavier) than martin.\n\nZimmerman is shorter and heavier. Martin is taller and lighter. The only true eyewitness, and the closest person to the fight, said Zimmerman was on bottom, judging by both skin color and clothing color.\n\n&gt;Zimmerman had a years worth of mma training, martin had no formal training.\n\nZimmerman got as far as learning how to punch a punching bag. He actually wanted another class, but mma is what fit his class schedule. I think this is an absurd point that people try to make, that somehow Zimmerman was a fighting machine. He *clearly* wasn't. He suffered two black eyes, a broken nose, and lacerations on the back of his head. Martin is the one who actually had a history of fighting people, as evidenced by his texts and Rachel's testimony.\n\n&gt;Seems unlikely to me that martin threw the first punch, and even if he did there is no sane court that would punish assault with the death penalty.\n\nSeems unlikely to me that Zimmerman threw the first punch. There were no defensive injuries on Martin and there is no record of Zimmerman ever having been in a fight.\n\nWhen people picture a fight, they think of two people standing up and dishing out punches. They don't think of one person pinning the other down and bashing his head into rock and cement. That may be considered attempted murder or at least aggravated assault. ",
                                    "author": "TitoAndronico",
                                    "created_utc": 1374065897.0,
                                    "replies": [
                                        {
                                            "name": "t1_cb4iua0",
                                            "parent_id": "t1_cb4g3rk",
                                            "body": "&gt;How So\n\nHe said he was going to find the street name, he lived in an area with 3 streets for years, I'll call bs on that one. \n\n&gt;a paid witness\n\nfair point, still shows that only a paid witness says it could be concrete, not good evidence imo. \n\n&gt;it was raining ....\n\nThey found blood on zimerman, theres no reason it would only be on one person and not another\n\n&gt; said Zimmerman was on bottom\n\nidk which witness you are talking about, but a witness said the bigger man was on top, and another witness said there was punches being thrown, but no banging head on concrete. \n\n&gt; Zimmerman got as far as learning how to punch a punching bag\n\nI think that's bs, he was there for 4 hours a week for a year and the gym advertised that plan after the testamony. He has formal fighting experience and was bigger than martin. Martin had no formal fighting experience. \n\n&gt;no record of zimmerman ever having been in a fight\n\nnot true, he was charged with battery of a law enforcement officer, and that was before his mma training. \n\n\n&gt;that may be considered attempted murder\n\nthat is unreasonable. Zimmerman shot an unarmed kid that's worst crime may have been assault (and that's not even known). Martin had no criminal record and zimmerman had one. \n",
                                            "author": "trophymursky",
                                            "created_utc": 1374074648.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cb4zazr",
                                                    "parent_id": "t1_cb4iua0",
                                                    "body": "&gt;He said he was going to find the street name, he lived in an area with 3 streets for years, I'll call bs on that one.\n\nIf you listen to the interview at the police station, Zimmerman incorrectly states that Twin Trees changes its name when it shifts from NS to EW. In other neighborhoods that would be the case. But there isn't a reason for him to know the name of a street that is 230' long and has only one building on it. That E-W segment is also 1000' from his house and nearly useless for him because Retreat View is faster. In my neighborhood, the nearest street from me that I don't know the name of is only 500' away...and why should I? I never use it. I also can't remember the name of the place I got pizza last weekend. I love that place.\n\n&gt; They found blood on zimerman, theres no reason it would only be on one person and not another\n\nThey found Zimmerman's blood on Martin's hoodie. The only DNA tests they did on Martin's body were looking under his fingernails and inside his cheek.\n\n&gt;idk which witness you are talking about, but a witness said the bigger man was on top, and another witness said there was punches being thrown, but no banging head on concrete.\n\nJohn Good is who I am talking about. He saw Martin's back, so he couldn't see what his arms were doing, just that they were moving up and down in the dark. I know a witness said the bigger man was on top, but one was taller and one was heavier. Which is bigger? Also, Zimmerman was seen by witnesses to be both on top and bottom. On bottom by John Good during the fight, and on top afterward when he was restraining Martin. So when one witness said 'the person on top got up,' that is true. A gunshot got her attention and she saw the very end.\n\n&gt; He has formal fighting experience and was bigger than martin. Martin had no formal fighting experience.\n\nZimmerman's trainer testified that Zimmerman signed up for boxing but he couldn't fit it into his class schedule so he took MMA because it fit. He said Zimmerman was just learning how to throw punches. \n\nMartin's texts show he was a street fighter. There is video of him refereeing and his texts refer to a three round fight with an opponent. Rachel asked him why he was fighting so much. His brother asked him to teach him how to fight.\n\n&gt; he was charged with battery of a law enforcement officer\n\nZimmerman saw a plain clothed police officer push one of his friends up against the wall during a party. He was being arrested for underage drinking (20 y/o). Zimmerman rushed to his friends' defense and pushed the police officer away from his friend. Zimmerman contended the officer pushed him first, and before any identification was made.",
                                                    "author": "TitoAndronico",
                                                    "created_utc": 1374117602.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cbcwm6p",
                                                            "parent_id": "t1_cb4zazr",
                                                            "body": "He's got no reply I see.  Just parroting the mass media false talking points like a fool.",
                                                            "author": "ZimmTrayThrowaway",
                                                            "created_utc": 1375139154.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_cb4h4lq",
                                    "parent_id": "t1_cb49a96",
                                    "body": "&gt;Witness said bigger man was on top, zimmerman is bigger (taller and heavier) than martin.\n\n&gt;Zimmerman had a years worth of mma training, martin had no formal training.\n\nSo you were is the evidence of zimmerman physically hurting marvin.\n\nWhy did they say the gun shot came from a different angle?\n",
                                    "author": "tableman",
                                    "created_utc": 1374069611.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cb3vhvn",
            "parent_id": "t3_1ie2ew",
            "body": "Your arguments aren't very strong.  You do have a point but you're using the weakest argument of all things dealing with racism \"if x was this color and y was that color this would have been so different!\"    \n\nI have a question for you.  How many of your facebook friends were uninformed of the actual facts of the trial?  A lot?  Now how would you feel if you were a black man getting the media spin version?  Upset?  You bet.  The response of the black community is unsurprising considering the fictional trial they're outraged about.  However, it seems \"disgusting\" because an informed person knows what the actual trial was about. ",
            "author": "[deleted]",
            "created_utc": 1373995629.0,
            "replies": []
        },
        {
            "name": "t1_cb3z7ap",
            "parent_id": "t3_1ie2ew",
            "body": "&gt; if Zimmerman had been black, and just a part of a neighborhood watch ... saw a sketchy looking white teenager ... No one would bat an eye. And if Martin acted like some white trash punk and started a fight, no one would have given a shit if he was shot dead.\n\nFirst of all, I think you are wrong, I think a lot of people would give a shit, but perhaps for different reasons. I think the only reason this case turned into a circus in the first place, is that they let Zimmerman go based on Florida's Stand Your Ground law. Had they instead arrested him and let him plead his case of self defense in the first place, this circus was rather unlikely, and the final verdict may have been the same.\n\nMany people, I think are under the impression that he still got off thanks to SYG which isn't the case, he was found not guilty for reasons of self defense. And what it comes down to is, the jury, based on the framework they were given, I think made the correct ruling, however, I think that the court (as it so often does) failed, because what Zimmerman did ***was wrong***, morally and ethically, just not legally. He followed a \"sketchy\" kid, even when told by a 911 operator to not do so; and either confronted, or was confronted by, the person he was pursuing, and a fight occurred. At some point during the fight, he felt his life was in peril, so he shot the kid, how is that not a crime? The jury was basically told that the only thing that mattered was the beginning of the fight, up to the shot being fired, all he did prior didn't matter, how does that make sense?\n\nSo the \"vocal majority\" (which I think in reality is a vocal minority) are mad because they've *been* Trayvon at some point in their life, they've been looked at with undue suspicion, and they could have been the kid followed by some upjumped vigilante type and shot when they lashed out at their pursuer; and they wouldn't want their killer to be found not guilty of any wrong doing.\n\nI don't think they are wrong for being angry, but they should be angry at the law makers, and justice system. Whether Zimmerman was racist or ageist, or just paranoid, it doesn't matter, he did *something* wrong and the justice system failed, and so people are mad.",
            "author": "notian",
            "created_utc": 1374004541.0,
            "replies": []
        }
    ]
}