{
    "name": "t3_1e63c7",
    "title": "I believe Varg Vikernes murdered Euronymous for self-defense. CMV",
    "body": "It makes sense that Euro was planning a snuff film of Vikernes death, being the fucked up guy he was.\n\nSure, he was into that only to appear \"evil\", but Vikernes was a threat to this. Euronymous said he believed in a biblical Satan, but the motivation for Vikernes burning churches was to show how angry he was on the christians who desecrated the Norwegian culture and religion. Euronymous wanted copycats, he wanted people to give attention to him, but Varg kept saying otherwise - when Euro decided to get rid of him, Varg stabbed him to defend himself.\n\nThat's why I believe that, as insane and fucked-up that Varg is, Euro's death was for self-defense.",
    "author": "TWILIGHT_IS_AWESOME",
    "num_comments": 2,
    "created_utc": 1368334119.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1e63c7/i_believe_varg_vikernes_murdered_euronymous_for/",
    "comments": [
        {
            "name": "t1_c9x54bu",
            "parent_id": "t3_1e63c7",
            "body": "It's all speculation what Euronymous was going to do. Varg says he was going to kill him, so he had to do it first, but who knows? But from a legal standpoint, it's not self-defense unless your life is in danger. Varg willingly went to Euro's place, and supposedly was attacked by Euro in his underwear. Euro was found with several stab wounds, including several in his back indicating that he was fleeing. This goes beyond the definition of self-defense. \n\n ",
            "author": "zimmer199",
            "created_utc": 1368336184.0,
            "replies": []
        },
        {
            "name": "t1_c9xajdg",
            "parent_id": "t3_1e63c7",
            "body": "I wish I could find the article, but I read one where Ihsahn was talking about this whole thing and he made it pretty clear he thought Varg was being paranoid and that Euronymous wasn't planning anything.  I also have read all of Vargs take on the story and it really feels like it's a crazy person making up reasons for his crazy behavior.  Also, notice how Varg flipped out in prison saying people were out to kill him as well. (yet was never harmed in prison) I think the guy just has paranoid delusions.",
            "author": "crayonconfetti",
            "created_utc": 1368371722.0,
            "replies": []
        }
    ]
}