{
    "name": "t3_1fmiv1",
    "title": "I think JFK was shot by a lone gunman (Oswald). CMV",
    "body": "To go along side the WTC 9/11 post.\n\nTo date:\n\n1) the \"magic bullet\" theory has been proven possible by multiple independent testers. Its not only possible, but recreatable. \n\n2) Firing that amount of shots with that rifle is not only possible, but easy, especially for a trained marskman like Oswald.\n\n3) To date, there has been 0 evidence for any other shooters. No shell casings. No recovered bullets. No pictures of a gunman. No reliable witnesses of more than one shooter. Nothing.\n\n4) LHO killed a cop later that day. No one seems to ever bring that up. He killed him with a pistol he had ordered through the mail. Ballistics matches the gun. You don't kill a police officer on a whim.\n\n5) \"Back and Away\" - A head is going to react like that when shot from behind (as in consistent with the lone gunman theory)\n\nThere is nothing I love more than a good conspiracy theory, but there is absolutely no evidence suggesting more than one shooter, only a shitload of suspicious/fishy shit that went down. ",
    "author": "CherrySlurpee",
    "num_comments": 9,
    "created_utc": 1370312458.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1fmiv1/i_think_jfk_was_shot_by_a_lone_gunman_oswald_cmv/",
    "comments": [
        {
            "name": "t1_cabq4ku",
            "parent_id": "t3_1fmiv1",
            "body": "\nPosting from my phone and its been a while since I discussed this last but...\n\n1) The bullet would have had to go through Jfks neck, angled downward paused in the air for multiple seconds then hit the guy in front of him in the arm, then turn and wedge into his thigh. All of this power to go through multiple bodies from a mail order rifle. \n\n2) An experiment was performed by a news station ( wish I knew video source) almost half the time the gun jammed, and shooters that were a lot better then oswald would have been had trouble doing the same shooting.\n\n3) The man in front of JFK said that bullets were coming from everywhere when they were driving.\n    In the ? Zapruder footage? you can hear a sound coming from behind that sounds like a gunshot but could be a car backfire. \n4) Oswald went to a movie after the supposed shooting and walked in without buying a ticket. When the theater called police to report the man not paying for a ticket something like 20 police showed up. Why would that many police come for an offence as small as not paying for a movie. \n\n5) His head ricocheted backwards, that's not how it should have If hit from behind. That's like getting punched in the face and instead of falling away from the punch your head would fall into the punch.\n\n\nI wish I could tell you more but I'm tired and don't have the capability to source/ check everything  right now.\n\nI highly suggest watching the documentary on the JFK assassinaton, it points out a ton more holes then what I posted here.\n\nAnyways I'm tired but I hope my attempt to persuade you will push you towards researching further on your own. \n",
            "author": "startover4",
            "created_utc": 1370316410.0,
            "replies": [
                {
                    "name": "t1_cabqgjf",
                    "parent_id": "t1_cabq4ku",
                    "body": "1) like I said, its been recreated multiple times. The \"changes angle mid air\" argument is wrong, the way the seats were arranged, Kennedy was significantly higher than the seat infront of him. \n\nrecreations: \n\nhttp://www.youtube.com/watch?v=_RX2phbWmgA\n\nhttp://www.youtube.com/watch?v=PfSXkfV_mhA\n\n2) I've personally shot better than Oswald. The distance was less than 100 yards (Marines train up to 500 meters, the 50s and the 100 targets are basically \"freebies\")\n\n3) Out of ~180 witnesses there, 138 of them said they heard three shots (consistent of the single shooter explanation) \n\n4) Oswald shot the cop and then ducked into the theater. Brewer (a store clerk who said he saw Oswald acting suspicious) was the one who reported him, not for not paying for the movie, but rather for acting suspicious. Given that the POTUS (And a cop) were just shot, sending 20 cops wouldn't be unheard of.\n\n5) Actually if you shoot a large hard sphere filled with goo on the inside, the result is that the object will come back at you. \n\nexample here: http://youtu.be/iSg6XwXe6WQ?t=26m53s\n\nAnd my main point is... there is 0 evidence of any other shooter. Nothing. Absolutely no solid evidence.",
                    "author": "CherrySlurpee",
                    "created_utc": 1370317374.0,
                    "replies": [
                        {
                            "name": "t1_cabvkcs",
                            "parent_id": "t1_cabqgjf",
                            "body": "http://upload.wikimedia.org/wikipedia/commons/thumb/0/03/CE399side.jpg/220px-CE399side.jpg\n\nThis is what that bullet looks like I don't know if you shoot but after going through two people this is not how a bullet should look.\n\nAlso your video doesn't seem to count for the guy in font of him who got hit which is the nagic bullet theory. I only had time to watch parts but I couldn't find that part. ",
                            "author": "startover4",
                            "created_utc": 1370343851.0,
                            "replies": [
                                {
                                    "name": "t1_cabyh4q",
                                    "parent_id": "t1_cabvkcs",
                                    "body": "the video covers that, the bullet reacts the same way and causes wounds almost identical to those suffered by JFK and Connolley. ",
                                    "author": "CherrySlurpee",
                                    "created_utc": 1370357127.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "name": "t1_cabvn57",
                            "parent_id": "t1_cabqgjf",
                            "body": "\"In comparing their data to Guinn's testimony as well as to NRC report findings, the team determined that many bullets within a box of Mannlicher-Carcano bullets have similar composition, leading them to conclude that two-element chance matches to assassination fragments are not extraordinarily rare -- even less rare, considering they came from the same box.\"\nhttp://www.sciencedaily.com/releases/2007/05/070517142528.htm\n\"A new, peer-reviewed article in Science and Justice, a quarterly publication of Britain's Forensic Science Society, says the NAS panel's study was seriously flawed. It says the panel failed to take into account the words of a Dallas patrolman that show the gunshot-like noises occurred \"at the exact instant that John F. Kennedy was assassinated.\"\n\nIn fact, the author of the article, D.B. Thomas, a government scientist and JFK assassination researcher, said it was more than 96 percent certain that there was a shot from the grassy knoll to the right of the president's limousine, in addition to the three shots from a book depository window above and behind the president's limousine.\n\nG. Robert Blakey, former chief counsel to the House Assassinations Committee, said the NAS panel's study always bothered him because it dismissed all four putative shots as random noise -- even though the three soundbursts from the book depository matched up precisely with film of the assassination and other evidence such as the echo patterns in Dealey Plaza and the speed of Kennedy's motorcade\"\nhttp://whatreallyhappened.com/RANCHO/POLITICS/JFK/bbcgrassy.htm",
                            "author": "shayne1987",
                            "created_utc": 1370344420.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cac4s8o",
            "parent_id": "t3_1fmiv1",
            "body": "Stephen Hunter is an author of fiction whose main characters are gunmen.  He recently put out a [book](http://www.amazon.ca/Third-Bullet-Bob-Swagger-Novel/dp/145164020X/ref=sr_1_1?ie=UTF8&amp;qid=1370373459&amp;sr=8-1&amp;keywords=the+third+bullet) where the main character studies the assassination and although a work of fiction, it raises some interesting points to someone like me that never really studied JFK's death.  One thing raised in the book related to your point #4 is the cop killing.  LHO went home after the shooting and picked up that pistol.  Why?  If you are planning on assassinating the president would you not carry your gun with you that day?  Also, Oswald shot the cop after he was clearly dead.  It was almost if he was angered at something, not just nervous about the crime he had just committed.\n\nOther real facts that stuck out to me after reading the book include the point that Oswald shot JFK after the car completed a very slow 120 degree turn onto Elm Street right in front of Oswald and was heading away from Oswald.  Why not shoot closer and when the car was virtually stopped turning the corner?  Also, Oswald ran through a bus station after the killing.  Why not just hop on a bus a clear town?  These may be well studied questions in conspiracy circles but they were new to me.\n\nNow the presence of troubling questions doesn't prove the existence of conspiracy.  However, there is the possibility of the truth being other than we currently believe it to be.            ",
            "author": "headoverheals",
            "created_utc": 1370374345.0,
            "replies": [
                {
                    "name": "t1_cacasni",
                    "parent_id": "t1_cac4s8o",
                    "body": "Oswald returning home and then leaving could be multiple things. While most people say he returned home to get his gun, as far as I'm aware the only witness of him in the house was his housekeeper, who said he changed clothes (which could have been a good reason to go home).\n\nAs for the angle, that one I can answer. You can [see the view](http://texashistory.unt.edu/ark:/67531/metapth49531/small/) of the window. To shoot him in the turn, he would have had to angle his rifle down at an extreme angle, and/or actually stick the barrel pretty far outside of the window. Also, shooting a target that is moving away from you is the easiest \"moving target\" shot. Its essentially just getting smaller (I guess moving towards you would be easier). ",
                    "author": "CherrySlurpee",
                    "created_utc": 1370390589.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cbajvl7",
            "parent_id": "t3_1fmiv1",
            "body": "Let's give Oswald the same benefit we give every person accused of a crime in this country, guilt beyond a reasonable doubt.  Had Oswald not himself been murdered (just one small piece of the \"shitload of suspicious/fish y shit that went down\" which for some reason doesn't count as evidence) then would he have been found guilty beyond a reasonable doubt?\n\nSay you're the prosecutor.  You can't bring in that he killed a police officer, because one murder does not prove the other.  Plus, it's doubtful you can prove Officer Tippet's murder beyond a reasonable doubt either, but that's too far off topic.\n\nHere is just a tiny small sampling of the reasonable doubt the defense can present:  Why did Oswald not shoot when the car was heading directly towards him, instead waiting until JFK was moving away from him at a strange angle behind a tree?  Why was there no gun powder residue on his face if he had shot a rifle?\n\nThen yes, you have things like the magic bullet and the way JFK's head snapped.  You may choose to believe the non-conspiracy experts but there are just as many experts on the other side.  That too can cause doubt.  Some of the best marksmen in the world have failed to pull of his shots.  His rifle scope was crooked on top of all that.\n\nThen there's the way he was casually sipping a coke on a lower floor thirty seconds after the shooting, and no one saw him in the stairwell.  And the way the guy who gave him a lift to work said his package was way too small to have been carrying a rifle.\n\nThe FBI did find a few fingerprints but only after Dallas had failed, and the chain of custody for the rifle to this day has not been established.  Even if the judge does allow this into evidence, the defense can argue it's part of a cover-up.  After all, there's two botched autopsies, the limo was immediately cleaned and repaired before evidence could be gathered, the location of the wounds changed to make the case more believable, and the way none of Oswald's post-arrest interviews were recorded or had notes.  That he wasn't afforded a lawyer only hurts the case more.\n\nThen there are the many eye witnesses that say the shots came from a different location or heard more than three shots.  The prosecution might make an argument about echos and whatnot but it still adds to the reasonable doubt.\n\nThere's plenty other stuff; that's really just the tip of the iceberg.  The point is that there is so much doubt to the lone gunman theory that it simply cannot be assumed true.",
            "author": "heelspider",
            "created_utc": 1374816428.0,
            "replies": []
        },
        {
            "name": "t1_cddmfth",
            "parent_id": "t3_1fmiv1",
            "body": "The thing was JFK is that a lone gunman does not equal no conspiracy. FACT: Kennedy himself said he wanted out of Vietnam.\nFACT: Kennedy himself said he wanted to destroy the CIA. \nFACT: Kennedy dies and none of the above happens. \nand even if there was NO conspiracy, the Vietnam war was still fucked up and extremely unpopular.",
            "author": "Cocaineniggums",
            "created_utc": 1384376572.0,
            "replies": []
        }
    ]
}