{
    "name": "t3_1o84ro",
    "title": "I think Tim Tebow is not an NFL-caliber QB. CMV",
    "body": "Simply put, Tim doesn't have the arm. His QB rating, an objective measure of performance, is atrocious. I don't believe 4th quarter comebacks justify Tebow's believers, not in the games he played where he lead a clearly superior Denver team into a 4th-quarter deficit.  He did have a playoff win.  I'm convinced I personally would have been able to beat a banged-up steelers team with the surrounding cast Tebow had. I think Kyle Orton was the better QB the whole time, and he now backs up Tony \"I can't even throw a temper tantrum without it turning into a pick-6\" Romo.  \n\nMark Sanchez was the obvious choice in New York.  Tebow clearly couldn't beat out the Buttfumbler for a starting job, and couldn't beat out Greg McElroy for the backup job.  His tryout with New England was a good move by the front office to draw attention away from the depleted receiving corps, Aaron Hernandez murder trial, and the possibility the Pats might not win the division for the second time in 10 years. \n\nAfter working out with numerous QB gurus, under several head coaches, being mentored by good QBs, and playing football at a competitive level for over a decade, Tebow knows his strengths and weaknesses.  Throwing a football isn't something he can consistently do well at the NFL level, even in an emergency backup/special teams situation.\n\n*My assessment of his skill has absolutely nothing to do with his faith and evangelism, which I find to be off-putting and unprofessional.  This has nothing to do with his being named \"Most Influential Athlete\" by Forbes.  This only slightly has to do with the media circus that surrounds him, and the die-hard Tebow fans that seem to value his beliefs over his W's and L's.",
    "author": "tquintana2",
    "num_comments": 11,
    "created_utc": 1381505800.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1o84ro/i_think_tim_tebow_is_not_an_nflcaliber_qb_cmv/",
    "comments": [
        {
            "name": "t1_ccpsrei",
            "parent_id": "t3_1o84ro",
            "body": "How can we argue something that the NFL feels the same about. He's not a NFL caliber QB since he doesn't play in the NFL.",
            "author": "Jimmychichi",
            "created_utc": 1381522365.0,
            "replies": []
        },
        {
            "name": "t1_ccpto7x",
            "parent_id": "t3_1o84ro",
            "body": "Tim Tebow hasn't been given a fair shot to prove if he is NFL caliber or not. There are lots of players who get labelled as not NFL caliber (while in college, the combine, tryouts, etc.), however many of them end up having productive NFL careers. Additionally, there are many \"can't miss\" prospects that end up missing very hard (Ryan Leaf, Tim Couch, Akili Smith, Joey Harrington, Vince Young, etc. etc. etc.)\n\nI also think Tebow sucks. But he is NFL caliber- albeit I wouldn't call him starting caliber. Do you consider Blaine Gabbert to be NFL caliber? What about someone like Ryan Fitzpatrick? Brady Quinn? What about every backup in the NFL? ",
            "author": "fanningmace",
            "created_utc": 1381524629.0,
            "replies": []
        },
        {
            "name": "t1_ccpv6xh",
            "parent_id": "t3_1o84ro",
            "body": "Clearly, he is, or he would never have played in the NFL. \n\nYou need to define \"NFL-caliber\" more strictly. ",
            "author": "slapdashbr",
            "created_utc": 1381528805.0,
            "replies": []
        },
        {
            "name": "t1_ccpxmrv",
            "parent_id": "t3_1o84ro",
            "body": "First of all - define what you mean by \"NFL-caliber\"\n\nBecause most people would define it as a starter for an NFL team, which Tebow unquestionably was. He's probably about the 40th best professional quarterback in the work right now. Think how good you would have to be at your job to be top 40 in the world. Now, you don't want him as your backup, because you need to run a different offense when he's in the game. An ideal backup can come in with the same gameplan as the starter and execute it. That's not Tebow.\n\nNow back to his accomplishments. People talk about his game-winning drives in the 4th quarter. Watching Denver play those games, I think the coaching staff was a big factor holding him back. They would never allow him to throw the ball aggressively. Every series was run, run, pass on 3rd down, punt. There are no quarterbacks that are really good at 3rd and 8. Now, when they got behind at the end of the game, the coaching staff would finally let him throw a little bit, and he responded with impressive drives. John Fox is probably the most overrated head coach in the league. He had a couple good years in Carolina, but things turned to absolute shit at the end. Somehow, he got another HC job at Denver, and didn't actually do that great of a job. Now he's getting credit for PFM's success. Denver's offensive scheme right now is \"whatever the fuck Peyton wants.\"\n\nHowever, the way the game is set up right now, if you don't have a top-15 or so quarterback, you're going to be drating a new one, because that's what you need to compete consistently and possibly win a Super Bowl. Tebow showed no indication he was on this level. I call this the \"Andy Dalton rule\". ",
            "author": "carlosspicywe1ner",
            "created_utc": 1381536178.0,
            "replies": [
                {
                    "name": "t1_ccuehq2",
                    "parent_id": "t1_ccpxmrv",
                    "body": "&amp;#8710; - I had previously considered Tim Tebow to be unserviceable as a backup, not considering the need to have a different personnel set  and game plan around him to make him successful. You've C'd my V from \"lackluster arm, incompetent\" to \"lackluster arm, not the right fit for a backup QB role\"",
                    "author": "tquintana2",
                    "created_utc": 1382113906.0,
                    "replies": [
                        {
                            "name": "t1_ccueim4",
                            "parent_id": "t1_ccuehq2",
                            "body": "Confirmed: 1 delta awarded to /u/carlosspicywe1ner. ([History](/r/changemyview/wiki/carlosspicywe1ner))\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][[Subreddit](http://www.reddit.com/r/DeltaBot/)]",
                            "author": "DeltaBot",
                            "created_utc": 1382113967.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ccq583t",
            "parent_id": "t3_1o84ro",
            "body": "Forget the stats. Forget all those numbers. Kyle Orton was a decent quartback with the Bears. He started the Broncos 1-4. Then Tebow went 7-4 with THE EXACT SAME TEAM. I don't care how he did it. Then he won a playoff game at PITTSBURGH. Making the game winning throw. \n\nAnd don't say he couldn't beat out Sanchez. Rex Ryan is so stubborn. Look how awful Sanchez has been. It took in injury for him to be benched. \n\nBottom line, he has been given one chance to start. That was with Denver. Went 7-4 and had a road playoff win. Seriously, what more do you want?",
            "author": "kuhndog5",
            "created_utc": 1381566761.0,
            "replies": [
                {
                    "name": "t1_ccqbyt1",
                    "parent_id": "t1_ccq583t",
                    "body": "&gt;Then he won a playoff game at PITTSBURGH\n\nThey were in Denver. It was a home playoff game.\n\nhttp://scores.espn.go.com/nfl/recap?gameId=320108007\n\nhttp://en.wikipedia.org/wiki/2011_Denver_Broncos_season#Postseason_2",
                    "author": "CarterDug",
                    "created_utc": 1381602607.0,
                    "replies": [
                        {
                            "name": "t1_ccqciqk",
                            "parent_id": "t1_ccqbyt1",
                            "body": "You right my bad. Ok. Well he won a playoff game",
                            "author": "kuhndog5",
                            "created_utc": 1381604467.0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}