{
    "name": "t3_1bcfz2",
    "title": "I believe broken marriages make people undateable. CMV.",
    "body": "I gotta say, I've held this view for a long time.\n\nIn my experience, many people I have dated whose parents have broken relationships have had a series of issues.\n\nWhether they are just straight up \"daddy issues,\" or other kinds of problems, I have noticed a real correlation between separated parents and \"crazy\" significant others.\n\nThere are some exceptions-- for example, in which the role of a father has been \"filled\" by a very present grandfather, or something, but in most other cases, it causes real problems in the person's life that impact and cause problems with intimacy.\n\nEdit: Clarified \"children of\"",
    "author": "cmvacct",
    "num_comments": 4,
    "created_utc": 1364707455.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1bcfz2/i_believe_broken_marriages_make_people_undateable/",
    "comments": [
        {
            "name": "t1_c95llss",
            "parent_id": "t3_1bcfz2",
            "body": "I don't understand.  Are you saying divorced people are lousy to date?  Or that children of divorced parents are?",
            "author": "urnbabyurn",
            "created_utc": 1364708328.0,
            "replies": [
                {
                    "name": "t1_c95lnd3",
                    "parent_id": "t1_c95llss",
                    "body": "Excuse me, you're right, I will clarify.\n\nI believe the children of broken marriages are undateable.",
                    "author": "cmvacct",
                    "created_utc": 1364708519.0,
                    "replies": [
                        {
                            "name": "t1_c95mdz3",
                            "parent_id": "t1_c95lnd3",
                            "body": "I'm dating, my parents were divorced. /thread",
                            "author": "yawefappin",
                            "created_utc": 1364712049.0,
                            "replies": []
                        },
                        {
                            "name": "t1_c95qp1r",
                            "parent_id": "t1_c95lnd3",
                            "body": "I am married to a man whose parents got divorced, and then his dad came out as being gay. My husband is amazing. Loving, caring, and does everything he can to help our family. The fact that his parents are divorced is a total non-issue. \n\nMy parents are still married (for almost 30 years) and I believe that I had more issues with dating than my husband did.",
                            "author": "ImNOTasailor",
                            "created_utc": 1364743163.0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}