{
    "name": "t3_1ka8na",
    "title": "TCMV Tuesday - 08/13/13",
    "body": "Welcome to TCMV Tuesday, our weekly post where we can celebrate our ability to adopt a new mindset or gain another perspective. Tell us what experiences you've had outside our subreddit, either recently or in your lifetime, that made you think \"**This Changed My View**\". Give us your stories in the comments!\n\nYou can consider these questions to help get you thinking:\n\n* Known or met someone with an interesting ideology or opinion that caused you to reconsider your own?\n\n* Had an experience, good or bad, that changed your perspective?\n\n* Learned something new that challenged what you believed?\n\n* Ever have your tastes or interests changed?\n\n* Read an article or seen a video that got you thinking differently?\n\nAnd just as a reminder, comment discussions here are not debate-oriented, so there's no obligation to take opposing sides in conversations here (in other words, Rule 1 does not apply here).",
    "author": "AutoModerator",
    "num_comments": 6,
    "created_utc": 1376409608.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1ka8na/tcmv_tuesday_081313/",
    "comments": [
        {
            "name": "t1_cbmzl4i",
            "parent_id": "t3_1ka8na",
            "body": "The [Implicit Association Test](https://implicit.harvard.edu/implicit/) and the book *Blindspot: Hidden Biases of Good People* changed my view on prejudice and affirmative action. [Here](http://www.washingtonpost.com/wp-dyn/articles/A27067-2005Jan21.html) is a good article summarizing both.\n\nFor a long time, I was more or less opposed to affirmative action. I'm sure you guys have heard the justification before--\"we should be striving for equality, not giving the minority unfair advantages.\" That sort of thing. I didn't consider myself prejudiced, and didn't think that prejudice was a significant problem, really.\n\n*Blindspot* challenged some of my assumptions. The most important thing it pointed out was that good people, people who have every intention of treating others equally and avoiding prejudice, can be biased without realizing their biases. It presented a number of studies showing subtle ways that prejudice influenced things, such as:\n\n * [People with white-sounding names](http://scholar.harvard.edu/mullainathan/files/emilygreg.pdf) are more likely to get callbacks for interviews than equally qualified people with black-sounding names\n\n * a [disproportionate amount of scholarships go to white people](http://thinkprogress.org/yglesias/2011/09/13/318153/scholarships-go-disproportionately-to-white-students/?mobile=nc)\n\n * While black, white, and Hispanic people are [equally likely to be pulled over](http://www.bjs.gov/index.cfm?ty=tp&amp;tid=702), black people and Hispanics are more likely to have their cars searched or to be ticketed\n\nThe interesting idea for me was not that this discrimination exists, but that it is largely unintentional. A lot of people aren't actively trying to favor one group over another, but end up doing so anyway. That's why I now tentatively support affirmative action and similar policies--they present an opportunity to correct biases that many of us don't realize we have.\n\ntl;dr: prejudice isn't dead, it's just unintentional",
            "author": "CriminallySane",
            "created_utc": 1376418707.0,
            "replies": []
        },
        {
            "name": "t1_cbn3zi9",
            "parent_id": "t3_1ka8na",
            "body": "Honestly? Attending a large, urban, poverty-stricken public high school. \n\nI had previously only attended small, private schools generally composed of a very thin demographic (read: upper-class, conservative, white, Protestant). As some of these were religious, I had emerged rather I accepting of things which were against this religion. \n\nMy new school has more than 2,400 students across four grade levels. I have learned to respect poverty (people aren't poor simply because they're lazy) and later learned to not automatically apply this respect without knowing details (some people actually *are* poor because they're lazy). My views have been changed largely based off of the new cultures I was exposed to. I had honestly never met a person who wasn't straight, had little exposure to immigrants from other countries, and had rarely been presented with alternate viewpoints. \n\nThe most view-changing thing was probably meeting my best friend, who came out our sophomore year. I had been told that anyone who was gay was evil or gross. But my friend simply didn't fit this idea I had in my head, and I realized that everything the adults in my community had been saying was wrong. ",
            "author": "TheQueenOfDiamonds",
            "created_utc": 1376429633.0,
            "replies": [
                {
                    "name": "t1_cbnc0u1",
                    "parent_id": "t1_cbn3zi9",
                    "body": "&gt;and I realized that everything the adults in my community had been saying was wrong\n\nthat escalated quicky",
                    "author": "[deleted]",
                    "created_utc": 1376453149.0,
                    "replies": [
                        {
                            "name": "t1_cbnhj6a",
                            "parent_id": "t1_cbnc0u1",
                            "body": "Oops! I meant to type specifically what they had been wrong about.",
                            "author": "TheQueenOfDiamonds",
                            "created_utc": 1376481899.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cbn7972",
            "parent_id": "t3_1ka8na",
            "body": "I seldom have many strong opinions on popular topics - I guess that's why CMV kind of appealed to me - but I've been persistently supportive of LGBT rights, including the topic of same-sex marriage. I think that a lot of political opinions are formed from familarity to people and things that are close to us, so I think it's fair to say that I may not have been as sympathetic toward LGBT rights if in high school I hadn't personally been the audience to five different \"coming out\" stories, all of which were from my closest friends.",
            "author": "GameboyPATH",
            "created_utc": 1376438747.0,
            "replies": []
        },
        {
            "name": "t1_cbn7ku7",
            "parent_id": "t3_1ka8na",
            "body": "The feasibility of the \"Hyperloop\" proposal by Elon Musk was questioned by the following blog post, linked to by Reddit. Until I read it, I believed that Musk's proposal was somewhat well thought out, but I have changed my mind. (The engineering might make sense, the politics and cost do not.) \n\nhttp://stopandmove.blogspot.com/2013/08/hyperloop-proposal-bad-joke-or-attempt.html\n",
            "author": "davidmanheim",
            "created_utc": 1376439752.0,
            "replies": []
        }
    ]
}