{
    "name": "t3_1g9lx6",
    "title": "TCMV Tues- err, Thursday 6/13/13",
    "body": "Better late than never, right? .......right?\n\nWelcome to TCMV ~~Tuesday~~ Thursday, our weekly post where we can celebrate our ability to adopt a new mindset or gain another perspective. Tell us what experiences you've had outside our subreddit, either recently or in your lifetime, that made you think \"**This Changed My View**\". Give us your stories in the comments!\n\nYou can consider these questions to help get you thinking:\n\n* Known or met someone with an interesting ideology or opinion that caused you to reconsider your own?\n\n* Had an experience, good or bad, that changed your perspective? \n\n* Learned something new that challenged what you believed?\n\n* Ever have your tastes or interests changed?\n\n* Read an article or seen a video that got you thinking differently?\n\nAnd just as a reminder, comment discussions here are not debate-oriented, so there's no obligation to take opposing sides in conversations here (in other words, Rule 1 does not apply here).",
    "author": "GameboyPATH",
    "num_comments": 8,
    "created_utc": 1371130812.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1g9lx6/tcmv_tues_err_thursday_61313/",
    "comments": [
        {
            "name": "t1_cai3dw5",
            "parent_id": "t3_1g9lx6",
            "body": "A while ago around my junior / senior year in high school  we ha to do some sort of community service (being a catholic school and all). So i ended up doing some volunteer work at a homeless shelter. Now before this my experience with people who were homeless was very limited and i would say a bit negative. Homeless people. Seemed to me as just people who were drug addicts / alcoholics / etc. so anyway back to volunteering at the shelter. I ended up talking with a few guys about their lives and pasts and it was fascinating the things that they had done and also the unfortunate circumstances / decisions that led to where they are now. I also ended up playing a 3 hour game of chess which ended in a stalemate. Most of these guys were really intelligent and it surprised me to some degree. Anyway after that my view of those who are homeless has shifted a lot to seeing each person as an individual with their own unique past and not simply as a collective of people who are homeless, and that there are a lot of hard working homeless people out there who have jobs and families but they just can't afford the cost o living. ",
            "author": "arcticblue12",
            "created_utc": 1371133659.0,
            "replies": [
                {
                    "name": "t1_cai6zon",
                    "parent_id": "t1_cai3dw5",
                    "body": "Seriously, I work with homeless people once in a while. The stories that I hear from every single woman and man always sound ridiculous. They are stories (and I believe they are true!) that include moments of profound triumph, happiness and excitement simultaneously leading to a heartbreaking and depressing ending. I can honestly say that these stories brings me back to work in this field part time. ",
                    "author": "lonelyfriend",
                    "created_utc": 1371143241.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cai3hqh",
            "parent_id": "t3_1g9lx6",
            "body": "Well this isn't recently, but a few years ago I was a militant anti-theist and fully fledged atheist.  (Aka non agnostic God doesn't exist and I don't care I can't prove it).  I would argue with a Christian every single time they would open their damn mouths about anything.  Post about their mother dying from cancer?  I would silently rage (I wasn't enough of an asshole to comment) about how they should thank the doctors instead of praying and all that crap.  It was beginning to be an issue for everyone.  I would find people having a bible study in their dorm room and just barge in and debate everything they were reading.  I justified this by saying to myself that these people burned heretics not so long ago and they should be silenced.  I was not burning them alive, so therefore I was completely justified in giving them shit all the time.\n\nThen I grew up.\n\nThe more I talked to these people, the more I realized that they were people who were spurred on to think about the suffering in the world, the more I sympathized with them.  I realized most of these people were slightly misguided.  Not the reincarnation of the inquisitors, but a healthy skepticism for political leaders (curiously this often doesn't carry over to their religious leaders) and the bad practices first world countries carry out overseas.  I realized it was just another way to try and make the world a better place and the teenage angst \"debates\" were just a stain on Atheism and secularism in general. ",
            "author": "[deleted]",
            "created_utc": 1371133978.0,
            "replies": []
        },
        {
            "name": "t1_cai4tla",
            "parent_id": "t3_1g9lx6",
            "body": "A few years ago, I still had conflicting feelings about gay marriage, but my view was essentially that civil unions should be \"good enough\" for gay people. Then I saw [this video](http://www.youtube.com/watch?v=C3aJVsASJY0) by LGBT blogger Zinnia Jones, and something clicked for me.\n\nIt wasn't so much all the potential disadvantages she lists for civil unions, though that's a pretty compelling case in its own right. But at 1:30 in the video, she changes tack slightly.\n\nIf civil unions are identical to marriage in every way but in name, why is there a need to make a distinction at all? What does marriage offer that straight couples feel they need and gay couples can't have?\n\nIt doesn't matter whether it's a specific set of rights, or an air of dignity and formality, or even just the ability to fit in with everyone else. As long as there's *something* that makes straight people want marriage rather than a civil union, gay people will justifiably want it for similar reasons. Once I realized that, the necessity of gay marriage became obvious.",
            "author": "OtherSideReflections",
            "created_utc": 1371137725.0,
            "replies": [
                {
                    "name": "t1_cai5p4w",
                    "parent_id": "t1_cai4tla",
                    "body": "I held the same view when I was younger as well. I'm black, so it hit me pretty hard when I read a sarcastic comment that was something along the lines of: \"Civil unions are fine because separate but equal worked so well in the past.\"",
                    "author": "stormstopper",
                    "created_utc": 1371140019.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cai7tel",
            "parent_id": "t3_1g9lx6",
            "body": "I used fall a bit to the victim-blaming side of the rape &amp; sexual assault debate. In my defense, I believed that the actions of the perpetrator far outweighed those of the victim. However, I saw appropriateness in the analogies of \"you don't leave your house unlocked, do you?\" and \"you don't walk around town with $100 bills hanging out of your pocket, do you?\"\n\nI didn't quite understand why those analogies were wrong; but people kept telling me they were, so I tried to find a better analogy. What I found was much more personal and easier for me to understand.\n\nI was a \"nerd\" in school, quiter, still silently developing a wit that would save me later. Things were hardly as bad as the cliche, but I had to deal with bullying.\n\nSo there was the proper analogy, and if I could justify telling past-me that *I* needed to change to prevent bullying, then I could justify victim blaming elsewhere.\n\nI couldn't.\n\nAnd that's when it hit me: *Suggesting that the victim should change the way they behave implies that the violation is inevitable and that all they can do is try to make sure it happens to someone else.*\n\nFuck that logic.",
            "author": "AgentSnazz",
            "created_utc": 1371145250.0,
            "replies": []
        },
        {
            "name": "t1_caib6ze",
            "parent_id": "t3_1g9lx6",
            "body": "When my wife and I first met almost six years ago, I talked all the time.  Over the years, I grew more and more withdrawn, and it impacted our relationship until, recently, we reached the tipping point.  We would fight constantly, often over the same stupid crap.  I would tend to lean toward the idea that she was just being overly emotional and wished she could get over our fights like I did.  The fights would be resolved, but slowly, slowly, my wife would just grow emptier and I colder and more withdrawn.\n\nThen, one day last week, she expressed that unless we both took steps to fix our problems, our marriage would be over.  (I must add that we have two small children to spice up the mix.)  I can thankfully say that we have talked more, specifically about our relationship, in the past week than we have in a very long time.  We just started reading a book called *The Love Dare* together that we hope will help us with our struggles as a couple.  Tuesday we read the \"Love is Patient\" chapter, and the dare for that day was to not say anything negative to one another.  If we felt the need to, we were to hold our tongues.  Yesterday was the \"Love is Kind\" chapter, the dare being to do something unexpected for your spouse.  So I'm stopping to buy her flowers on the way home today.\n\nThe simple idea of reading and following this book together has really lifted my spirits, and I'm already more aware of how I treat my wife, both negatively and positively.  Hopefully in the next 38 days (there are 40 chapters in the book) we will continue to grow to understand one another better! ",
            "author": "ninj4z",
            "created_utc": 1371153462.0,
            "replies": [
                {
                    "name": "t1_caidubx",
                    "parent_id": "t1_caib6ze",
                    "body": "A chapter a day--that's pretty intense! Best wishes for you and your wife.\n\nI bought a book a couple of weeks ago and noticed immediate results in how happy my wife and I were after implementing a few of the book's simple suggestions, but I haven't opened it again since the day I bought it. You've inspired me to get back to it.",
                    "author": "protagornast",
                    "created_utc": 1371160742.0,
                    "replies": []
                }
            ]
        }
    ]
}