{
    "name": "t3_1lxqp0",
    "title": "I believe the religious \"fundamentalist\"/\"non-fundamentalist\" distinction and the baggage that goes with it has more to do with how accepting society is of certain behaviour and less to do with how well the people in question interpret text. CMV.",
    "body": "I admit the title might be a little confusing, but let me try to explain. \n\nI find the distinction a little absurd at times. \n\nLet us examine the fundamentalist Muslim or Christian - which is what we mostly hear about.\n\nBring up the issue of Islamic terror and you are bound to hear that this is a \"fundamentalist\" issue. I'm not sure what this argument is saying - that the people reading the Quran in a specific way are somehow wrong in doing so?\n\nBut somehow people who do so in a more socially acceptable way are right in doing so?\n\nOr take the issue of gay rights and Christianity. \n\nRecently lots of churches have reversed their stance on homosexuality in line with societal change and those who haven't done so are accused of being fundamentalist, even by other churches.\n\nAnd then there's the problem of \"allegory\" - which is a whole another can of worms.\n\nWhenever there is any behaviour that is seen as detrimental and performed by religious groups - they are disclaimed as \"not true X\". \n\nSo they aren't true Christians or Muslims or whatever - but they're still fundamentalist - how does that work?\n\nIs there a fundamental reason to not be fundamentalist?\n\nIf the religion somehow allowed for fundamentalism to be socially acceptable - no one would call out fundamentalism as such.\n\nSo the problem seems to lie with the religion which the fundamentalist belongs to and how it conflicts with society and  - rather than the fundamentalism itself. \n\nSo I believe that the claim is that religious people who act in ways that are generally not socially acceptable are fundamentalist or wrong about how they interpret their religion comes from an assumed moral superiority of religion. \n\nBecause if it was actually due to a correct interpretation - then religion couldn't be the morally superior system.\n\n",
    "author": "howbigis1gb",
    "num_comments": 4,
    "created_utc": 1378590863.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1lxqp0/i_believe_the_religious/",
    "comments": [
        {
            "name": "t1_cc3tuuk",
            "parent_id": "t3_1lxqp0",
            "body": "You can make this argument about Muslims but not with Christians because Christian fundimentalism is [based on a specific text,](http://en.wikipedia.org/wiki/The_Fundamentals) the Fundimentals. To be fair, Christian fundimentalism has become more subjective after Roe v. Wade because original fundimentalists believed that true Christians should stay out religion, while a lot of fundimentalists have changed their views post-1973. It is a very specific set of beliefs, though, that can only be called subjective because it has been changing over time.",
            "author": "its_all_one_word",
            "created_utc": 1378597747.0,
            "replies": [
                {
                    "name": "t1_cc4hytu",
                    "parent_id": "t1_cc3tuuk",
                    "body": "I see. \n\nBut I've only been born in 1989 and I was \"aware\" only much later, so I haven't seen really fundamentalism interpreted based on that text (this is actually the first time I've heard about it). \n\n&gt;It is a very specific set of beliefs, though, that can only be called subjective because it has been changing over time.\n\nI mean - that makes it subjective doesn't it?\n\nSo - what is the overall expectation for a Christian? That they shouldn't follow this text? \n\nI mean - socially it might be seen as regressive - but isn't a Christian just following the tenets of the religion?\n\nIs there any consensus on this?\n\nIf I am to understand correctly - if you follow this text - you are a fundamentalist Christian, and this is (today) a bad thing and one mustn't because?",
                    "author": "howbigis1gb",
                    "created_utc": 1378689515.0,
                    "replies": [
                        {
                            "name": "t1_cc4jj13",
                            "parent_id": "t1_cc4hytu",
                            "body": "I was also born in 1989.",
                            "author": "its_all_one_word",
                            "created_utc": 1378693705.0,
                            "replies": [
                                {
                                    "name": "t1_cc4vrn6",
                                    "parent_id": "t1_cc4jj13",
                                    "body": "Ok - but hasn't Christianity been fairly divided in the span of your life so far?",
                                    "author": "howbigis1gb",
                                    "created_utc": 1378746957.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}