{
    "name": "t3_1ga5l3",
    "title": "CMV My boyfriend wants a sphinx cat, but I can't see them being cuddly family members.",
    "body": "In the course of my life, my family has owned 7 felines, 3 of which are currently living.  All of them have been rescues, all of them have had fur.  While the personality of the cat is what I most enjoy, there is a definite weight to the \"cuddly\" factor as well.  I feel like if I owned a hairless cat, it wouldn't be as cuddly.  It would be weird to pet it.  They also look kinda creepy.  I feel like if I woke up in the middle of the night and saw it staring at me, I would freak out.  I would also feel kinda bad about adopting an expensive cat from a breeder when there are so many cats in shelters in need of good homes.  I'm that person that would adopt every lost lonely cat if I could, so having one specially \"made\" feels treasonous.  I'm open to any and all arguments on the matter. ",
    "author": "positmylife",
    "num_comments": 7,
    "created_utc": 1371146199.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1ga5l3/cmv_my_boyfriend_wants_a_sphinx_cat_but_i_cant/",
    "comments": [
        {
            "name": "t1_cai8u8v",
            "parent_id": "t3_1ga5l3",
            "body": "Hi there, I'm happy to hear that you help out those animals that need loving homes and while not ready to get a Sphynx cat, are at least open-minded about it.\n\nSo I'm gonna lay out the benefits and ignore the costs (related to care and such) that I'm sure you are aware of them with your cat experiences.\n\n1) Your *Boo-Bear*\n\nYeah, I'm talking about your boyfriend, I'm not sure what you call each other, so I'm gonna roll with that.  Your Boo-Bear, for whatever reason, thinks that he wants a sphynx cat.  While your statement above is unclear, I am going to assume that he has experience with cats as well.  Now I would recommend that you ask him why he wants this particular type, and what he thinks of the cuddly issue.  But, remember that there is always the added benefit of, as long as you talk about it and do it together, making your Boo-Bear happy.  I'm not saying go along with it just because he wants to, but try to understand why he wants to, and realize that this is a decision you are making together, which really adds to the relationship.\n\n2)  Holy shit that cat is sa-weeeeet!  First off, its distinct!  Your friends will be like \"woah! that's the coolest cat ever! So unique!\"  It stands up proud like its not gonna take shit from nobody!  Also, its basically a God!  The Egyptians worshipped em, its even named for a mythical creature of incredible intelligence.  Hell, the Egyptians were so terrified of those things that during the Battle of Pelusium, the Persian Cambyses II released hundreds of 'em and the Egyptian refused to fight, lest they harm their Cat-God.  Persians killed em where they stood! That cat helped conquer nations, can a tabby say that?\n\n2) Now its disputed but they may be better for people with allergies.  See they don't have fur, and people are allergic to chemicals in cat dander, which is spread all over by the fur, when they're petter or whatever.  But this ain't got none of those little allergy missiles!  So while the allergy problem isn't TOTALLY gone, it is reduced.  Now you can make friends with the lesser-folk!\n\n3)  ANYTHING can be cuddly!  My friend has porcupine he carries everywhere!  His roommate sleeps with his snake wrapped all around him!  He even just got a badass tarantula that sits on his shoulder!  See, you just need to appreciate your pet, and to accept it for what it has to offer!  Look here: http://imgur.com/a/Qsrl3\nSee, \"cuddly\" is a frame of mind!\n\nDisclaimer:  I am by no means an expert on cats or any other living organism for that matter.  Please consult the breeder, veterinarians, etc., for the REAL advice.\n\nI hope this helps!\n",
            "author": "sheriffofreddit",
            "created_utc": 1371147693.0,
            "replies": []
        },
        {
            "name": "t1_cai8wyf",
            "parent_id": "t3_1ga5l3",
            "body": "You definitely need to get a sphinx -- they're awesome.\n\nThe first time you come home from work and the sphinx is sitting in the doorway and won't let you go past, and you smile and try to pet her but she rears up threateningly and is all like:\n\n*\"What is that which in the morning goeth upon four feet; upon two feet in the afternoon; and in the Evening upon three?\"*\n\nand threatens to devour you and destroy Thebes if you don't answer it correctly, and you're like:\n\n*&lt;Sigh&gt; \"Man.  The answer is man.  You ask this same riddle every day...\"*\n\nand the sphinx squints at you, sort of miffed, but moves aside so you can go and be king and marry your own mom, and you come in and put your bag down on the couch and think about what you're going to have for dinner, and there's this horrible naked cat just staring at you like a judgmental old woman, you're going to think back to this moment and be all like:\n\n*\"I am soooo glad I posted that CMV.\"*",
            "author": "cahpahkah",
            "created_utc": 1371147879.0,
            "replies": [
                {
                    "name": "t1_cai9lt8",
                    "parent_id": "t1_cai8wyf",
                    "body": "∆ I loved Oedipus the King in high school and you just reminded me what a badass name Oedipus would be for a sphinx cat.  Jocasta would obviously be the female alternative.  I wonder how cliche that would be.  DM;GM (doesn't matter; greek mythology)",
                    "author": "positmylife",
                    "created_utc": 1371149559.0,
                    "replies": [
                        {
                            "name": "t1_caiaql7",
                            "parent_id": "t1_cai9lt8",
                            "body": "Confirmed - 1 delta awarded to /u/cahpahkah",
                            "author": "DeltaBot",
                            "created_utc": 1371152341.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_caie40w",
            "parent_id": "t3_1ga5l3",
            "body": "I've ever only come in contact with two psynx cats, but those two have changed my view of their cuddlyness, something you are concerend with, pretty fast.\n\nThey are warm! Really, I never touched such a warm cat and having it sit on you and cuddle up is really nice.\n\nPeach Fuzz. Both the cats I knew had it. I googled it and aparently while not all Spynx have peach fuzz it is not uncommon. If you want a Spynx with a tiny bit of hair I am sure you can find one. And, very soft peach fuzz + nice warm body makes a reallycuddly animal.\n\nNow, I totally get wanting to adopt  cats that need a loving home instead of paying a lot of money for some breed, but maybe you can combine the wish to help with getting your partner's favourite cat breed. I googled \"sphynx cat rescue\" and actually came up with a few links. Also, one of the cats I talked about before? He was the \"rrunt\" of his family, aparetnly the breeder thought he could not sell him and actually gave him for free to his new owner. So it's harder to rescue a purebreed cat, but possible.\n",
            "author": "misfit_hog",
            "created_utc": 1371161516.0,
            "replies": [
                {
                    "name": "t1_caiixhl",
                    "parent_id": "t1_caie40w",
                    "body": "∆  I think the biggest thing holding me back was spending a boat load of money for a pure breed.  I'd rather spend the money spoiling a cat that needs a home over one who is guaranteed to be bought for its pedigree.  If I could get a sphinx from a rescue, it would definitely change my mind.  Thank you.",
                    "author": "positmylife",
                    "created_utc": 1371175588.0,
                    "replies": [
                        {
                            "name": "t1_cairtvy",
                            "parent_id": "t1_caiixhl",
                            "body": "Confirmed - 1 delta awarded to /u/misfit_hog",
                            "author": "DeltaBot",
                            "created_utc": 1371217450.0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}