{
    "name": "t3_1ktfg5",
    "title": "I believe that The Prisoner of Azkaban is the worst book in the Harry Potter series. CMV.",
    "body": "When I started reading HP, the first four books had all been released and I caught up with them by the time OotP came out. By the time I finished GoF, I was in love with the series, but always had reservations about The Prisoner of Azkaban.\n\nIn my opinion, the best books in the series are the ones in which Harry's life is in direct danger from Voldemort or his forces, most obviously in The Chamber of Secrets, The Goblet of Fire, and The Deathly Hallows. At the time I read it, and ever since, I found the third book to be absent of danger or risk. Harry spends most of the book in fear of Sirius Black, who ends up being a misunderstood ally. Voldemort pretty much does nothing to hurt Harry (they hardly talk about him IIRC), leaving 400 pages to introducing characters and fleshing out teenage angst.\n\nNow, I'm not saying it's a bad book. I think every HP book is a great achievement in its own right. But I had, and still have, a lot of friends who thought the third book was by far the best in the series, and their reasons were never very convincing (there are werewolves, there is time travel, there is backstory, therefore it's cooler than the rest).\n\nPlease CMV.",
    "author": "wearing2raincoats",
    "num_comments": 8,
    "created_utc": 1377107123.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1ktfg5/i_believe_that_the_prisoner_of_azkaban_is_the/",
    "comments": [
        {
            "name": "t1_cbsfbmq",
            "parent_id": "t3_1ktfg5",
            "body": "&gt;In my opinion, the best books in the series are the ones in which Harry's life is in direct danger from Voldemort or his forces\n\nIn Prisoner of Azkaban, we the reader believe that this is the case for almost the entire book.  Sirius Black, who is believed to be a mass murderer and death eater, escaped from the the supermax wizard prison that is supposedly inescapable.  It's very likely he's after Harry, and an army of soul-sucking dementors are placed around the school.\n\nI think this makes for some great build up of suspense equal to (and in some cases surpassing) the other books.  We also get plenty of characteristically headstrong Harry doing things that are incredibly stupid or dangerous things.\n\nPerhaps in hindsight of the overall series, the book can be seen as more of a bridge helping lay the foundation for connecting Harry's and his family's past to the present, but I don't think that automatically makes it the worst book in the series.\n\nThe book also is the real beginning of the darker themes that continue through the rest of the series.  I think a lot of people enjoy this shift coming off books one and two.  They also like the fleshing out of Harry's past along with new elements like dementors and patronuses (patroni?) that continue to be relevant throughout the series.\n\n\n\n",
            "author": "Yolocaust_Survivor",
            "created_utc": 1377109038.0,
            "replies": []
        },
        {
            "name": "t1_cbsfdbt",
            "parent_id": "t3_1ktfg5",
            "body": "I'm not sure I get your criticism. Harry spends most of his time not being afraid of the Voldemort. In book 1 he is mostly afraid of Snape, in book 2 he worries about Draco and Hagrid, in book 3 he is mostly afraid of Sirius, in book 4 he ignores Voldemort and focuses on the tournament, in book 5 he messes about for the entire book having student dramas and being bullied by a teacher, in book 6 and 7 things start heating up. \n\nI and many others enjoy the books when the action wasn't heavy. Book 5 was action light- they were mostly ignoring Voldemort and focusing on Hogwarts dramas, and so that was my favorite. But book 3 was nothing exception in its lack of combat in the main book. \n\nBook 2 was actually slower for me. The basilisk petrified random people but Harry was never in any real danger from it, being a main character. He didn't fight it.",
            "author": "Nepene",
            "created_utc": 1377109148.0,
            "replies": []
        },
        {
            "name": "t1_cbsfdsh",
            "parent_id": "t3_1ktfg5",
            "body": "1.  The worst thing that Voldemort could do to harry is kill him.  A dementor can eat his soul.  So not only is he a mindless automaton until his body gives out, but he can't come back as a ghost, and he can't \"go on\" and be with his parents.  Dementors are one of the scariest enemies, not just in HP, but in all of fiction.  *Machin Shin* from the Wheel of Time is about the only thing scarier.\n\n2.  Prisoner of Azkaban sets up Sirius's storyline, and finally gives Harry a family - not that Mr. and Mrs. Weasley weren't fantastic surrogate parents, but in the books, a godfather/godkid relationship is portrayed to be 99% as important as that between biological parents and their kids.\n\n3.  Buckbeak is a badass.\n\n4.  Excellent quidditch action.",
            "author": "[deleted]",
            "created_utc": 1377109176.0,
            "replies": []
        },
        {
            "name": "t1_cbsfthm",
            "parent_id": "t3_1ktfg5",
            "body": "&gt; In my opinion, the best books in the series are the ones in which Harry's life is in direct danger from Voldemort or his forces, most obviously in The Chamber of Secrets, The Goblet of Fire, and The Deathly Hallows. At the time I read it, and ever since, I found the third book to be absent of danger or risk\n\nHis life is more in danger in Prisoner of Azkaban then he is in the Half Blood Prince. In that book the only dangers he has is a little duel with Draco. The horcrux gathering he is protected by Dumbledore and the death eaters are more concerned with escaping then attacking Harry.\nIn Prisoner of Azkaban he has to overcome his weakness to dementors which first includes a 50 foot fall and eventually as to save himself and others from being kissed.\n\n&gt; Harry spends most of the book in fear of Sirius Black, who ends up being a misunderstood ally.\n\nWhy is this any different to the other plot twists in the other books. For example it being Quirrell not Snape going after the stone and it being Ginny who opened the chamber of secrets.\n\n&gt; Voldemort pretty much does nothing to hurt Harry (they hardly talk about him IIRC\n\nWhy would they talk about him? At that point in time he had not regained a body and with his shot with Quirrell failing he was further away then ever with no allies. Harry had every right to be more concerned with what everyone considered to be an actual threat in Sirius who everyone believed to have escaped Azkaban just to harm Harry.\n\n&gt; leaving 400 pages to introducing characters\n\nWhat's wrong with this after the first book there was little amount introduced in the 2nd book so they were desperately in need of new characters and to help set up the future books and with Pettigrew's escape they set up the rest of the series.\n\nThis is just addressing the problems you mentioned. I think it's just personal opinion on where each book should be rated. For me Prisoner of Azkaban was the first book in the series I read and I rate it highly\n\n\n",
            "author": "SpaceAustralian",
            "created_utc": 1377110181.0,
            "replies": []
        },
        {
            "name": "t1_cbsfzmb",
            "parent_id": "t3_1ktfg5",
            "body": "The third book is absent of danger? What about the Dementors that Harry regularly encounters, nearly dying most of the time? While Sirius Black ends up being an ally, for the first part of the book, there definitely was a very real fear of the idea of Sirius Black. \n\nPoA has a lot of the same elements (such as how developed the world is and the humour, etc.) as the first two books, but is a lot darker in a sense. It builds up an inevitably direct clash between good and evil. You mention that the best books are ones like the Chamber of Secrets, but Voldemort didn't even really come into play until the end; the characters were more worried about the Basilisk (though they didn't know it was, in fact, a Basilisk). In PoA, there is supposed to be someone directly out to get Harry, which doesn't go for the first two. In my opinion, that's more of a danger.\n\nRegarding angst: books like The Goblet of Fire and The Order of the Phoenix are way, way more angsty. In fact, off the top of my head, all that I can really think about that qualifies as angst in PoA is when Harry contemplates going after Sirius Black (which isn't even necessarily teenage angst, seeing as it could happen to anyone), and Ron and Hermione's issues with each other. As a matter of fact, I think that one of the better parts of PoA is that develops characters in a much better way than the first two books, while not laying it on too much. The characters grow way more in this book than the first two, and there are way more moral issues and such.\n\nAnd yet, even though there's character development and such, one thing I really like about PoA is that it still retains similar flavour and charm from the first two books. However, it's the only year where disasters and other things don't ruin the year for the students, even though dark events are still unfolding. Things like the Boggart lesson and the Quidditch final are enjoyable because nothing like that really happens in other books. In the first book, everything was new and shiny; in the second, there were people being attacked; in the fourth book, there was the Triwizard Tournament; in the fifth, there was Umbridge; in the sixth, the anti-Voldemort movement was started, and the the last book was barely at Hogwarts. PoA mixes the danger of the second with the world-building of the first in a good way. \n\nIt's also a really good transition and set-up for the Voldemort-filled part of the series, and the ending isn't a perfect Hollywood ending like the first two. There are doubts and the real servant of Voldemort is on the loose at the end. It's less sweet. It's nice to have Harry save the day, win a million points for Gryffindor with his antics, and have his friends all cheer for him, but it's far more interesting to have an ending that leaves you with questions and doubts for the next book. Voldemort doesn't hurt Harry at the end, but his servant is off to resurrect him. \n\nAlso, I don't know why you're merely dismissing the backstory and time travel aspects. The backstory was really interesting. The time travel was plain cool. It was icing on the cake, but at least it can help in avoiding last place. \n\nFinally, the third book is, in my opinion, one of the best to re-read. For more intense books like the last one, a lot of the intensity/drama/action/suspense is lost when you re-read it. The PoA is a good mix of mystery and other stuff, so it's better for re-reading. \n\n**TL;DR, PoA has more danger, better character development and world-building, a better ending and re-read value, and lots of other cool factors, including time travel.**",
            "author": "IbrahimT13",
            "created_utc": 1377110573.0,
            "replies": []
        },
        {
            "name": "t1_cbsnpmc",
            "parent_id": "t3_1ktfg5",
            "body": "The third book is actually my favourite in the trilogy precisely because Voldemort wasn't a looming threat. \n\nHarry gets the Firebolt, which would serve him well, he gains two father figures, one of whose death in the later books is partly his fault causing him to steel his resolve.\n\nThe Hipogriff was absolutely magical. As was Hogsmeade. \n\nThe Marauder's map and its description were great, and a great addition to the books.\n\nThe Dementors were absolutely terrifying. And a real threat, and Lupin helped Harry through it.\n\nThe chapter \"Cat, Rat and Dog\" was an absolutely electrifying read. \n\nMoony, Wormtail, Padfoot and Prongs really added depth to the book - making Wormtail's betrayal tragic. \n\nSnape complicates the situation and makes it a major SNAFU and Voldemort is reborn again.  ",
            "author": "howbigis1gb",
            "created_utc": 1377130197.0,
            "replies": [
                {
                    "name": "t1_cbt1zp5",
                    "parent_id": "t1_cbsnpmc",
                    "body": "Reading all of these answers has reminded me of all the legitimately awesome stuff in this book, and I thank every one of you, but I'll respond to this one to bring up my one remaining caveat.\n\nIt seems that the reason PoA is great is because it fleshes out the HP world a lot more drastically than the first two did, and brings out a lot of side stories that make the HP world so interesting. One example I just remembered is the Ministry being a much more real presence, which brought a maturity to a world that was mostly run by a just-kids mentality for two books. However, even though the distractions from Voldemort were much-needed and never boring, it feels like PoA was artificially set up as such. The later books (i.e. the much longer ones) had what I feel is a better balance of non-Voldy plot development and main storyline events. But in PoA, it feels like Rowling decided to dedicate an entire book to just fleshing out the world. It was obviously successful, but I think it stands out as something like a very interesting intermission for the series instead of a legitimate entry in the saga of Harry Potter, the Boy who Lived.",
                    "author": "wearing2raincoats",
                    "created_utc": 1377186704.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cc1rn7e",
            "parent_id": "t3_1ktfg5",
            "body": "Roommate here! I just discussed this with you in person, but for those who happen to have a similar view, I'll be summarizing our discussion.\n\nYour last remaining unanswered argument was something to the effect of \"PoA seems to be an intermission from Voldemort, so while it was a nice book, it seemed rather irrelevant.\" To which I presented the following.\n\nIf you take the Harry Potter series as a whole (which, understandably you could not have done when this view developed when only four books were out), you essentially get three parts involving Voldemort, and if you were going to have a three act play, I would split it off into these three segments.\nI. The Revival of Voldemort\nII. The Rejuvenation of Voldemort\nIII. The Revenge of Voldemort\nFor most of the first two segments, Harry is not in any direct danger from Voldemort. Moreso, the danger comes because Harry tries to stop Voldemort's plans. Furthermore, because the concept of the Horcruxes hasn't been introduced yet, at the end of Chamber of Secrets, we have little to no reason to believe that Voldemort himself is even a threat anymore if he exists, so it is perfectly reasonable for Prisoner of Azakaban to ignore him except for a few passing mentions.\n\nFurthermore, let's examine the plot triangle. Introduction, rising action, climax, falling action, and conclusion. While there is room for debate about where exactly each thing is (specifically pertaining to the climax, which probably ranges somewhere from Voldemort's revival to Dumbledore's death), I would place things along this time-table.\n\nIntroduction- Sorcerer's Stone through the entrance into the Whomping Willow in Prisoner of Azakaban (roughly 2 and 3/4 books)\n\nRising Action- The discovery of Peter Pettigrew + his ensuing escape through the entry into the Ministry of Magic in Order of the Pheonix (roughly 2 books)\n\nClimax- Sirius' death (really the entire fight, but I happen to like choosing this point in particular. I would also choose to end segment II here. It is where Voldemort's forces appear to triumph over the forces of good in an even battle, rather than just managing to obtain objectives (such as Pettigrew escaping, or tricking Harry into getting his blood for the revival of Voldemort). The falling action would then be segment III almost in its entirety and the fight against Voldemort in whatever form it happens to take) (between a page and a few chapters depending on how much you want to include)\n\nFalling Action- mentioned above, but specifically Half-Blood Prince through Voldemort's death in Deathly Hallows (roughly 2 books)\n\nConclusion-Really anything after Voldemort's death falls into this, so just a few chapters. (50 pages tops)\n\nThis architecture makes sense graphically, for the most part. How is it relevant? Because your qualms with PoA are of a necessity because it is the start of the rising action. Will this make you like it more? No. But it does mean that it is not objectively the worst book because it does the job it needs to do, and it does it very well.\n\ntl;dr- PoA cannot objectively be the worst book because it takes the job it needs to do within the Harry Potter series, and does it extremely well. Whether it is interesting or not is both subjective and irrelevant.",
            "author": "Yuxrier",
            "created_utc": 1378327025.0,
            "replies": []
        }
    ]
}