{
    "name": "t3_1i1ad3",
    "title": "I believe Gul Dukat is responsible for losing the war CMV.",
    "body": "Seriously, this guy is the worst general ever.  \n\n* First, he takes a break in the middle of battle for no reason, giving Sisko time to give his \"I shall return\" speech and escape.\n\n* Then he spends three months running a space station instead of his empire, and he can't even do that right!  Maybe if he spent less time self-aggrandising and flirting with Major Kira…\n\n* Takes forever and a day to get the minefield cleared, which is preventing reinforcements from arriving.\n\n* Doesn't notice a resistance cell involving his own daughter and all the other obvious players.\n\n* At the same time, he's managed to lose a battle where he had a 2:1 advantage in ships.  What the hell? \n* I’m sure there’s other stuff too.  This guy never misses an opportunity to screw up.  \n",
    "author": "Stormflux",
    "num_comments": 16,
    "created_utc": 1373491359.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1i1ad3/i_believe_gul_dukat_is_responsible_for_losing_the/",
    "comments": [
        {
            "name": "t1_cb00f3y",
            "parent_id": "t3_1i1ad3",
            "body": "Gul Dukat made a lot of mistakes, but those wormhole aliens screwed him over big time.  His whole plan counted on those reinforcements, and how was he supposed guess that the prophets would help Sisko?\n\n",
            "author": "Green_soup",
            "created_utc": 1373494785.0,
            "replies": [
                {
                    "name": "t1_cb02fqy",
                    "parent_id": "t1_cb00f3y",
                    "body": "Also... it's that damn tailor that was always messing with his plans. \n\nTailor + Prophets + Federation = doom",
                    "author": "lonelyfriend",
                    "created_utc": 1373500502.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cb00maq",
            "parent_id": "t3_1i1ad3",
            "body": "It's tough keeping up with the Cardassians.",
            "author": "[deleted]",
            "created_utc": 1373495330.0,
            "replies": []
        },
        {
            "name": "t1_cb03fvb",
            "parent_id": "t3_1i1ad3",
            "body": "I have no idea what anyone is talking about",
            "author": "Tosevite",
            "created_utc": 1373503504.0,
            "replies": [
                {
                    "name": "t1_cb04b9s",
                    "parent_id": "t1_cb03fvb",
                    "body": "Star Trek: Deep Space 9\n\nhttp://en.wikipedia.org/wiki/Dukat_%28Star_Trek%29\n\nhttp://en.memory-alpha.org/wiki/Dukat",
                    "author": "Amablue",
                    "created_utc": 1373506068.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cb078iv",
            "parent_id": "t3_1i1ad3",
            "body": "While Dukat was incompetent, he was not the only reason for the Dominion loss.\n\nFirst your points\n\n* He gave Sisko an escape\n\nNot really.  Sisko did have time for a speech, but there was no implication that Dukat stopped his attack.  This seems to be an instance of the dramatization forcing a loop hole.  But if you assume that he halted his attack, you can assume that he did so because he wanted Sisko and the Federation to understand how just and righteous he is.  And one captain, no matter how important does not make you lose a war.\n\n* He couldn't even run a space station!\n\nHe wasn't running Terok Nor, he was running the invasion, the Cardassian empire, and Terok Nor.  Not only that, he had to run the station with known dissidents holding high positions.  Kira and Odo both were known opponents of the Dominion and any Cardassian expansion, but due to the non-aggression pact made by Bajor and the Dominion, Dukat's hands were tied.  \n\nHe did have a pathological need for his foes to not only understand but agree and like him, but Terok Nor ran smoothly while he was in charge.  There were next to no incidences of violence, no open revolts, and Kira and Odo even remarked on how well the occupation was going.\n\n* The Minefield lasted too long\n\nThe minefield designed to be unable to disarm?  The one that the federation put forth all it's efforts into making sure that it would last? The minefield with self replicating, cloaked, swarming mines who were conceived of for the sole purpose of thwarting all attempts to disarm?  That minefield?\n\nIt is easy to forget that the Federation has the best engineers, even the Jem'hadar remark that Federation engineers are legendary and can build transporters out of stones (or something close to that).  The fact that the Dominion had a plan to remove the minefield was amazing to say the least.\n\n* He was blind to his daughter's involvement with the resistance\n\nHe knew there was a resistance cell, hence the \"holding for questioning\" during the assault.  He couldn't detain or even hassle Major Kira, due to the treaty with Bajor.  He couldn't even hope to curb any powers Odo requested, due to Weyoun.  Jake Sisko was untouchable due to his status as the Emissary's son.  Nog was the only one he could touch, and he had an execution scheduled for him!\n\nHe did not have his daughter arrested, held or her movements curtailed, because he did not believe that she could betray him.  Remember that Cardassians value family over all else, and he obsessively sought to build a better relationship between his daughter and himself.\n\n* He couldn't hold the blockade\n\nHe did though.  He wasn't able to stop every ship, just all but one of them.  Once there was a slight opening Sisko sent the entire fleet in, only the Defiant made it through.  That is a huge Dominion victory.  He could have sent more ships back to help defend the station, but he was correct in stating that the station's defense's were enough to stop the Defiant, and reinforcements were coming.  He had no way of knowing that the wormhole aliens would Deus Ex Machina the Jem'Hadar away.  Nor did he know that he would be sabotaged at the perfect moment.\n\nWhich brings me to what caused the Dominion to lose the war\n\n* The wormhole aliens \n\nThey stopped Dominion troops from entering at the point when they were needed most, and held an obvious bias towards Bajor.\n\n* The political climate\n\nThe Federation had interests in Cardassia and Bajor before the wormhole was discovered.  A war would have been fought in defense of Bajor even if Deep Space Nine was in a strategically poor position.  When the wormhole was discovered the Federation began to reinforce the region, when the Dominion became a threat the Federation began to work on plans to halt them, when the Dominion allied with Cardassia the Federation put war plans into action.  Attempts to pit the Klingon Empire and Federation were hindered by Federation and Klingon knowledge of changelings.  \n\nFrankly the Dominion underestimated the Federation.\n\n* I am a huge nerd\n\nThe Jem'Hadar and the entire Dominion war engine is built around discipline and order.  The Federation is based around innovation.  This means that in large scale military engagements the Jem'Hadar win every time, but when you have small skirmishes around unique anomalies, the Federation will win everytime.  If you look the track records of any Federation ship, clearly space is full of weird stuff, and how can the Jem'Hadar fight against extra tiny ships or people who age backwards, or holograms who take control of ships?\n",
            "author": "bartleby42c",
            "created_utc": 1373514379.0,
            "replies": [
                {
                    "name": "t1_cb08ugs",
                    "parent_id": "t1_cb078iv",
                    "body": "∆ Wow.  Ok, you win the thread.  Deus ex machina aliens, Weyoun's political meddling, spacial anomolies, magic shrink rays, and an amazing set of coincidences that had to happen in just the right order.\n\nIt's like the universe just didn't *want* him to win.  Poor Dukat.",
                    "author": "Stormflux",
                    "created_utc": 1373519157.0,
                    "replies": [
                        {
                            "name": "t1_cb0aoru",
                            "parent_id": "t1_cb08ugs",
                            "body": "Hey Dukat did eventually get his own Deus ex machina aliens on his side and managed to shut the wormhole down. Had he won the final conflict, they would of controlled the wormhole and Dukat would of reopened the wormhole. \n",
                            "author": "NeedsToShutUp",
                            "created_utc": 1373526037.0,
                            "replies": [
                                {
                                    "name": "t1_cb0gwh3",
                                    "parent_id": "t1_cb0aoru",
                                    "body": "Too bad the \"final conflict\" came down to a fistfight.",
                                    "author": "[deleted]",
                                    "created_utc": 1373555904.0,
                                    "replies": [
                                        {
                                            "name": "t1_cb0gzw9",
                                            "parent_id": "t1_cb0gwh3",
                                            "body": "But in fire caves!",
                                            "author": "NeedsToShutUp",
                                            "created_utc": 1373556150.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cb0h4o1",
                                                    "parent_id": "t1_cb0gzw9",
                                                    "body": "And that bitch Kai Winn finally gets her just desserts.",
                                                    "author": "aDDnTN",
                                                    "created_utc": 1373556476.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_cb0cy0r",
                            "parent_id": "t1_cb08ugs",
                            "body": "Confirmed: 1 delta awarded to /u/bartleby42c",
                            "author": "DeltaBot",
                            "created_utc": 1373540814.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cb1ac4j",
                    "parent_id": "t1_cb078iv",
                    "body": "I think you missed the founders single minded focus on Odo.Through the link the one founder knew everything Odo did about the resistance cell, but solid matters were not a priority.\n\nIt was a vorta who said Federation engineers can turn rocks into replicators. It was Rom who was held in custody, not Nog; Nog was serving in Starfleet at the time.\n",
                    "author": "roastbeeftacohat",
                    "created_utc": 1373650130.0,
                    "replies": [
                        {
                            "name": "t1_cb1c1mr",
                            "parent_id": "t1_cb1ac4j",
                            "body": "Gah!  I mixed up Rom and Nog! I feel only shame.  I however am not deeply shamed that it was a Vorta instead of a Jem'Hardar.\n\nHowever, it is made clear that thoughts and ideas can be hidden in the link, just as the founders decieved Odo about Gawron being one of them, while hiding the information about others including Martok.  I think it is fair to say the founders presence on the station held no influence on the war effort. And if there was any influence it would have been preventing Dukat from destroying the station, which would point towards his non-guilt in the war effort once again.",
                            "author": "bartleby42c",
                            "created_utc": 1373654367.0,
                            "replies": [
                                {
                                    "name": "t1_cb1c37d",
                                    "parent_id": "t1_cb1c1mr",
                                    "body": "I seem to remember the founder saying something to the effect of \"I know and I don't care\" in regards to the resistance cell.\n\n",
                                    "author": "roastbeeftacohat",
                                    "created_utc": 1373654468.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cb1c3zk",
                    "parent_id": "t1_cb078iv",
                    "body": "I have to disagree at least in part - admission, I haven't watched seasons 5-7 in a few years.  Rewatching the series now, about 3 episodes into season 5.\n\nThat said - iirc, during multiple battles Dukat was either 1) chasing his daughter around the station, 2) mourning her death, or 3) trying to sex up Kira.  Like...his companion that led the Cardassian rebellion, that got drunk all the time.  When Dukat was needed as a strong leader and a decisive general, he was either distracted by or too busy with minor matters.  ",
                    "author": "Bozhe",
                    "created_utc": 1373654522.0,
                    "replies": []
                }
            ]
        }
    ]
}