{
    "name": "t3_1lvvsf",
    "title": "CMV Pensions, esp. Public Pensions are Inferior to 401K/IRAs",
    "body": "If you are an employee esp. a public employee it is rather stupid to base your retirement on a Pension. Pensions have inherient flaws in them that are rather likely to ensure that you won't recieve your pay.\n\n \nFirst they are not controlled by you the employee. This means that your retirement is wholly dependent on the sovency of some company or some government. If they go belly up or can't pay up your retirement goes right down the drain. Over the course of 60 years (assuming you start working at 20ish and die at about 80ish) the chances of you not recieving your money are quite high.\n\n\nSecond you have no control over how your money is placed. Say you dislike a certain thing on moral grounds or you support something or think it's a good investment. In all IRA and a good number of 401Ks you can direct your investments accordingly. In a pension system you cannot. So if some super profitable company that you want to be invested in comes along you have no opportunity to invest in it if your organization doesn't believe in it's merits or morals (this is especially a problem with public employees).\n\n\nThis one relates more to public employees. But there will always be pressure to promise benefits now that you don't have to pay until later. It sounds great, keeps your costs low and in the case of a politician can get you immediate votes at the expense of folks who aren't even born yet. The pressure to overextend is immense and often times (politicians especially) if the employer won't cave into bigger pensions demands they will be replaced with an employer who will.\n\n\nThe biggest argument I see against 401K/IRA vs. Pensions is that some people will invest incorrectly or not invest at all and they will retire destitute. But we've already got a program to keep retires food on the table (Social Security). And I've yet to hear of a retiree whose 401K was affected by their old employer's solvency while all the time I hear of pensioners who will have to take a \"haircut\" that always seems to get bigger and bigger.\n\n\nIn summary I believe that the promise of guarenteed, large, and regular, payouts that pensioners (esp. public pensioners) get isn't worth the risk they take. That they are participating in a system that is incentivised to screw them in the future. And that in the long run they will earn the most and have the most secure retirement with a 401K/IRA.\n\n\nTo change my view. Please either tear down my faith in 401Ks/IRAs and/or build up my faith in Pensions (esp. Public Pensions) to a point where it would make more sense to invest in a pension than a 401K. Show how pensions carry minimal counter-party risk and are an inherinently safe. Show that my fundamental understanding of Pensions, 401Ks and/or IRAs is wrong which would invalidate my argument.",
    "author": "chalbersma",
    "num_comments": 4,
    "created_utc": 1378510564.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1lvvsf/cmv_pensions_esp_public_pensions_are_inferior_to/",
    "comments": [
        {
            "name": "t1_cc3gvcj",
            "parent_id": "t3_1lvvsf",
            "body": "I really hate to see a good financial CMV go unanswered.\n\nThe unfortunate answer is that it depends on the pension. Whether a pension is a good deal or not depends on the following: Whether current shortfalls exist in pension funding using conservative estimations for rate of return, solvency of the company/government, and for public pensions, whether political will exists to cut pension benefits.\n\nThere are some pensions that are unquestionably better deals than an equivalent 401k or IRA. The best example is that given to the US military. Work for 20 years, get 1/2 of your base pay for the rest of your life. For a male officer who makes O-5, that's $4,100 every month for the rest of their life, an estimated 37 years - or $1.8 million in benefits that you start collecting at age 41. Some math shows that this is roughly equivalent to a 401k only if you donate ~$2,500 to the 401k every month for 20 years at a 5% APR. At this point, it's a question of reliability.\n\nIs the US government going to choose not to fund already promised military retirements. I really don't think there will ever be the political will to revoke these promises. It would take a financial catastrophe so bad that it's unclear what would happen to equivalent 401k's. Even if they don't fund the whole thing, funding only half is still an amazing deal.\n\n&gt; I've yet to hear of a retiree whose 401K was affected by their old employer's solvency \n\n[Enron](http://reason.com/archives/2001/12/27/enrons-401k-calamity). Many employees were forbidden from diversifying their 401k's. In an IRA you have unquestionable control over how you want your assets allocated, but in a 401k you're limited by the plans that your employer offers. In that past that has seriously burned people.\n\nLook, I'm not saying that all pensions are good and better than defined contribution plans, but rather that you have to sit down and seriously analyze the specific circumstances of the pension plan. You talk about the stability of a 401k/IRA over pensions, but market downturns can also make huge changes in a retiree's wealth and standard of living. If your portfolio goes down 10% because of the market, how is that any different than a 10% haircut in your pension?\n\nThere are some things that pensions do better than defined contribution plans too. They distribute risk over larger groups of people, so that it's less likely that any one person will end up destitute. They also remove the risk of outliving your retirement, where you live longer than you planned when pulling the principle out of your 401k/IRA. At least with a pension you don't have to worry about being penniless at age 95 because you never expected to live that long.",
            "author": "Aoreias",
            "created_utc": 1378541418.0,
            "replies": [
                {
                    "name": "t1_cc3q5pz",
                    "parent_id": "t1_cc3gvcj",
                    "body": "&amp;#8710;\n\nGood points. You provided an example of a public employee where it makes sense to take the pension. I hadn't thought such an example could be given. But at least for military members it makes sense to take the pension instead of the 401 K/IRA.\nDidn't know about the Enron bit. I may have to look closer at 401Ks.",
                    "author": "chalbersma",
                    "created_utc": 1378585579.0,
                    "replies": [
                        {
                            "name": "t1_cc3q5zw",
                            "parent_id": "t1_cc3q5pz",
                            "body": "Confirmed: 1 delta awarded to /u/Aoreias.\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][[Subreddit](http://www.reddit.com/r/DeltaBot/)]",
                            "author": "DeltaBot",
                            "created_utc": 1378585604.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cc3yvul",
                            "parent_id": "t1_cc3q5pz",
                            "body": "Yeah, just as an example.  In 2004 I had $2000 in my 401k.  Four years later, because of the crash, it was down to $430.  ",
                            "author": "Niea",
                            "created_utc": 1378614178.0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}