{
    "name": "t3_1dyxbt",
    "title": "I believe that if a person says that they have tried to commit suicide and failed then their heart wasn't really in it to begin with. CMV",
    "body": "In short, I guess what i'm really saying is that people that try to commit suicide and fail aren't actually trying to commit suicide but rather using that action as a plea for help and/or attention. I can't say this in public though because I get shot down and called insensitive. People I know don't seem to be objective when it comes to this topic.   \n\nEdit: I want to somewhat change my original opinion. What I mean is people who go around and proactively try to off themselves; not so much the people who in the spur of the moment snap. If someone legitimately attempts suicide under the assumption that they're 100% sure that they will die and then fails but then goes on to kill them-self at the next opportunity then yes; you have changed my view. I am seeing a lot of posts about how people tried to kill themselves but were stopped from doing so somehow but then go on to be very much non-dead for the rest of there lives. I'm not denying at all who ever it is that you cited truly tried to kill themselves anymore. You all have offered plenty of examples to the contrary. However, for the most part so far besides u/nastybastid's example, They all live. (so far) I'm a bit confused now my self as to what i was going to change my opinion to, to be perfectly honest. I had one but forgot it. Oh well. I know this is a subject people tend to take rather personally but I am surprised by the plethora of the same opinions. Well not surprised, just a little disappointed that the argument is one sided. That might be my fault for having a stupid position in the first place. Thanks for all the posts anyways.",
    "author": "cfaris",
    "num_comments": 23,
    "created_utc": 1368060236.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1dyxbt/i_believe_that_if_a_person_says_that_they_have/",
    "comments": [
        {
            "name": "t1_c9v6azm",
            "parent_id": "t3_1dyxbt",
            "body": "OP, one of my friends made deep cuts in her wrists while she was in the bathroom. She sat on the floor and waited to bleed out. While it was happening, her roommate walked in and saw her while she was fading in and out of consciousness, and then proceeded to call an ambulance. If that hadn't happened, she wouldn't be alive. ",
            "author": "stevejavson",
            "created_utc": 1368060435.0,
            "replies": [
                {
                    "name": "t1_c9v6mi7",
                    "parent_id": "t1_c9v6azm",
                    "body": "I don't mean to be insensitive, as stated above, but doesn't that sort of prove my point? I don't know any events that led to that situation but maybe she thought that was a way to get help, and I presume she did because she went to the hospital. Have you asked her the reasoning behind it? IMO, people who do things like that need some physiological help but they just go about getting it the wrong way. I can see the reasoning behind the desire to not walk into a hospital and declare that you feel suicidal do to a lot social stigmas that don't easily go away such as the \"that girl was deemed bat-shit crazy by a doctor last year; be careful you don't upset her.\" gossip. I think they just see \"attempted suicide\" it as a penultimate resort. ",
                    "author": "cfaris",
                    "created_utc": 1368061305.0,
                    "replies": [
                        {
                            "name": "t1_c9v6uyk",
                            "parent_id": "t1_c9v6mi7",
                            "body": "No OP, the point was that she would be dead if her roommate hadn't walked in by chance. She wasn't crying for help, she was trying to die. After the incident, she immediately moved out and cut off all contact with that roommate. Of course, once in a while, attempted suicide is a call for help. However, no one is in a position to make that call, and there is no practical benefit to doing so either. Suicide attempts need to be taken seriously and although you may be correct that some attempts may be a way of crying for help, we don't have any kind of measurement tools to precisely determine when that is the case. ",
                            "author": "stevejavson",
                            "created_utc": 1368061937.0,
                            "replies": [
                                {
                                    "name": "t1_c9v8fs2",
                                    "parent_id": "t1_c9v6uyk",
                                    "body": "I don't believe I ever said that threats of suicide shouldn't be taken seriously. I agree with the opposite. Even if it is a call for help, any normal person would feel an obligation to take action. I had a friend in high school who, before I met him, \"attempted\" commit suicide by over dosing. In the back of my mind I always wondered why he chose such an unreliable method. Of course I never said that to him out of common  decency but I was illegitimately curious for the reasons behind it. I feel like a struck a bit of a nerve with some people here but that was a natural side affect of curiosity.",
                                    "author": "cfaris",
                                    "created_utc": 1368066044.0,
                                    "replies": [
                                        {
                                            "name": "t1_c9vlru6",
                                            "parent_id": "t1_c9v8fs2",
                                            "body": "&gt; I had a friend in high school who, before I met him, \"attempted\" commit suicide by over dosing. \n\nI'm glad you said this, because it is actually an extremely common reason for your belief. \n\nThere's lots of reasons someone would pick this method, and a lot of reasons why the fail at it.\n\n1 - access. \n\nNot everybody has access to a gun, car, etc. \n\n2 - How you will look.\n\nSuicides are extremely tragic to family members, and people who commit suicide are aware of this. They generally hate themselves already for being such a burden, and don't want mom to walk into the bedroom with brains splattered all over the walls. Pills are among the cleanest suicide methods. \n\n3 - knowledge\n\nOverdosing on pills is HARD to do well. You don't need a controlled substance - lots of over the counter meds will do it. \n\nYou had this friend in high school who tried it previously, that means he was probably 16 at most when it happened. He likely had no idea what he was taking, or how much would be required to kill him.\n\n4 - pain\n\nJust because I'm dying doesn't mean I'm not going to feel it.\n\nAlso, dying from a pill OD takes a long time. You could easily pass out hours before you die, thus dramatically increasing the chances you are discovered. \n\n[Pill OD is actually the most common form of suicide among doctors (the profession with the most suicide), who, not surprisingly, have resounding success.](http://www.psychologytoday.com/blog/the-narcissus-in-all-us/200908/the-occupation-the-highest-suicide-rate)",
                                            "author": "frotc914",
                                            "created_utc": 1368122252.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_c9viffw",
                                    "parent_id": "t1_c9v6uyk",
                                    "body": "[deleted]",
                                    "author": "[deleted]",
                                    "created_utc": 1368112633.0,
                                    "replies": [
                                        {
                                            "name": "t1_c9vihnq",
                                            "parent_id": "t1_c9viffw",
                                            "body": "I'm not sure what the exact details were, but she did cut them incredibly deep. I think that she could have gotten away with a lot less if that was actually her intention. I talked to her a few weeks after her rehabilitation. She basically said that she regretted it, but she truly meant to die that day. ",
                                            "author": "stevejavson",
                                            "created_utc": 1368112816.0,
                                            "replies": [
                                                {
                                                    "name": "t1_c9vinn1",
                                                    "parent_id": "t1_c9vihnq",
                                                    "body": "[deleted]",
                                                    "author": "[deleted]",
                                                    "created_utc": 1368113318.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_c9vj17l",
                                                            "parent_id": "t1_c9vinn1",
                                                            "body": "I think that the main difference between our examples was that her attempt was a very spontaneous response to a very emotional event, rather than the result of a long contemplation while in a depressed state. Of course, you're right that there is no way to know with 100% certainty, but I have little doubt about her intent, just because she didn't ask for help or anything beforehand. ",
                                                            "author": "stevejavson",
                                                            "created_utc": 1368114422.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_c9v6qso",
            "parent_id": "t3_1dyxbt",
            "body": "OP, I once met a man who survived jumping off the Golden Gate bridge.  Do you believe that he lived because of a lack of enthusiasm?",
            "author": "[deleted]",
            "created_utc": 1368061629.0,
            "replies": [
                {
                    "name": "t1_c9v7356",
                    "parent_id": "t1_c9v6qso",
                    "body": "∆\nWell...I'll admit you have a point there. However, if you met him, he obviously did not go on and succeed in completing his original goal. One would assume that he found a reason in life not to stick a gun to his temple. Having not personally met the man personally, maybe that very near death experience was a sort of wake up call or extremely fast acting therapy. Maybe he jumped got halfway to the water and was like \"Oh shit, I suddenly appreciate being alive a lot more.\" I guess you win in a way because he technically tried (at least, at first) what he thought was a sure fire way to do the job and failed. Delta for technicality.       ",
                    "author": "cfaris",
                    "created_utc": 1368062512.0,
                    "replies": [
                        {
                            "name": "t1_c9v7sym",
                            "parent_id": "t1_c9v7356",
                            "body": "Confirmed - 1 delta awarded to /u/mehals",
                            "author": "DeltaBot",
                            "created_utc": 1368064373.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_c9v6x69",
            "parent_id": "t3_1dyxbt",
            "body": "I knew a man who was a student nurse, back in the day when student nurses lived in housing beside the hospital. He was relentlessly bullied for studying to be a nurse due to his gender, even by staff who were mentoring in the hospital. \n\nOne day he waited until all the other students he lived with had left to start their shift in the hospital and he went down to an old storage room in the basement that was pretty much unused. He took an overdose of some sort and was pretty much going to die only a caretaker came into the room and found him, raised the alarm and saved the mans life. The chances of the caretaker finding him were extremely low as usually there's no reason for anyone to go into that room. The student obviously couldn't have been banking on anyone to find him. \n\nSince then he has successfully committed suicide though.",
            "author": "nastybastid",
            "created_utc": 1368062095.0,
            "replies": [
                {
                    "name": "t1_c9v7q05",
                    "parent_id": "t1_c9v6x69",
                    "body": "∆\n\"Since then he has successfully committed suicide though.\"\nThis breaks the commonality that seems to be dominating the thread. Most of the comments so far have relatively happy endings (the person does not end up killing them self after the first attempt.) and this is the only one where the person completes his/her original goal. I'll make an edit up top to revise my original deceleration. ",
                    "author": "cfaris",
                    "created_utc": 1368064155.0,
                    "replies": [
                        {
                            "name": "t1_c9v7uuu",
                            "parent_id": "t1_c9v7q05",
                            "body": "Awesome, my first delta :) thanks!",
                            "author": "nastybastid",
                            "created_utc": 1368064509.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_c9v6ypq",
            "parent_id": "t3_1dyxbt",
            "body": "I read a post on reddit best of once, that attempts were in a sense shopping for a death, that the person doing it was shopping for the means that best suit them. \n\nA percentage go on to actually kill themselves, though that number is fortunately low, but that could be because they actually receive the help, support or medication they required between the first and second attempt. \n\nMen seem more successful than women in accomplishing the task. Men over 80 and those with schizophrenia are in groups with higher incidence of suicide. I am not sure but do you really think men over 80 or schizophrenics are in it for attention and drama? \n\nThere may be those that attempt to gain attention or alter behaviour of those around them with suicide attempts or threats, but I do not feel it is at all reasonable to say that all people who try and fail were doing it for attention. \n\nFurther it seems that dismissing someone in that way would hinder the chance that the person who attempted suicide in fail receive the social support, medical treatment etc that they might need. It seems to me to be misguided and potentially harmful to assume that anyhow.\n\nAll stats taken from this source:\n\nhttp://www.ctvnews.ca/factsheet-who-is-most-at-risk-for-suicide-in-canada-1.706169\n",
            "author": "[deleted]",
            "created_utc": 1368062204.0,
            "replies": [
                {
                    "name": "t1_c9v8qa6",
                    "parent_id": "t1_c9v6ypq",
                    "body": "I am really interested in the mentality behind that. Do the people think that some ways to kill themselves are intrinsically better than others? Obviously some are quicker and painless but shopping for a death, to me at least, suggests a sense of self loathing. But being choosy over the way i die could suggest pride-fullness. I'd be interested in seeing that bestof thread.",
                    "author": "cfaris",
                    "created_utc": 1368066791.0,
                    "replies": [
                        {
                            "name": "t1_c9vadcg",
                            "parent_id": "t1_c9v8qa6",
                            "body": "Well I cannot really say but perhaps considerations like how fast and pain free would be important? I don't really know to be honest. Just my view, but it must be a pretty sad heart contemplating that with any seriousness.\n\nEdited to add: searched for the post but I could not find it :(",
                            "author": "[deleted]",
                            "created_utc": 1368071553.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_c9v7127",
            "parent_id": "t3_1dyxbt",
            "body": "Someone who went to my school lost their short term memory because they shot themselves in the heads correctly. I'm pretty sure that wasn't a plea for help or attention simply because he survived.\n\nThere was one episode on Glee where an ex-bully tries to hang himself in his closet. He dad found him and cut him down before anything happened. He didn't even try to hang himself in his doorway. He tried to hang himself in the closet. I'm pretty sure the character was really trying to die.\n\nThere are a lot of people who are afraid of pain but still want to die, so they take the route of trying to poison themselves. I doubt all of them believe they're going to survive downing an entire bottle of sleeping pills and a bottle of Grey Goose.\n\nThere are people who survive downing sleeping pills in a full bathtub or stabbing themselves in an artery because their family or friends find them before they die. I don't think any of them expected to survive. They just happened to.",
            "author": "elemonated",
            "created_utc": 1368062367.0,
            "replies": []
        },
        {
            "name": "t1_c9v71ti",
            "parent_id": "t3_1dyxbt",
            "body": "Your heart doesn't have to be in on it.  Hell, even your brain doesn't have to be in on it.\n\nThe most fundamental function of your body is to keep you alive.  That's it.  When the going gets tough, there's one thing above all others that takes precedent: survive.  That's why you hear stories of people lifting boulders or cars off themselves, that's why \"life or death\" situations are when you are at the height of your physical capabilities.  Every last ounce of your being is put towards survival, and if you don't make it... then that's a problem.\n\nBut this isn't a conscious thought process.  There's no debate.  If you see something falling on top of you or you see a bear chasing after you than you RUN.  This is just instinct.\n\nPeople who fail at suicide could convince themselves 100% that they are going to do it.  People have been caught in the act, gun to the head, stopped, and have regretted even thinking about suicide.  I personally know a kid who jumped off a building, broke some bones but didn't die, and when he could finally talk again said that the moment he jumped, he had every intention to commit suicide, and by the time he was halfway to the ground, he regretted it.\n\nYou see, even if you tell yourself you want to commit suicide.  Even if you tell yourself you want to die SO BAD, there's something in your subconscious that keeps you from doing it.  Why do you think there are no slow methods of suicide?  You never see people starving themselves on purpose, or dehydrating.  It's essentially impossible to do so with food/water available.\n\nWhen a person comes to the decision that they want to die, that's their own business.  But almost all the methods are quick.  A jump off a building, a shot of a gun, a lethal overdose.  You could be 100% invested in doing it.  You could put the gun to your head, deluding yourself to believe that suicide is the only option, and still put the gun down.  \n\nPeople who pull the trigger are no different.  They come in with an 100% disposition to do the act, and they do.  They sit there, gun to the head, usually followed by some sort of contemplation, maybe a few tears.  And something just clicks, for a moment they lose sense of exactly what is going to happen and that lapse causes the trigger to be pulled.  That subconscious screaming has been silenced by something else, something powerful. \n\nThe difference between someone who succeeds and someone who fails is that lapse.  Going into it, both people can be 100% ready to commit suicide.  But from personal experience, when you know somebody who has tried, and has actually jumped, looking into their eyes as they tell they were serious.  They legitimately wanted to die.  But they didn't.  Obviously a plea for help, right?\n\n",
            "author": "Joined_Today",
            "created_utc": 1368062422.0,
            "replies": []
        },
        {
            "name": "t1_c9v73st",
            "parent_id": "t3_1dyxbt",
            "body": "It's like when you reach up for mommy to carry you. It isn't so much you're crying for help, you're just not wanting to do the hard work anymore and send a signal for someone else to carry you.\n\nThey do it with words first. But then people get tired of their shit. They just weigh down on others endlessly, and people don't really care, because they have their own issues to deal with, and they know nothing can fix all these endless pains the person has, so it just makes people feel bad, and they want away from it.\n\nWhich only further isolates the baby, making them feel unloved and adding to the pain, so they sit there and cry, unable to get up theirself and do the hard work, but with nobody to care for them. They cry and cry, and if nobody hears them, then they go to a place like /r/SuicideWatch where there's a bunch of fools who make it a hobby to pretend to care for babies, because that makes them feel better about their own life since it gives illusions of doing something important like saving someone's life.\n\nThen it becomes a game, an act that's part of the norm. Everyone plays their part. The baby cries, the pseudo-mom picks them up and comforts them, the baby says *thank you!* squeezing them, and the other person then feels big, like a big important strong person, who gets to walk around thinking, \"Yeah, I save people's lives, I'm basically superman.\"\n\nBut it's fake. That's not their real mom, and they don't truly care. They might talk for a while, and something resembling a friendship form, but they can't do that with everyone. Which brings us to the truth about suicide.\n\nPeople die because they're not needed. When nobody cares about you, when people exclude and push you away, it's for a reason. When your life is truly broken, and that miserable, you will die soon.\n\nSo it isn't so much that they're just begging for help and attention. It's that they're a failure of a person, who can't function as an autonomous person who carries their own weight. They want vacation, to not have to walk anymore with this heavy backpack on, and have mommy pick them up to do all the lifting.\n\nThey cry for a long time, in many ways, because they're stuck in this kind of dysfunction. Part of being such a failure, is not even knowing how to do the hard work to actually end your life or understand how that all works. They're in baby mode, so they can't even be bothered to research it or plan, they just see a bottle of pills and act as a cry.\n\nBut see this difference is so subtle, it isn't a cry like how you phrased it, where they're strong like you and requesting help and attention, using this as blackmail. There's some of that, but it's also just a cry like a baby, where they're simply unable to do anything different. They're trapped in this like the helpless baby is.\n\nIt acts as a louder cry than with words though, and then usually someone picks them up. This is like if you were on a hike with your children, and one kept complaining the whole way about how his legs hurt, I don't want to go anymore, daddddd, I can't walk anymore, pick me up, dad, carry me I can't walk anymore, my legs are sore, are we almost there yet? How much further, I can't walk anymore steps. It goes on and on, and you see they're still walking, so it feels fake. But to them, they seriously feel this way, and are incapable of doing anything other than whining, because they're so self-absorbed in their own pain without knowing that everyone's legs hurt, and part of being alive is struggling through the ache, because you have to. They're soft and expect people to carry them when there's the slightest discomfort, so they moan about it.\n\nWhen nothing changes, and it actually does start to get sorer where it's hard to walk, then again because they're in that sensitive \"I shouldn't have to do what's hard\" kind of mode they will take it too far. They want it to stop, and you're not carrying them, insisting that they can walk. So what do you do? \"Oh yeah? I can walk? No I can't!\" and you collapse.\n\nCollapsing is dangerous? You collapse and fall into a pond when you can't swim? You lose your balance and start to collapse towards a cliff where you'll fall off and die? That just makes it more clear to dad that you can't walk, and then he'll carry you. When someone is in this mindset, they're not really even thinking about death, they're not thinking much at all beyond this immediate sensitive discomfort and inability to cope. They collapse into the dangerous position not for death, but to not have to walk.\n\nUsually a parent then catches them, and then carries them. If they didn't catch them, usually whatever bad thing that happens is just more pain to make it that much more serious to the parent, who then gives that much more sympathy and they get to relax in that comfort of being taken care of and then carried home. That's what they want, not death.\n\nBut you're thinking of it as that making it invalid. Because it doesn't mean what it's advertised as, it doesn't count in the same way. But how pathetic, for someone to be collapsing off a cliff into a pond when it'll injure or kill them, just to be reminded that someone cares, and to have a temporary relief of having mom pick you up and make it easier.\n\nSomeone that dumb deserves pity. \n\nSomeone who is a hard worker, who carries their weight and the weight of others, does it differently. They hike as far as they can, through bee stings, dehydration, and muscle fatigue. Until they can't make it any further, and they pass out, only to wake up and slowly crawl another mile, passing out along the way, excruciating pain, still crawling, until it's impossible. But they have a little further to go, because they're not crawling for them, they're trying to reach a place where they can roll off and have their body disappear, where the others won't have to discover it on their way, and suffer the trauma of seeing their rotting corpse. That's how a real man does it. That's when it's truly about death.\n\nThis other stuff isn't about death, but it isn't exactly a plea for help and attention either, since it's coming from a different place, where they're too pathetic for it to even be that. It's just a complete helplessness and inability to manage anything on their own, so they reach up for someone to carry. If no one is there, they fall off the bed and mom hears the thunk and comes running. But like the baby, they're not even fully aware they're doing that, they're just following their self-absorbed pathetic emotional urges. A very subtle difference, but important, because the way you seemed to view it gives them too much credit. ",
            "author": "bellytacos",
            "created_utc": 1368062559.0,
            "replies": [
                {
                    "name": "t1_c9vq8ab",
                    "parent_id": "t1_c9v73st",
                    "body": "This sounds like someone who is both suffering from depression and has no idea what depression is.\n\nIt sounds like someone who doesn't understand that strength comes in different forms and the unwillingness to live is not wholly weakness.\n\nIt sounds like someone who doesn't understand the difference between weakness and vulnerability.\n\nThis? This one sounds like a plea for help, just as much as a scar on the wrist.",
                    "author": "elemonated",
                    "created_utc": 1368134380.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_c9v7scw",
            "parent_id": "t3_1dyxbt",
            "body": "My friend got cut down from a tree because a passerby happened to find him after he passed out (he was trying to hang himself). Other people have survived attempts including, but not limited to, self-immolation, asphyxiation by car exhaust, taking pills, shooting themselves, etc, etc. Are they all lacking enthusiasm?",
            "author": "piyochama",
            "created_utc": 1368064327.0,
            "replies": []
        },
        {
            "name": "t1_c9vn7p4",
            "parent_id": "t3_1dyxbt",
            "body": "I attempted to kill myself, once. I failed.\n\nI have only told a few of my closest friends, and random people on the Internet who can't ID me.\n\nIncompetence is not insincerity. Were it not for a timely couple of talks from some amazing people, I would have gone ahead with my Mark II plan, which was substantially more lethal, and I would not be here.",
            "author": "nermid",
            "created_utc": 1368126264.0,
            "replies": []
        },
        {
            "name": "t1_c9vo0sl",
            "parent_id": "t3_1dyxbt",
            "body": "I have had patients who put a gun to their head, pulled the trigger, and survived. To the best of their knowledge, they were doing their absolute best to off themselves. But, do to the neuroanatomy of the brain, there are many angles where a through-and-through shot won't kill you (it will severely impair you, however).\n",
            "author": "ralten",
            "created_utc": 1368128480.0,
            "replies": []
        }
    ]
}