{
    "name": "t3_1h8unp",
    "title": "I believe having the \"over\" orientation of toilet paper is the only correct way to have the roll placed. CMV.",
    "body": "When I say over, I mean the new roll comes out in front like [this](http://imgur.com/kCiVqkc) as opposed to the [under](http://imgur.com/A3jzMiV) orientation.\n\nIt is so much easier to pull down more squares with the roll coming over. Every time I come across an under roll, I usually end up have to do a complete 360 until I can find the start. Not only does this waste time, it just seems unhygienic to have to touch the whole roll, or have to reach around just to grab hold of it. I used to think people were just lazy when loading a new roll and didn't look at the orientation, but the other day I heard someone say they always place the roll the other way. \n\nCan someone who prefers their toilet roll in the \"under\" orientation please explain the appeal and convince me that the \"over\" way is wrong?",
    "author": "BambooToaster",
    "num_comments": 13,
    "created_utc": 1372424921.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1h8unp/i_believe_having_the_over_orientation_of_toilet/",
    "comments": [
        {
            "name": "t1_cary2ev",
            "parent_id": "t3_1h8unp",
            "body": "I prefer over. However, I have children who like to bat at the toilet paper roll hanging on the wall. I've heard cats do the same thing.\n\nThe under orientation is advantageous in the event you have a small child or animal who likes to bat at the roll because it doesn't unroll. The over orientation ends with the entire roll in a pile on the floor at my house.",
            "author": "EatsMeat",
            "created_utc": 1372425684.0,
            "replies": [
                {
                    "name": "t1_cary5i8",
                    "parent_id": "t1_cary2ev",
                    "body": "I was about to post exactly the same thing as you.\n\nOver is the superior method when you live by yourself or only with adults. As soon as you introduce children or animals, under is better. Not only does it prevent the unrolling of a roll on the floor but it also slows down your child from using the entire roll when they're being potty trained.\n\nUnder provides substantially more control.",
                    "author": "PixelOrange",
                    "created_utc": 1372426035.0,
                    "replies": []
                },
                {
                    "name": "t1_carykfz",
                    "parent_id": "t1_cary2ev",
                    "body": "Incredible! Well, I never thought I'd have my mind changed on this subject. Just the other day, I was aghast to discover the toilet rolls at Caltech cafeteria were \"wrong\" - turns out they probably had good reason. \n\n&amp;#8710; awarded to EatsMeat for explaining the logic of toilet-roll under-orientation.",
                    "author": "swearrengen",
                    "created_utc": 1372427616.0,
                    "replies": [
                        {
                            "name": "t1_caryn6d",
                            "parent_id": "t1_carykfz",
                            "body": "Ha. Why thank you. I can't explain the ones at Caltech but I remember having a similar a-ha moment when it was explained to me this way.",
                            "author": "EatsMeat",
                            "created_utc": 1372427884.0,
                            "replies": [
                                {
                                    "name": "t1_caryrhj",
                                    "parent_id": "t1_caryn6d",
                                    "body": "Students and cafeteria loos, usually disaster. I checked a dozen loo berths and it was all underhang. I even took a picture in disbelief! \n\nNow I think it must have been policy, sick of finding rolls \"spun\" onto the floor.",
                                    "author": "swearrengen",
                                    "created_utc": 1372428306.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "name": "t1_caryzpt",
                            "parent_id": "t1_carykfz",
                            "body": "Confirmed: 1 delta awarded to /u/EatsMeat",
                            "author": "DeltaBot",
                            "created_utc": 1372429095.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cas5hhz",
                    "parent_id": "t1_cary2ev",
                    "body": " ∆\n\nBasically what others said, makes sense to me. I won't be flipping it any time soon, but I can see why one would.\n",
                    "author": "BambooToaster",
                    "created_utc": 1372446368.0,
                    "replies": [
                        {
                            "name": "t1_cas5q6p",
                            "parent_id": "t1_cas5hhz",
                            "body": "Confirmed: 1 delta awarded to /u/EatsMeat",
                            "author": "DeltaBot",
                            "created_utc": 1372446990.0,
                            "replies": []
                        },
                        {
                            "name": "t1_casyz2m",
                            "parent_id": "t1_cas5hhz",
                            "body": "It feels like I've been living a lie! An unwarranted sense of... moral righteousness... all these years.",
                            "author": "swearrengen",
                            "created_utc": 1372562411.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cas710g",
                    "parent_id": "t1_cary2ev",
                    "body": "I can confirm that cats do the same. Until I switched to the 'under' orientation, I'd come home from work every day to an entire roll of toilet paper piled on the floor, or worse, into the toilet bowl.\n\nBefore I got my cat, I preferred the 'over' orientation and will return to it when I no longer have a cat.",
                    "author": "moderatelime",
                    "created_utc": 1372450360.0,
                    "replies": []
                },
                {
                    "name": "t1_casemen",
                    "parent_id": "t1_cary2ev",
                    "body": "[deleted]",
                    "author": "[deleted]",
                    "created_utc": 1372473447.0,
                    "replies": [
                        {
                            "name": "t1_caska98",
                            "parent_id": "t1_casemen",
                            "body": "Confirmed: 1 delta awarded to /u/EatsMeat",
                            "author": "DeltaBot",
                            "created_utc": 1372499696.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_caryrmq",
            "parent_id": "t3_1h8unp",
            "body": "Having it in the \"under\" orientation is preferable in public places, especially where there are children around. It's much more difficult to unroll the entire sheet by spinning it when it's underhanded and it encourages a more moderate use of paper, preventing waste and clogging.",
            "author": "pat5168",
            "created_utc": 1372428319.0,
            "replies": []
        },
        {
            "name": "t1_cas078y",
            "parent_id": "t3_1h8unp",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1372432793.0,
            "replies": []
        },
        {
            "name": "t1_cas4rwa",
            "parent_id": "t3_1h8unp",
            "body": "Clearly you have never owned a cat.",
            "author": "StarManta",
            "created_utc": 1372444581.0,
            "replies": []
        }
    ]
}