{
    "name": "t3_1djd6l",
    "title": "I think indie game developers should just stop developing for consoles entirely. CMV.",
    "body": "This is mostly in reaction to the release of BattleBlock Theater, a long-awaited downloadable Xbox game by the creators of Castle Crashers. Like most games, especially indies, it has its fair share of bugs, and from how I understand it, it costs quite a bit of money for developers to patch their game on Xbox live.\n\nThis issue, combined with the greater opportunity for building a community around things like custom content on PC, leads me to wonder why, If a dev team's budget can't support developing for more than one console, they would choose one that hinders their game's growth and improvement.",
    "author": "Gigawatz",
    "num_comments": 11,
    "created_utc": 1367476262.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1djd6l/i_think_indie_game_developers_should_just_stop/",
    "comments": [
        {
            "name": "t1_c9qv2xe",
            "parent_id": "t3_1djd6l",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1367476432.0,
            "replies": [
                {
                    "name": "t1_c9qwhot",
                    "parent_id": "t1_c9qv2xe",
                    "body": "Post a CMV about that.",
                    "author": "[deleted]",
                    "created_utc": 1367485947.0,
                    "replies": []
                },
                {
                    "name": "t1_c9r3p01",
                    "parent_id": "t1_c9qv2xe",
                    "body": "Rule III ---&gt;",
                    "author": "IAmAN00bie",
                    "created_utc": 1367516095.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_c9qvdi9",
            "parent_id": "t3_1djd6l",
            "body": "[redacted]",
            "author": "Rekilo",
            "created_utc": 1367478005.0,
            "replies": [
                {
                    "name": "t1_c9qzx8h",
                    "parent_id": "t1_c9qvdi9",
                    "body": "I suppose you're right. I think my title may have been crappy, as I was mostly talking about the Xbox. I see your point though, although I still wouldn't even think twice if I were developing a game, just for the chance to build a stronger long-term community on PC.\n\nAlso, in the case of my original example, I suppose it was a bit silly for me to be up in arms about this game in particular. When the same devs also made the best-selling indie title ever on Xbox Live, I guess they have no illusions about the selling power of their chosen console.",
                    "author": "Gigawatz",
                    "created_utc": 1367505215.0,
                    "replies": [
                        {
                            "name": "t1_c9r5moz",
                            "parent_id": "t1_c9qzx8h",
                            "body": "[redacted]",
                            "author": "Rekilo",
                            "created_utc": 1367521363.0,
                            "replies": [
                                {
                                    "name": "t1_c9re024",
                                    "parent_id": "t1_c9r5moz",
                                    "body": "I don't totally agree with your first point. I wasn't necessarily talking about the kind of massive following that Minecraft has gathered, but something like in the case of The Binding of Isaac, which has made extremely significant sales and gained a lot of attention on the Youtube and livestreaming communities (I would argue far more than if it were console-exclusive).",
                                    "author": "Gigawatz",
                                    "created_utc": 1367545218.0,
                                    "replies": [
                                        {
                                            "name": "t1_c9rezpm",
                                            "parent_id": "t1_c9re024",
                                            "body": "[redacted]",
                                            "author": "Rekilo",
                                            "created_utc": 1367548124.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_c9qxy3z",
            "parent_id": "t3_1djd6l",
            "body": "Your example of the 360 doesn't represent all consoles. Sony and Nintendo now have favourable policies to indie devs. If your point was merely the 360 then I would agree with you, the 10000 dollar update policy is beyond ridiculous. \n\nUltimately it all comes down to financial. Consoles have a much larger target audience than pcs and are less prone to piracy. Devs usually will make more money from a console release so that's why they target them\n",
            "author": "oreography",
            "created_utc": 1367497184.0,
            "replies": []
        },
        {
            "name": "t1_c9qz1td",
            "parent_id": "t3_1djd6l",
            "body": "More people play games on consoles then on PC. CERTAINLY more people *pay* for video games on consoles then pay for them on PC.\n\nA person has to whip out their credit card to pay for a PC game but do it through Xbox Live and you're dealing with \"points\" which abstract the actual number of dollars you're spending - thereby spending more on games than you would otherwise.\n\nI'm currently invested in the game Project CARS which made the decision to go to consoles instead of just PC and though it will cost them more money to open it up it's **sure** to sell more and make more money - thereby allowing the developer to use that money to develop DLC or their next game.",
            "author": "ezen",
            "created_utc": 1367502055.0,
            "replies": []
        },
        {
            "name": "t1_c9rantb",
            "parent_id": "t3_1djd6l",
            "body": "I hate terraria for xbox. The controls suck compared to the pc.\n\nThat said, it has 300,000 sales. 75,000 this month. Thats money.",
            "author": "Quarkism",
            "created_utc": 1367535191.0,
            "replies": []
        }
    ]
}