{
    "name": "t3_1aa7bn",
    "title": "I think John Lennon only married Yoko Ono because she looked like him. CMV",
    "body": "John Lennon must have had a large ego due to being in the 'biggest band in the world' at the time. Maybe that's why he wanted to find someone that looked like him to have sex with. \n\nI mean check out these pictures: \n\nhttp://www.tumblr.com/tagged/john%20lennon%20&amp;amp;%20yoko%20ono\n\nhttp://www.billboard.com/articles/news/949563/yoko-ono-john-lennon-fans-are-keeping-him-alive-with-their-love\n\nhttp://www.last.fm/music/John+Lennon+&amp;+Yoko+Ono/+images/2144100\n\nTheir noses, eyebrows, long hair, and thin lips make it look like a mirror image of each other [(in looks only, not in talent).](http://www.youtube.com/watch?v=EaCKKHcpf0w) Some of their pictures are even framed the same way, with them doing the same thing on each side of the picture. [Like this one.](http://24.media.tumblr.com/tumblr_lz35ja4dzH1rp9t3qo1_500.jpg) I don't have a background in photography, but it seems like these were either preplanned photo ops that were directed by John/Yoko, or their hired photography also tried to capture the likeness.\n\n[In this \"How Stuff Works\" article](http://entertainment.howstuffworks.com/john-lennon30.htm), John Lennon described Yoko Ono as, \"The only woman I'd ever met who was my equal in every way imaginable...\" Is he referring to talent and quirkiness, or looks?\n\nOn this page, he says that Yoko is, [\"Me in drag.\"](http://entertainment.howstuffworks.com/john-lennon32.htm)\n\nAfter reading some more, it seems like Lennon really liked her avant garde art. But, my question and how my view can be changed is: Would he have fallen in love with an avant garde artist, if she hadn't *also* looked quite similar to him?\n\n(Lots of political/philosophical/serious things on this board lately; thought i'd lighten the mood up if you don't mind).\n\n**Edit:** I think I should change my title a bit if that's permitted:\n\n\"I think John Lennon ~~only~~ married Yoko Ono because she looked like him. CMV\" \n\nThe \"only\" is a bit too hard-lined. Are there other cases of people marrying people of the opposite sex that look like them? Is there a name for this behavior, or could it just be a coincidence?\n\nThanks!",
    "author": "theorymeltfool",
    "num_comments": 15,
    "created_utc": 1363268306.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1aa7bn/i_think_john_lennon_only_married_yoko_ono_because/",
    "comments": [
        {
            "name": "t1_c8vjiht",
            "parent_id": "t3_1aa7bn",
            "body": "First of all, thanks for adding some diversity to the type of posts that have been here recently :)\n\nI feel your post has contadicted itself though:\n\n&gt; John Lennon described Yoko Ono as, \"The only woman I'd ever met who was my equal in every way imaginable...\" Is he referring to talent and quirkiness, or looks?\n\nIf he did indeed say every way imaginable, then it cannot be *only* due to looks, as your title suggests. ",
            "author": "Snorrrlax",
            "created_utc": 1363278527.0,
            "replies": [
                {
                    "name": "t1_c8vl1aq",
                    "parent_id": "t1_c8vjiht",
                    "body": "I think you're right. From the available evidence, it looks like while he *may* have married her due to her likeness to him and possible wanting to have sex with someone that looked like him, he no doubt *also* enjoyed her company, artistic talent, outlook on life, and quirky sense of humor that mirrored his own, so to speak. Serves me right for thinking in absolutes, something I usually point out to other people :-)\n\nI guess I added the \"only\" in my title because of how annoyed everyone else was with Yoko (fans, band members, Bill Burr, Chuck Berry, etc.), but after reading more into it looks like she had some redeeming qualities that John admired/respected.\n\n∆ Thanks for the input and changing/adding to my view! ",
                    "author": "theorymeltfool",
                    "created_utc": 1363282951.0,
                    "replies": [
                        {
                            "name": "t1_c8vlcpn",
                            "parent_id": "t1_c8vl1aq",
                            "body": "Confirmed - 1 delta awarded to /u/Snorrrlax",
                            "author": "DeltaBot",
                            "created_utc": 1363283846.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_c8vo5d1",
            "parent_id": "t3_1aa7bn",
            "body": "Psychology student here. Social psychologists say it's very common for people to be friends/romantic partners with people who not only have similar attitudes, values, and interests, but also share physical similarities. It's why most social circles consist of people of similar sex, skin color, and age. Speaking from personal experience, the connection with me and my current girlfriend started over a shared interest in video games, and a couple weeks ago, a friend thought we were siblings.\n\nSo I'm not so much trying to tell you you're wrong that their similarities aren't a reason for his romantic attraction, but I'm challenging what I see as the implication that he's alone in doing so. In other words, I'm answering your question of...\n\n&gt; Are there other cases of people marrying people of the opposite sex that look like them? Is this a thing...?\n\n...with an emphatic yes, and it's not just limited to marriage, or even romance.",
            "author": "GameboyPATH",
            "created_utc": 1363291562.0,
            "replies": [
                {
                    "name": "t1_c8vsnu1",
                    "parent_id": "t1_c8vo5d1",
                    "body": "Is there a term for this type of thing?",
                    "author": "theorymeltfool",
                    "created_utc": 1363304712.0,
                    "replies": [
                        {
                            "name": "t1_c8vtkju",
                            "parent_id": "t1_c8vsnu1",
                            "body": "Sort of. The *general* phenomenon that describes the tendency for people to be attracted to similar-looking people doesn't have a specific term, it's just one factor among many that determines attraction. An informal naming of it would be \"like-attracts-like\", as Wikipedia describes it.\n\nA more specific idea within this idea does have a term: [Matching Hypothesis](http://en.wikipedia.org/wiki/Matching_hypothesis), which focuses on one's attraction to someone who is just as socially desirable as one's self.",
                            "author": "GameboyPATH",
                            "created_utc": 1363307477.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_c8vrprg",
            "parent_id": "t3_1aa7bn",
            "body": "You probably have a point in that they look quite similar, at least as much as a white Englishman and a small Japanese lady can look alike, but I think you've misunderstood the nature of their relationship. She came in to his life at a time when he was experimenting heavily with LSD, a drug which he has stated killed his ego completely. He was extremely dissatisfied with his involvement with the Beatles and the fame that it had brought him. When he first met Yoko, she didn't give a shit who he was. Can you imagine the allure of a woman who couldn't care less about your fame after years of being chased by screaming girls every time you set foot in public?\n\nI think you'll find also that they were extremely aligned in their philosophical and political beliefs, which was the bedrock of their relationship really. Also, from 1975-1980 he virtually withdrew completely from the public eye to be with his family. People with trophy wives (which is essentially what you are equating Yoko to) simply don't do that.",
            "author": "bold_arrow_of_time",
            "created_utc": 1363301873.0,
            "replies": [
                {
                    "name": "t1_c8vsl8l",
                    "parent_id": "t1_c8vrprg",
                    "body": "&gt; You probably have a point in that they look quite similar, at least as much as a white Englishman and a small Japanese lady can look alike\n\nI think that's the *most* a white Englishman and a small Japanese/American women can look like each other. Then again, I've never seen another couple with their same background.\n\n&gt; She came in to his life at a time when he was experimenting heavily with LSD, a drug which he has stated killed his ego completely. He was extremely dissatisfied with his involvement with the Beatles and the fame that it had brought him. When he first met Yoko, she didn't give a shit who he was. Can you imagine the allure of a woman who couldn't care less about your fame after years of being chased by screaming girls every time you set foot in public?\n\n∆ Thanks for the excellent response! That's a great point.\n\n&gt; Also, from 1975-1980 he virtually withdrew completely from the public eye to be with his family. People with trophy wives (which is essentially what you are equating Yoko to) simply don't do that.\n\nWhen were all those pictures of them taken? I thought it was during this time period.\n\nThanks again!",
                    "author": "theorymeltfool",
                    "created_utc": 1363304494.0,
                    "replies": [
                        {
                            "name": "t1_c8vt2r2",
                            "parent_id": "t1_c8vsl8l",
                            "body": "Confirmed - 1 delta awarded to /u/bold_arrow_of_time",
                            "author": "DeltaBot",
                            "created_utc": 1363305972.0,
                            "replies": []
                        },
                        {
                            "name": "t1_c8vuv93",
                            "parent_id": "t1_c8vsl8l",
                            "body": "Yeah, you are definitely right. They do look remarkably similar. I think John does look fairly unusual for an Englishman as he does have a quite flat nose and narrow eyes. \n\nWhile it looks like some of the pictures in your links may be from his retirement period (most notably the one where he is naked and cradling up to Yoko), a majority of them are between 1968 and I'd say around '74 as that is when the pair of them were most active, both in music and activism. Mind you, John did re-enter the music business shortly before his death in 1980 so there are a few shots in there that can throw you off. You can usually tell though because they have both aged significantly, as can be seen in [this shot](http://i.imgur.com/P6ltXc8.jpg).\n\nCheers for my first delta, glad I could help shed some light on it.",
                            "author": "bold_arrow_of_time",
                            "created_utc": 1363311511.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_c8wq24a",
            "parent_id": "t3_1aa7bn",
            "body": "Yes, this is how humans work. This is one of the reasons why incest is so common. It's a basic instinct/psychological thing for us to admire ourselves and searching for people similar to us for relationships.",
            "author": "2Fab4You",
            "created_utc": 1363444521.0,
            "replies": [
                {
                    "name": "t1_c8wq79k",
                    "parent_id": "t1_c8wq24a",
                    "body": "&gt; This is one of the reasons why incest is so common\n\nIs it really though? [2-20% doesn't seem that common.](http://en.wikipedia.org/wiki/Incest#Prevalence_and_statistics)\n\n&gt; It's a basic instinct/psychological thing for us to admire ourselves and searching for people similar to us for relationships.\n\nI agree with that, especially with regards to personality, ambition, dogs or cats, etc. I just thought that since they look *so* similar to each other that it was more out of ego, than out of personality. It seems like it was a combination of both.",
                    "author": "theorymeltfool",
                    "created_utc": 1363445198.0,
                    "replies": [
                        {
                            "name": "t1_c8wqgbw",
                            "parent_id": "t1_c8wq79k",
                            "body": "20% ?! Wow, I thought it was more like 1%. \"Common\" is a subjective word, and I think even 2% could be considered common when you take into consideration that it's illegal pretty much all over the world and most people claim to find it disgusting and wrong.\n\nIsn't ego personality? ;)",
                            "author": "2Fab4You",
                            "created_utc": 1363446298.0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}