{
    "name": "t3_1f60pz",
    "title": "Contrary to popular opinion, I don't think Cartoon Network has taken a turn for the worse. CMV",
    "body": "The title is pretty straight forward.\n\nI'm always seeing these posts on Facebook saying \"Like for the old Cartoon Network\" or something along the lines of that. Don't get me wrong, I enjoyed the older shows. I'm just saying, they can't go on forever or they'll have a downfall of their own (i.e. Spongebob). Plus the new shows really aren't that bad. They'll get a chuckle out of me every once in a while. I'll admit some shows are MUCH better than others, though.\n\nI just see the new Cartoon Network as a change. NOT for the worse and NOT for the better. Just simply a change. \n\nCMV.",
    "author": "McLovinItGunn",
    "num_comments": 2,
    "created_utc": 1369698599.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1f60pz/contrary_to_popular_opinion_i_dont_think_cartoon/",
    "comments": [
        {
            "name": "t1_ca74os6",
            "parent_id": "t3_1f60pz",
            "body": "First off I'm going to assume that is actually the popular opinion and isn't the result of bias. I don't think the argument is that the old shows should still be continuing but rather that there has a been a shift in the types of shows. \n\nApproximately ten years ago when I was watching Carton Network (CN) there was a focus on airing Japanese style Anime. Anime often has more depth in terms of character development, plot development, while addressing more abstract concepts such as morality, and honor.\n\n\nPlaying the devils advocate the older CN may appear better due to a cognitive bias known as Rosy retrospection.",
            "author": "suRubix",
            "created_utc": 1369699478.0,
            "replies": []
        },
        {
            "name": "t1_ca75brh",
            "parent_id": "t3_1f60pz",
            "body": "Well, to be fair this a post about tastes so it's a bit hard to necessarily *change* a view based on tastes. I can explain what the opposing viewpoint is though, so to break this down...\n\nCartoon Network was launched in 1992, after Turner bought Hanna-Barbera Productions. If you know anything about cartoons then you know Hanna-Barbera. They were the masters of their craft and have created some of the most recognizable examples of Western animation. Huckleberry Hound, The Flintstones, Yogi Bear, The Jetsons, Atom Ant, Scooby-Doo, The Smurfs, and Tom and Jerry. William Hanna and Joseph Barbera set the foundation for Western cartoons, and are only rivaled by Disney in their level of art. \n\nHanna and Barbera were pretty old, so it made sense to sell and enjoy some retirement. Cartoon Network aired several Hanna-Barbera Productions for years, until about 1999 when they shifted towards a more \"modern\" audience focus. But between 1992 and 1999 was a really amazing age for Cartoon Network...\n\nHanna and Barbera produced the 1993 starting lineup of cartoons for Cartoon Network, Dexter's Laboratory, Cow and Chicken, The Powerpuff Girls, Ed, Edd, n Eddy, Johnny Bravo, and Courage the Cowardly Dog are the ones that come to mind. These cartoons had an interesting mix of the old, formerly Hanna-Barbera Productions, and the new, Turner Entertainment/Warner Bros.\n\nBy 2000 though Turner had split Cartoon Network into Boomerang, which is the channel that now specializes in the older cartoons, and Cartoon Network's main channel which shows the newer programming. One of the few saving graces for Cartoon Network is Toonami, which aired from 1997, I believe, to 2008. Between 97 and 2003 they showed pretty great programming. Things like Sailor Moon, Dragonball Z, Ronin Warriors, Gundam Wing, Batman: The Animated Series, Outlaw Star, Mobile Suit Gundam, G Gundam, Yu Yu Hakusho, and Rurouni Kenshin. After that Toonami's programming began to drag a bit, and things seemed pretty bad for the segment. \n\nSo, to answer your question... Cartoon Network was built on the foundation of one of the greatest Western Animation companies of all time, Hanna-Barbera Productions. Hanna and Barbera helped produce the starting 1993 cartoon lineup for Cartoon Network. Even after some of those shows were cancelled, some started to fail by 2003, Toonami carried a bit of the weight for programming. It had some of the first anime to be aired on Western television and introduced many anime fans to the genre. After Toonami began to fall the rest of the channel seemed to go with it. Boomerang airs most of the old shows, old Toonami is no more, and the newer programming just doesn't seem to compare. \n\nCartoon Network has tried to air live-action shows which is pretty bizarre to say the least, and was a pretty obvious sign they were trying to bring in a wider audience. It might just be Cartoon Network is feeling the pressure of other forms of entertainment, children aren't watching as many cartoons as they used to, and they have to stay \"modern\" and change with the times. On the other hand, it appears to most that they changed too much and it turned off their fan base. \n\nAlthough, Toonami has returned to Adult Swim and shows like Regular Show and Adventure Time seem to have been a bit of a boost to the network. It's not that *everything* about Cartoon Network is bad now, it's just that it's never going to be the same as it was when we were younger and experiencing all of their shows for the first time.",
            "author": "iRayneMoon",
            "created_utc": 1369701534.0,
            "replies": []
        }
    ]
}