{
    "name": "t3_1t7zw6",
    "title": "I don't think there's anything wrong with corporations using Reddit for advertisement. CMV",
    "body": "If a post is interesting, relevant to the place it was posted, and sparks dialogue, I don't feel there is anything wrong with someone using reddit as a marketing tool. If a corporate advert post does not meet that criteria, reddit will downvote it, as it should. I think downvoting a humorous or interesting post just because it seems to be an advertisement is immature. A company who can capture my attention deserves for me to check them out, **ESPECIALLY** if they are able to do so on reddit. \n\n[Here](http://www.reddit.com/r/funny/comments/1t748s/makes_me_laugh_every_time_i_drive_by/) is an example of a post that's most likely an advert from the company pictured. If you read the comments, it's pretty obvious that at least a few of them have some affiliation with the company. That doesn't mean the post should be downvoted. It was funny to me which is relevant to the topic of that subreddit. Does it make me want to check out their product? Possibly. That isn't a bad thing though and is secondary to me enjoying the post. Do I think it's lame to make fake comments saying how great the company is in a pseudo-authentic fashion? Absolutely, and I did downvote the suspect comments. However, my focus is for the post itself, not the comments.\n\n/r/HailCorporate seems to be quite disturbed with any advertisement on reddit that get's some attention. I don't think there's anything wrong with clever advertising on reddit. CMV.",
    "author": "Ubb_zerve",
    "num_comments": 3,
    "created_utc": 1387424579.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1t7zw6/i_dont_think_theres_anything_wrong_with/",
    "comments": [
        {
            "name": "t1_ce5a08y",
            "parent_id": "t3_1t7zw6",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1387425523.0,
            "replies": [
                {
                    "name": "t1_ce5aj6y",
                    "parent_id": "t1_ce5a08y",
                    "body": "This comment has been removed per rule 1",
                    "author": "Amablue",
                    "created_utc": 1387426847.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_ce5jtin",
            "parent_id": "t3_1t7zw6",
            "body": "I think that posting a sign (that you set up) and saying \"look at this funny sign I saw\" annoys the people of reddit, because it's a lie. If they said \"Look at this funny sign *we* set up\" people would be less annoyed, wouldn't call \"Hail Corporate!\" and might try to get an AMA going with the company.\n\nIt's not (primarily) the advertising that gets reddit's hackles up, it's the lying.\n\nAnd, if they really want to use reddit as an advertising space, then they should ***pay*** for it.",
            "author": "notian",
            "created_utc": 1387466580.0,
            "replies": []
        }
    ]
}