{
    "name": "t3_1ybhb0",
    "title": "I think Onodera is best girl over Chitoge, CMV",
    "body": "The appeal I've found in Onodera is the enormous moe factor. While I can acknowledge Chitoge's moe factor, it is not nearly as prevalent in Chitoge. the Hanakana deal adds to that too. And just as soon as Chitoge goes moe mode on me, she abruptly goes into abusive tsundere mode and beats the shit out of Raku. I don't believe a relationship can stem from adoration if one adores the other, but when both adore each other I think it can only end well (i.e. Onodera and Raku.) While I appreciate that later on Chitoge can acknowledge her feelings, that is indeed one-sided. Onodera's constant success in the popularity polls is clear evidence to me that most are in agreement of Onodera's superiority.\n\nTo appease the Tsugumi/Marika people, I will say that Tsugumi is not fitting at all because she does not develop as a character period and remains the in-denial tsundere the entire way through, and I already covered how I don't believe one-sided adoration can ever work out in the end. Oh yeah, and I guess as of last week I have to start acknowledging Haru people too (if they exist.) Haru will never ever be thought of as a romantic interest by Raku, so while she's cute and all, there's not much to her aside from that and she isn't even really on the playing field for best girl even if she's technically apart of the harem now.\n\nUltimately I can acknowledge Chitoge as a rival interest but I fail to see how she could ever surpass Onodera. CMV.",
    "author": "taigadontask",
    "num_comments": 3,
    "created_utc": 1392788323.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1ybhb0/i_think_onodera_is_best_girl_over_chitoge_cmv/",
    "comments": [
        {
            "name": "t1_cfj1062",
            "parent_id": "t3_1ybhb0",
            "body": "Neither of the two main girls is the best option. They both are simply foils to examine the character of Raku. They fall into traditional Red Oni/Blue Oni tropes exaggerating each other's stereotypical traits rather than developing unique character of their own. While what it says in the official promotional material might disagree and final decision might be put off until past the end of the official media the \"true\" victor was determined by the preferences of the creator before anything was penned. The truth is obvious is you look at his/her early works and apply figure out which character corresponds to the true victor of those bouts.\n\nThe only \"best girl\" would be one who genuinely breaks from harem tropes and becomes a true character in her own right. But given the derivative nature of the genera we all know that isn't going to happen.\n\nThis is a devil's advocate post, noted in accordance with the rules of the forum. I have literally no idea what this post is about.",
            "author": "A_Soporific",
            "created_utc": 1392789657.0,
            "replies": [
                {
                    "name": "t1_cfj15rk",
                    "parent_id": "t1_cfj1062",
                    "body": "This post made me giggle a bit too much.",
                    "author": "zardeh",
                    "created_utc": 1392790132.0,
                    "replies": []
                },
                {
                    "name": "t1_cfj94zj",
                    "parent_id": "t1_cfj1062",
                    "body": "This is a very, very interesting take on this scenario. To play on your theory I will do some investigating on the creator's past one-shots and see if I can discern the creator's taste and keep what your would-be-prediction is in mind throughout the course of the story. If they are foils to examine Raku's character this story could be more psychologically oriented than I'd previously perceived. I've heard a similar theory in regards to Eva that Misato, Asuka, and Rei are all used for the analysis of Shinji, and with the amount of praise on Eva, I wonder - maybe the Onodera/Chitoge best girl debate goes deeper than the general consensus of it being silly slapstick comedy with no meaning.",
                    "author": "taigadontask",
                    "created_utc": 1392824175.0,
                    "replies": []
                }
            ]
        }
    ]
}