{
    "name": "t3_1cb3pd",
    "title": "I think any vehicle parked illegally should be fair game to vandalism without fear of legal repercussion. CMV.",
    "body": "I think any vehicle parked illegally should be fair game without fear of legal repercussion. I would certainly think longer and harder about parking my vehicle in an illegal zone if I knew any passer-by could key it or break the windshield without getting in trouble, CMV.",
    "author": "The_Dead_See",
    "num_comments": 7,
    "created_utc": 1365910624.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1cb3pd/i_think_any_vehicle_parked_illegally_should_be/",
    "comments": [
        {
            "name": "t1_c9erwp8",
            "parent_id": "t3_1cb3pd",
            "body": "As someone who has parked illegally a few times, I was not aware that it was not legal to park there because I had always parked there at night. Once I found out, I moved my car.\n\nVandalism should never be \"okay\", especially since you can just call a tow truck and have it moved. If you want to mess up someone's car, it's unlikely you'll ever be caught. Just do it and stop trying to morally justify it.\n\ntl;dr: Don't always assume someone is just being a malicious dick, and don't retaliate.",
            "author": "PixelOrange",
            "created_utc": 1365910777.0,
            "replies": [
                {
                    "name": "t1_c9eu6s8",
                    "parent_id": "t1_c9erwp8",
                    "body": "Exactly. I agree. YOUR GRANDMOTHER parks her car illegally at the local grocery store because it's snowing out and she doesn't see the sign. As soon as she steps foot in the store, a bunch of guys come out and put her car up on cinder blocks and strip it down to the frame.  \nThis should not be allowed.",
                    "author": "svenson_26",
                    "created_utc": 1365919906.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_c9et7w3",
            "parent_id": "t3_1cb3pd",
            "body": "I can sympathize with your sentiments. Just the other day, I encountered a vehicle that was illegally standing in a no stopping zone and blocking a lane of a heavily trafficked street, backing up traffic and making me wish for a rule similar to the one you want.  But most parking offenses are less egregious. I've received a parking ticket for parking in a space that was restricted to use by one organization, where the restriction was indicated by one sign on a block and not by another, and there were plenty of other spaces for the organization.  My car wasn't blocking traffic or hindering access, but it was in violation of a rule. \n\nThere are other ways one could easily park illegally, but not actually be causing harm.  If a handicapped person forgets to display their placard, for example.  Having an expired inspection sticker on your vehicle. (Once I got a ticket the day after it expired.)  Or a person could be parked legally and be terribly disruptive. I've seen plenty of cops plant their vehicle somewhere that blocks traffic just to go inside for a cup of coffee.\n\nSo legality doesn't precisely correlate with whether someone has done something wrong and deserving of penalty, and vandalism of their vehicle is not an effective penalty either.  You're essentially leveling an arbitrary fine on them of the hundreds or thousands of dollars in damage that could be done to their vehicle, with the added inconvenience and disruption that will do to their work.  People already get ticketed, booted, and towed, and none of that stops them from illegally parking.  I believe it doesn't work because usually they can get away with it.  Studies have shown that the certainty of a penalty has more effectiveness than the severity - a 90% chance of a fine would do more than a .1% chance of having your vehicle confiscated.\n\nSo let me propose an alternative: let anyone who spots an illegally parked vehicle report it - take photos, submit an affidavit, send it in, and the driver will get a ticket.  You could do it all from an app on your smartphone.  Then anyone can enforce the law and the enforcement will be more certain.  You'll get that personal feeling of validation that you've made a difference, and the knowledge that any violation could be caught will change drivers behavior.",
            "author": "kwykwy",
            "created_utc": 1365915643.0,
            "replies": [
                {
                    "name": "t1_c9f4p0c",
                    "parent_id": "t1_c9et7w3",
                    "body": "∆ ",
                    "author": "The_Dead_See",
                    "created_utc": 1365969885.0,
                    "replies": [
                        {
                            "name": "t1_c9f543k",
                            "parent_id": "t1_c9f4p0c",
                            "body": "Confirmed - 1 delta awarded to /u/kwykwy",
                            "author": "DeltaBot",
                            "created_utc": 1365971142.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_c9etprq",
            "parent_id": "t3_1cb3pd",
            "body": "Your argument is that you should be able to do otherwise illegal things to people who break the law.\n\nIn any case - you are not given the right to punish someone for crimes. That is the role of law. \n\nYour suggestion would be inconsistent with how law is enforced. \n\nIf you want to change that very fact - that's another discussion.",
            "author": "howbigis1gb",
            "created_utc": 1365917696.0,
            "replies": []
        },
        {
            "name": "t1_c9f2d60",
            "parent_id": "t3_1cb3pd",
            "body": "Vigilante justice is a risky proposition, not to mention permitting excessive punishment for the most minimal of crimes. Beyond this, the destruction of property involved could quickly escalate into violence on the part of a furious vehicle owner who disagrees with the law, believes they are in the right, or is involved in a dubious case.\n\nLet's take an example. A brand new Ford F-350 with no shortage of optional additions will easily cost over $30,000. The driver of this vehicle parks in a spot reserved for those with handicaps and a visible card to show their eligibility. The driver is not displaying a card. By this rule, I would be permitted to take a crowbar and break out the windshield and windows, hack a hole in the hood, inject glue into the locks, spray paint a message across the side, slash the tires, and top it all off with two dozen rotting eggs thrown into the pickup bed to bake in the sun.\n\nThe owner of the truck comes back six hours later, hobbling on their recently broken leg, unhappy about their pending visit to the DMV the next day to get their temporary card and hoping that they didn't get a ticket for breaking the letter of the law although not the spirit, but their $30,000 truck has suffered thousands of dollars in damage at the least.\n\nSure, that's one of the more excessive cases, but it must be taken into account. Is there a limit to how much vandalism is acceptable? Are we talking minor infractions, ADA violations, or just blatant parking in fire zones? If one person has already vandalized the vehicle, does that mean others are not permitted to smash a bit as well? Who takes responsibility for encouraging this behavior when someone suffers major vehicle damage and was parked in a fashion which could easily appear incorrect to a police officer yet the ticket would be overturned due to lesser known permissions which meant that parking in such an annoying fashion was just fine?\n\nWhat do you do when someone with a concealed carry permit steps outside of a shop to find vandals destroying their truck with tire irons? Should the truck owner be permitted to assume that several people with improvised weapons in their hands may be a legitimate threat in the heat of the moment? Are the vandals compelled to retreat from the vehicle the moment the owner is in sight?\n\nEven if we assume that the laws are completely unambiguous and limited to very particular situations, even if we assume that people are capable of recognizing these situations without reaching beyond the limits of the laws, this would be giving the average person rights to be judge, jury, and executioner of the vehicle. There is simply no reasonable way to implement such a law without opening the doors to dangerous misinterpretation.\n\nAs it stands, people with legitimate reasons to use handicap accessible spaces and valid placards who suffer from conditions which are not clearly visible face harassment for their correct use of the parking spots. Even if vandalism would not be okay under these circumstances, many otherwise reasonable citizens would see this as a valid use of their vigilante rights. Despite being in the wrong, what are the odds that someone would be caught gouging one long key mark across the vehicle before walking away thinking they were doing the right thing?\n\nThe risk is far too great for what would be minor benefits and very possibly discouragement of legitimate uses of restricted parking spaces. It's the kind of idea that sounds good from the gut, but it just can't work the way you would want.",
            "author": "SoldatJ",
            "created_utc": 1365962718.0,
            "replies": []
        }
    ]
}