{
    "name": "t3_1idmwx",
    "title": "CMV: I believe George Zimmerman would have been found guilty of 3rd degree murder had Trayvon been white.",
    "body": "To be honest I really believe the real issue to this case is the fact that a dead teen was unable to give his side of the story.   As a result the only available facts to judge George Zimmerman was his account of what happened, the available evidence and the assumptions made of the kind of person Trayvon might have been.\n\nBeing that Trayvon was black I think alot of assumptions we're made that he was dangerous which made it easy to believe Zimmerman acted in self defense.    Had Trayvon been white we would have been more focused n fact that an unarmed teen was killed by an armed adult.",
    "author": "b_blizzy",
    "num_comments": 21,
    "created_utc": 1373934854.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1idmwx/cmv_i_believe_george_zimmerman_would_have_been/",
    "comments": [
        {
            "name": "t1_cb3f38u",
            "parent_id": "t3_1idmwx",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1373935616.0,
            "replies": [
                {
                    "name": "t1_cb3h1j9",
                    "parent_id": "t1_cb3f38u",
                    "body": "Doubtful on the \"black panic,\" he has a black relative and participated in protests for equal rights for blacks. There was an AP article explaining that the FBI interviewed a few dozen people that knew Zimmerman looking for evidence of racism. They found no evidence.",
                    "author": "ThinkWithMe",
                    "created_utc": 1373941138.0,
                    "replies": []
                },
                {
                    "name": "t1_cb3h5qc",
                    "parent_id": "t1_cb3f38u",
                    "body": "On so many levels, there is really no evidence or profile showing Zimmerman to be racist.  Even the prosecution avoided that card.",
                    "author": "novagenesis",
                    "created_utc": 1373941464.0,
                    "replies": [
                        {
                            "name": "t1_cb3h79h",
                            "parent_id": "t1_cb3h5qc",
                            "body": "[deleted]",
                            "author": "[deleted]",
                            "created_utc": 1373941581.0,
                            "replies": [
                                {
                                    "name": "t1_cb3hfyi",
                                    "parent_id": "t1_cb3h79h",
                                    "body": "From the facts, it seems unnecessary.  The witnesses matched the evidence, which matched the defendant's story.  I just don't understand why the prosecution took it to court at all.",
                                    "author": "novagenesis",
                                    "created_utc": 1373942240.0,
                                    "replies": [
                                        {
                                            "name": "t1_cb3hojn",
                                            "parent_id": "t1_cb3hfyi",
                                            "body": "Because in most parts of the country you don't get to start a confrontation and then claim self-defense when you realize you are in over your head.  Your interpretation of the evidence and the witnesses are of course, subjective.  Reasonable people see it differently.",
                                            "author": "buscoamigos",
                                            "created_utc": 1373942896.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cb3hv1w",
                                                    "parent_id": "t1_cb3hojn",
                                                    "body": "In 49 of the 50 states, this defense would have worked (not Ohio..need preponderance of evidence, which I think would be a close one on this case).\n\nHowever, there is *no* presented evidence that he initiated anything physical.  Both Martin's last phone call and Zimmerman's story suggest Martin was immediately on the defensive from that \"creepy-ass cracker\", and did 100% of the escalation until it got physical.  The shooting did not happen until the uninjured Martin had Zimmerman on the ground and was (almost certainly) on top of him.\n\nIf I walk up to you to see what you're doing, and you freak out and jump me...I may be stupid, or a prick..but killing you is self-defense.  You don't get to initiate life-threatening violence on someone for not being friendly.  In fact, if I call you a name or say something about your mother, and you start hitting my head into the pavement, it's still self-defense to kill you if *you* initiated the violent action.\n\nHonestly, this whole thing looks like both parties misunderstood the situation, and miscommunications were everywhere... but Trayvon Martin seems by all accounts to have both initiated and escalated the violence to levels where lethal response was on the table.  Doesn't matter if Martin *intended* to kill Zimmerman, only that his actions showed a situation that could easily kill Zimmerman if he didn't stop it.  That's what you need in 49 states for self-defense...reasonable doubt.",
                                                    "author": "novagenesis",
                                                    "created_utc": 1373943382.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cb3hwqp",
                                                            "parent_id": "t1_cb3hv1w",
                                                            "body": "[deleted]",
                                                            "author": "[deleted]",
                                                            "created_utc": 1373943511.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cb3i58e",
                                                                    "parent_id": "t1_cb3hwqp",
                                                                    "body": "&gt; http://trayvon.axiomamnesia.com/people/witnesses/witness-8-files-trayvon-martin-george-zimmerman-case/\n\nShe said he ran away, then was verbally confronted by Zimmerman who said \"What are you doing around here?\"\n\nWhat part of that breaks down the \"theory\" that the defence argued that fit the evidence?  In fact, Martin running away fully fits Zimmerman's story of the situation.  It's not like Zimmerman attacked Martin while he ran and Martin defended himself.  Even Deedee's defense suggests that \"Martin got fed up and fought with Zimmerman\" was a sensible claim.  The big witness-difference between the phone witness and forensics was that Deedee thought she could hear \"a little bit of sound\", Trayvon saying \"Get off, get off\"... this doesn't fit the forensic evidence...  The eye-witness saw one person on top, and one on the bottom..not a ton of rolling... the facts put Zimmerman on the bottom with concrete striking the back of his head.\n\nA person who had run from the local crime-watch (that most of the neighborhood knew about) got scared or pissed and started a scuffle that ended in Zimmerman legitimately fearing for his life, and pulling a trigger.\n\nThat might not be what really happened, but this is *law*, and in the absence of all the facts, we base on reasonable doubt.  Unless that above description could be shown unreasonable by the prosecution, they.had.no.case.",
                                                                    "author": "novagenesis",
                                                                    "created_utc": 1373944140.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_cb3k3w0",
                                                                            "parent_id": "t1_cb3i58e",
                                                                            "body": "&gt;this doesn't fit the forensic evidence... The eye-witness saw one person on top, and one on the bottom..not a ton of rolling\n\nEyewitnesses are notoriously unreliable--especially when it is dark and rainy.",
                                                                            "author": "someone447",
                                                                            "created_utc": 1373949986.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_cb3otsg",
                                                                                    "parent_id": "t1_cb3k3w0",
                                                                                    "body": "And the victim's friend on the phone who kinda heard something is any more reliable?  \n\nRelatively speaking, phone-girl is strictly less reliable a witness than the one who saw the incident.",
                                                                                    "author": "novagenesis",
                                                                                    "created_utc": 1373974022.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_cb43t7z",
                            "parent_id": "t1_cb3h5qc",
                            "body": "When I talk to people about this case,  I actually avoid using the word racist\" to describe George Zimmerman.   One because I think it's kind of vague word (that's another discussion) and two more time get's spent trying to prove he's racist then proving he was justified in killing an unarmed 17 year old.   I'm also a person doesn't believe in making a distinction between crime and hate crimes but that's also another discussion.  \n\nAll this to say,  I understand why they avoided that card and I still believe the outcome of this case if Trayvon had been white.\n\nYou may have not changed my view but for what it's worth, have an upvote.",
                            "author": "b_blizzy",
                            "created_utc": 1374016438.0,
                            "replies": [
                                {
                                    "name": "t1_cb44gly",
                                    "parent_id": "t1_cb43t7z",
                                    "body": "&gt; I understand why they avoided that card\n\nI think the main reason they avoided that card is because they knew Zimmerman was not a racist.\n\n&gt; I still believe the outcome of this case if Trayvon had been white. [would have been different]?\n\nIt *is* hard to tell, sure.  We'll never know.  But in white+white cases, where a competent defence is presented regarding a self-defence claim of not guilty, you just don't see guilty. \n\nNothing about the event, about Martin's criminal history, or about the forensics suggests that Martin did not initiate an *apparently* violent attack against Zimmerman.\n\nWe know that:\n\n1. Both parties were on edge\n\n2. Martin had an opportunity to leave the scene, but did not (this piece may not have been related, but can be meaningful in aggregate)\n\n3. Martin had Zimmerman pinned to the ground with Zimmerman having a head wound at the time of the shooting.\n\nOf course, 3 is the big one unless someone has a *strong* argument that Zimmerman escalated physical assault.  An out-of-shape guy was in a position he probably could not escape from, having received the first of (what could have been many, or could not have been any more) wounds that would have a good chance of permanently injuring or killing him.\n\nThat's such an overwhelming amount of reasonable doubt that only a terrible defence couldn't get one person on a jury.  The police didn't seem to *want* to arrest, the DA didn't seem to *want* to prosecute.  There's a good reason.  They had to know the odds were slim and that they could not prosecute later if new evidence came out.  Nothing is worse than having your hand forced when you know that's the end of the game.\n\nI think you're focusing a lot on the unarmed 17 year old... a jury would be focused on the unarmed 17 year old on TOP of an out-of-shape old guy slamming his head in the ground... and then the judge would speak to them and tell them repeatedly about \"reasonable doubt\".  He would repeat \"reasonable doubt\" until the first reasonable doubt led people to go \"oh, shit...that's reasonable doubt\"\n\nA key part of your belief is that there were assumptions made of him being dangerous.  How could anyone portray anyone else on top of a guy slamming his head into the ground as NOT dangerous?  Further, while he did not have a criminal record, he would be extremely easy to paint as a criminal, from his violent/angry photographs to the *reasons* of his suspension from high school.  \n\nThen, look at stuff like this [picture](http://axiomamnesia.com/wp-content/uploads/2012/05/martin-zimmerman-case-trayvons-body-crime-scene.png).  The jury did.  The jury also (presumably) heard that Martin bragged about being a repeat violent offender so much that his own mother thought he was arrested when he was 5-hours late from 7/11.\n\nIf you've got testimony that supports \"I beat the shit out of people who look at me wrong\" and suddenly that person is shot while on to of a wounded man with no violent history, and there are no good witnesses... if the story matches the forensics, and there's no compelling evidence, the guy walks.",
                                    "author": "novagenesis",
                                    "created_utc": 1374018284.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cb3fhzf",
            "parent_id": "t3_1idmwx",
            "body": "Here's the thing- the only reason why Zimmerman was let off without a charge was because of a severe lack of admissible evidence. Nearly everyone involved in the case wanted to hook him on at least manslaughter, but a lack of evidence prevented them from doing that, because in this country there is something called a presumption of innocence- you're legally assumed to be innocent unless sufficient evidence can be found to declare something else. ",
            "author": "TOUCHER_OF_SHEEP",
            "created_utc": 1373936793.0,
            "replies": [
                {
                    "name": "t1_cb3gi8l",
                    "parent_id": "t1_cb3fhzf",
                    "body": "The combination of innocent until proven guilty + reasonable doubt creates a pretty high bar.\n\nWith Self Defense as an acceptable legal defense, and the ONLY witness having seen Martin on top of Zimmerman combined with bloody photos of Zimmerman,   the prosecution was facing a massively uphill case from the beginning.\n",
                    "author": "jsreyn",
                    "created_utc": 1373939611.0,
                    "replies": [
                        {
                            "name": "t1_cb3hcuv",
                            "parent_id": "t1_cb3gi8l",
                            "body": "&gt; The combination of innocent until proven guilty + reasonable doubt creates a pretty high bar.\n\nIt's supposed to.  However, I don't even see a preponderance of evidence in this case.  There's a few minor inconsistencies, but nothing major that would suggest Zimmerman's story is wrong...except people wanting it to be wrong.",
                            "author": "novagenesis",
                            "created_utc": 1373942005.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cb3g3ht",
            "parent_id": "t3_1idmwx",
            "body": "I don't thing so, when it comes down to it it was Mr. Zimmermans word vs. Mr. Martian via piecing together his last moments. So you can see who has an advantage its the person who can change their story. So that being said I think he would get off a gian b/c he is the only one alive that was there. Sad but true.  ",
            "author": "i_noticed_you",
            "created_utc": 1373938471.0,
            "replies": []
        },
        {
            "name": "t1_cb3gj80",
            "parent_id": "t3_1idmwx",
            "body": "Did you see the evidence?\n\nIt was so lopsided I'm surprised the jury took that long. Every piece of evidence they had supported Zimmerman's story of self defense. ",
            "author": "CherrySlurpee",
            "created_utc": 1373939687.0,
            "replies": [
                {
                    "name": "t1_cb444gx",
                    "parent_id": "t1_cb3gj80",
                    "body": "I hear ya.   And this is the part where I confess someone like me would not make it working in the justice system especially as a lawyer.  In spite of the available evidence presented there's something in me that doesn't believe unarmed Trayvon was a threat.  Who knows, maybe had he grabbed the gun he would have been the one to say back off and run away.   Again, a dead kid can't tell his side of the story.\n",
                    "author": "b_blizzy",
                    "created_utc": 1374017320.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cb3gw5a",
            "parent_id": "t3_1idmwx",
            "body": "Assumptions don't get guilty verdicts. Juries are directed by judges that verdicts must be made based on facts, evidence, and what they regard as truthful testimonies. \n\nSource: I've been on jury duty.\n\nIn this particular case, it boils down to reasonable doubt that Zimmerman was for sure the aggressor due to witnesses testifying that Martin was on top and essentially using the concrete as a weapon against the guy's head. Maybe Zimmerman actually was the aggressor, and maybe a lot of other things happened, but our judicial system doesn't issue guilty verdicts based on maybe's.",
            "author": "ThinkWithMe",
            "created_utc": 1373940712.0,
            "replies": [
                {
                    "name": "t1_cb3he94",
                    "parent_id": "t1_cb3gw5a",
                    "body": "&gt; due to witnesses testifying that Martin was on top\n\nNot just witnesses.  The concrete-caused head wound is a certainty.  Ballistics assure 2-12\" range, and suggest strongly that the shot happened while Martin was on top of Zimmerman.  When the witness matches the story matches the evidence, it's usually what we call \"open and shut\".\n\nHonestly, I wish I knew what the prosecution was thinking when they pressed charges at all.  What did they know that they weren't allowed to present, or what did they think they knew that wasn't resolved in discovery?",
                    "author": "novagenesis",
                    "created_utc": 1373942111.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cb3han6",
            "parent_id": "t3_1idmwx",
            "body": "With or without media? I think the defining factor of the Not Guilty verdict was the magical by-the-book reaction to a case being highly covered.  When the cameras are watching, you don't bend rules... and the rules actually favor the defendant heavily. (better 10 guilty free than 1 innocent jailed).  \n\nIf Martin was white, the media probably wouldn't have been around (hillarious, because there's so much evidence and so many arguments that this was NOT a race-related crime.. unless you say that Martin's initiation was due to his racism against Zimmerman the \"creepy-ass cracker\" (his words).\n\n&gt; To be honest I really believe the real issue to this case is the fact that a dead teen was unable to give his side of the story. \n\nOf course it is... but Zimmerman's story fit the evidence... which suggested Zimmerman was on the ground on his back, firing at point blank range at Martin above him.  That alone reeks of reasonable doubt.  No media cameras and a shitty lawyer? Might not have won a case, but that would be a failure of Justice.\n\n&gt;  Had Trayvon been white we would have been more focused n fact that an unarmed teen was killed by an armed adult.\n\nAn armed adult who he had tackled, and who had just hit his head on concrete from the conflict.  It would take a spectacular prosecutor, a lazy judge, or a terrible defendant, to lose this case.  \n\nBut then, if Treyvon Martin had been white, there wouldn't be any protests, CMV.",
            "author": "novagenesis",
            "created_utc": 1373941837.0,
            "replies": []
        },
        {
            "name": "t1_cb3hoak",
            "parent_id": "t3_1idmwx",
            "body": "Have you seen the pictures of zimmerman after he shot trayvon? Looked like hell. Nothing was assumed, except by the prosecution in that they could get a conviction on an appeal to the heart.",
            "author": "shiav",
            "created_utc": 1373942878.0,
            "replies": []
        },
        {
            "name": "t1_cb3javy",
            "parent_id": "t3_1idmwx",
            "body": "No he would not have and here are the reasons why:\n\n1.  Location of the body\n\nTrevyon had been on the phone with his girlfriend all the way up until the time of the attack. Treyvon was intending to visit his mom's fiancee's house and according to his girlfriend, had reached his destination.  \n\nThe girlfriend then claims that here is where Zimmerman attacked while Zimmerman claims that Treyvon doubled back and went chasing after Zimmerman.\n\nNow, the body was found a good 100 ft or so away from Treyvon's mom's fiancee's house in the direction of Zimmerman's car.\n\nThis means that if Treyvon had reached his mom's fiancee's house, he wouldve had to double back and chase after Zimmerman to instigate the fight at the location where the body was found.\n\nThe location of the body is consistent with Zimmerman's story and is a very likely indicator that Treyvon started the attack.\n\nThis fact alone can acquit Zimmerman by simply claiming self defense.",
            "author": "Serang",
            "created_utc": 1373947479.0,
            "replies": []
        }
    ]
}