{
    "name": "t3_1v8eur",
    "title": "CeCe McDonald deserved the prison time, and is only being defended because of her gender , please CMV",
    "body": "From every account I've read, CeCe McDonald \n\n1. was defending herself from someone that hadnt physically attacked her\n2. Pulled a weapon from her bag\n3. stabbed the other guy in the chest with it\n4. told him she had stabbed him\n5. told the police she had stabbed him\n6. changed her mind afterwards\n\n\nAnd suddenly it seems she's a hero for no reason other than the fact that she's trans. Every post I can find on reddit seems to be talking about hate crimes against trans people and how courageous and intelligent and wonderful they are, and I'm not disputing any of that. But if I walked up to a black man and shouted \"nigger\" at him and he proceeded to pull out a gun and shoot me, would he be acquitted? I hardly think so. CeCe's conviction for second degree murder (wilful but not premeditated) seems to me to fit the bill perfectly here.\n\nI know there's a bigger question about cruel and unusual punishment from putting trans women in male prisons, and i'd prefer to steer clear of that if i may. I'm more interested to hear anyone actually justifying her actions as self defence on the night in question.\n\n\nOrrrrrrr am i just a big bigot :D\n\n\nEDIT: Easy on the attacks there people, i came here to have a view that there was blind, logic-lacking support going on and that emotion was dominating reason. The insults are doing the exact opposite.",
    "author": "ninety6days",
    "num_comments": 85,
    "created_utc": 1389744272.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1v8eur/cece_mcdonald_deserved_the_prison_time_and_is/",
    "comments": [
        {
            "name": "t1_cepre6f",
            "parent_id": "t3_1v8eur",
            "body": "&gt; was defending herself from someone that hadnt physically attacked her\n\nAccording to wikipedia at least, this is not accurate.\n\n&gt;&gt; Flaherty started a fight[9] by smashing a glass of alcohol against her face, cutting her[8] and requiring 11 stitches.[10]\n\nAnd you can see the image from the hospital [here](http://www.trutv.com/library/crime/blog/files/2012/08/cece-mcdonald-cut-face.jpg).\n\nNow it can still be debated whether such an attack warranted lethal force in response, but it's certainly important to note that he apparently started the physical altercation in any case.",
            "author": "ThePantsParty",
            "created_utc": 1389748347.0,
            "replies": [
                {
                    "name": "t1_ceprjui",
                    "parent_id": "t1_cepre6f",
                    "body": "Flaherty smashed the bottle, mcdonald stabbed **her boyfriend** to death. My statement remains accurate.",
                    "author": "ninety6days",
                    "created_utc": 1389748701.0,
                    "replies": [
                        {
                            "name": "t1_cepruzd",
                            "parent_id": "t1_ceprjui",
                            "body": "Ah, yeah, I mixed up the names.  My bad.  ",
                            "author": "ThePantsParty",
                            "created_utc": 1389749401.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_ceprovz",
                    "parent_id": "t1_cepre6f",
                    "body": "&gt;Now it can still be debated whether such an attack warranted lethal force in response\n\nactually, if I remember correctly, the fight had ended and cece had gone out to the parking lot and \"reengaged\"  the fight, which would make her legally responsible. \n\n",
                    "author": "CherrySlurpee",
                    "created_utc": 1389749026.0,
                    "replies": [
                        {
                            "name": "t1_cepsudn",
                            "parent_id": "t1_ceprovz",
                            "body": "CeCe was walking away; Dean was chasing her. Ran himself right onto a pair of scissors, if memory serves. ",
                            "author": "electricsouls",
                            "created_utc": 1389751589.0,
                            "replies": [
                                {
                                    "name": "t1_cept36m",
                                    "parent_id": "t1_cepsudn",
                                    "body": "&gt;  Gilbert recalled that McDonald appeared to be holding a blade, while Schmitz had his fists clenched and said to McDonald \"you gonna stab me, you bitch?\" Schmitz then hunched over,[5](p2) put his hand to his shirt and said \"you stabbed me,\" to which McDonald replied, according to a witness, \"Yes I did.\"[5](p2)[8] Schmitz was stabbed in the chest with a pair of scissors.[8\n\n&gt; McDonald was arrested and confessed to the stabbing, but in her letter from Hennepin County jail wrote that confessing was \"a big mistake [for] trying to cover up for one of my friends who actually did it. I didn't know exactly who, but I knew someone was defending me.\"[\n\nthats from the wikipedia article...looks like she's guilty. ",
                                    "author": "CherrySlurpee",
                                    "created_utc": 1389752131.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "name": "t1_cepx3y0",
                            "parent_id": "t1_ceprovz",
                            "body": "This would depend upon who actually reengaged, which does not equal who made first contact.  If Flaherty reasonably appeared to attack, then he reengaged and is responsible, even if he never managed to make an attack, due to the previous altercation.",
                            "author": "Lawtonfogle",
                            "created_utc": 1389761581.0,
                            "replies": [
                                {
                                    "name": "t1_cer0vlw",
                                    "parent_id": "t1_cepx3y0",
                                    "body": "Minor point: Flaherty was the dead dude's 'girlfriend', not the neo-Nazi himself. ",
                                    "author": "taavo_podolak",
                                    "created_utc": 1389882628.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cept47g",
            "parent_id": "t3_1v8eur",
            "body": "Well now, let's make your analogy accurate. Say you're a proud racist with multiple convictions for assault. You and a bunch of your white friends are hanging out when you see a group of black trans women and start harassing them, first verbally, then physically. One of them, already injured, tries to get away and you chase her down. In the ensuing fight, you get stabbed. Is that second-degree murder or self-defense?  ",
            "author": "electricsouls",
            "created_utc": 1389752195.0,
            "replies": [
                {
                    "name": "t1_ceq2o40",
                    "parent_id": "t1_cept47g",
                    "body": "Well that depends. Did I chase her down or did she come back outside after getting a weapon and stab me? Because all the rest is somebody else's trial.\n\nEDIT : for the record, your attempt to colour the facts with first previous crimes of the dead and then with race is exactly what i have a problem with here. Look at the facts and drop the emotion, otherwise there's no jsutice.",
                    "author": "ninety6days",
                    "created_utc": 1389787076.0,
                    "replies": [
                        {
                            "name": "t1_cer0b9j",
                            "parent_id": "t1_ceq2o40",
                            "body": "If you don't think the *fact* that the dead dude was a racist with swastika tattoos and a history of trying to beat the shit out of people was relevant, why post this CMV in the first place?  ",
                            "author": "electricsouls",
                            "created_utc": 1389880708.0,
                            "replies": [
                                {
                                    "name": "t1_cer0erh",
                                    "parent_id": "t1_cer0b9j",
                                    "body": "I'm talking about facts relevant to the act that the defendant was on trial for. ",
                                    "author": "ninety6days",
                                    "created_utc": 1389881062.0,
                                    "replies": [
                                        {
                                            "name": "t1_cer0nnr",
                                            "parent_id": "t1_cer0erh",
                                            "body": "If you don't think that's relevant when he died during an unprovoked attack on a black trans woman, I'm not sure what to say to you. ",
                                            "author": "electricsouls",
                                            "created_utc": 1389881916.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cer1ndh",
                                                    "parent_id": "t1_cer0nnr",
                                                    "body": "If you don't see that i'm trying to examine facts dispassionately and as objectively as possible, then we're at an impasse.",
                                                    "author": "ninety6days",
                                                    "created_utc": 1389884923.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "name": "t1_cer0tnf",
                                            "parent_id": "t1_cer0erh",
                                            "body": "Oh please. She's a black trans woman who killed a guy who was chasing her down. When that guy has swastika tattoos, prior convictions for assault *and* was clearly the instigator, how are those facts irrelevant? ",
                                            "author": "taavo_podolak",
                                            "created_utc": 1389882458.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cer1ns1",
                                                    "parent_id": "t1_cer0tnf",
                                                    "body": "Stop \"oh please' ing me, it's rude and unnecessary. Those facts are irrelevant to her actions, They colour the story with emotion as opposed to information.",
                                                    "author": "ninety6days",
                                                    "created_utc": 1389884957.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cequ6cu",
            "parent_id": "t3_1v8eur",
            "body": "Oh give me a break.  She stabbed him with a pair of scissors.  And it was helped along by his body weight, because he was either lunging at her or \"moving swiftly in her direction\" (if you're the prosecution, who managed to get a lot of amazing things in there).\n\nSo lets go for the facts.  Cece McDonald had her face cut open and then was charged by a neo-nazi with a history of violent abuse of women (who also happened to be high on meth at the time)  .  He got stabbed and died.  \n\nThat's the most clearcut case of self-defense ever.  If she'd been cisgender I doubt this would have been an issue.  If she'd been white and cisgender no one would have prosecuted.  If she'd been white, cisgender and shot him, she'd have been a national hero and the Republican party would probably be having a parade for her.",
            "author": "RobertK1",
            "created_utc": 1389851235.0,
            "replies": [
                {
                    "name": "t1_ceqx69p",
                    "parent_id": "t1_cequ6cu",
                    "body": "No no, he didn't break the bottle off her. That was his girlfriend. And again, stop trying to colour the facts with peoples history. She went and got a weapon and stabbed a man to death, after the attack on her by somebody else had ended.",
                    "author": "ninety6days",
                    "created_utc": 1389863151.0,
                    "replies": [
                        {
                            "name": "t1_ceqz9iu",
                            "parent_id": "t1_ceqx69p",
                            "body": "I didn't say he did.  I did say she had her face cut open.\n\nShe was bleeding from the face, and he followed her after she left the scene (she did not follow him).  He the lunged at her.   Scissors, by the by, not a very effective stabbing weapon.  It helps to have 250 lbs of angry wife-beating neonazi lunging at you to give them real penetrating power.\n\nAs I said, if she'd been a cisgender white woman who had shot him with a gun, there'd be nightly segments on Fox News about the injustice and people would be buying her artwork for $100,000 and stuff.",
                            "author": "RobertK1",
                            "created_utc": 1389876221.0,
                            "replies": [
                                {
                                    "name": "t1_ceqzwux",
                                    "parent_id": "t1_ceqz9iu",
                                    "body": "&gt; angry wife-beating neonazi\n\nAgain with the sensationalising. It's not relevant to the FACTS. What you're doing here is no better than Fox News.",
                                    "author": "ninety6days",
                                    "created_utc": 1389879195.0,
                                    "replies": [
                                        {
                                            "name": "t1_cer0awo",
                                            "parent_id": "t1_ceqzwux",
                                            "body": "Okay.  The facts are then, that this man followed her.  He was, as shown by his criminal record, both capable of beating women and someone who indulged in it frequently.  He subscribed to an ideology that believes that all black people should be rounded up and systemically murdered (along with Jews and homosexuals).\n\nIn short, when he followed her Cece had every rational, logical reason to believe, anticipate and expect that he would maim and kill her.  He lunged at her.  He died from a pair of fucking scissors (not exactly very good murder weapons).  \n\nThat's called self-defense.\n\nI wonder which of the two of us has been listening to Fox...",
                                            "author": "RobertK1",
                                            "created_utc": 1389880671.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cer0f8n",
                                                    "parent_id": "t1_cer0awo",
                                                    "body": "Not me my friend. I'm about 6000 miles too far east. \n\nIf he followed her in it might be self defence alright, but surely you can see what i'm getting at in the OP? That there's an awful lot of \"supporting the team\" going on?",
                                                    "author": "ninety6days",
                                                    "created_utc": 1389881111.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cer0pko",
                                                            "parent_id": "t1_cer0f8n",
                                                            "body": "Well, when you can beat a black trans woman to death in front of a police station and get away with it, the team could probably use some support, no?",
                                                            "author": "electricsouls",
                                                            "created_utc": 1389882092.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cer1mzk",
                                                                    "parent_id": "t1_cer0pko",
                                                                    "body": "So that makes everything the team does ok, just because they get it bad? You know that's a school of logic that says \"it's ok to kill people we don't like\", and is the exact problem that you're trying to rail against, right?\n",
                                                                    "author": "ninety6days",
                                                                    "created_utc": 1389884894.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_cer1v34",
                                                                            "parent_id": "t1_cer1mzk",
                                                                            "body": "No. It highlights the fact that trans women of colour are considered disposable and can be killed with no repercussions.  Kind of relevant to the case...",
                                                                            "author": "electricsouls",
                                                                            "created_utc": 1389885521.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_cer1wv1",
                                                                                    "parent_id": "t1_cer1v34",
                                                                                    "body": "And yet you're talking about nazis as disposable, and can be killed because of who they are, regardless of legality.",
                                                                                    "author": "ninety6days",
                                                                                    "created_utc": 1389885650.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "name": "t1_cer0wl1",
                                                            "parent_id": "t1_cer0f8n",
                                                            "body": "No actually, I don't see that.  I see people supporting a woman who defended herself from a literal Nazi, I see people condemning a justice system where the Prosecutor and Judge conspired to withhold every relevant detail regarding the person who attacked her (including the fact that he was violent and belonged to an organization that professes to wish to kill all non-Aryans).  I see condemnation of a Judge who ordered the Jury not to consider it self-defense, because scissors were a \"weapon\" and refused to consider that weapons were already used (the broken bottle).  Oh, and declined to prosecute the woman who sliced CeCe's face open.  \n\nThat's what I see. ",
                                                            "author": "RobertK1",
                                                            "created_utc": 1389882715.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cer1o8f",
                                                                    "parent_id": "t1_cer0wl1",
                                                                    "body": "All that being said, do you not consider \"it's ok to kill him because he's a nazi\" dangerously close to \"it's ok to kill her because she's trans\" ?",
                                                                    "author": "ninety6days",
                                                                    "created_utc": 1389884993.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_cer1tir",
                                                                            "parent_id": "t1_cer1o8f",
                                                                            "body": "Do you genuinely see being trans as equivalent to espousing a racist political ideology whose basis is the extermination of \"non-Aryans\"? ",
                                                                            "author": "electricsouls",
                                                                            "created_utc": 1389885403.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_cer1win",
                                                                                    "parent_id": "t1_cer1tir",
                                                                                    "body": "No, but i see murder as murder, regardless of who's being killed?",
                                                                                    "author": "ninety6days",
                                                                                    "created_utc": 1389885627.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "name": "t1_cer5qba",
                                                                            "parent_id": "t1_cer1o8f",
                                                                            "body": "It's okay to kill a guy who followed you after a violent confrontation and is now charging (or \"moving quickly at\") you with the obvious capacity to do violence (which it's clear he had done many, many times before).  \n\nIf a trans man or woman had actually done that, yes, it would be okay to kill them in self-defense too.  The point was that this was not a Quaker or a Buddhist Monk she killed, this was a man who subscribed to a violent ideology, was displaying symbols associated with the murder of black people and trans people, and was most certainly capable of great violence.  \n\nAnd yes, your self-defense plea is usually more likely to be taken seriously if you kill a Nazi who is stalking you than if you kill a Buddhist who is busy meditating.",
                                                                            "author": "RobertK1",
                                                                            "created_utc": 1389894489.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_cer9bme",
                                                                                    "parent_id": "t1_cer5qba",
                                                                                    "body": "&gt;And yes, your self-defense plea is usually more likely to be taken seriously if you kill a Nazi who is stalking you than if you kill a Buddhist who is busy meditating.\n\nMy concern is still about the reports (conflicting though they may be) that say she spoke to him while holding the scissors before stabbing him. It's a pretty fine line of self defence, no?",
                                                                                    "author": "ninety6days",
                                                                                    "created_utc": 1389901888.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "name": "t1_cfweuk4",
                                            "parent_id": "t1_ceqzwux",
                                            "body": "[deleted]",
                                            "author": "[deleted]",
                                            "created_utc": 1394161407.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cfwk9jb",
                                                    "parent_id": "t1_cfweuk4",
                                                    "body": "&gt;Nazi fuck\n\n&gt;faggot\n\n\n\nHa. ",
                                                    "author": "ninety6days",
                                                    "created_utc": 1394176550.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cer1d46",
            "parent_id": "t3_1v8eur",
            "body": "It's also interesting to note that you make no mention of the fact that the cops refused to allow CeCe to have her facial wound treated until she'd 'confessed', but then again, your 'sources' probably also didn't mention the fact that Flaherty glassed her for eleven stitches and lacerated one of her salivary glands in the process...",
            "author": "electricsouls",
            "created_utc": 1389884113.0,
            "replies": [
                {
                    "name": "t1_cer1paq",
                    "parent_id": "t1_cer1d46",
                    "body": "Don't try and invalidate \"my sources\", i never claimed any insight beyond what i've read online - just like you. I wasn't aware that the treatment was refused, no. I'm trying to learn here, not preach. And yet, unsurprisingly, i'm being fucking vilified left right and centre.\n\nThe confession was recanted later, too. If we're going to go down the road of invalidating one side's version because of their history, can we talk about witness credibility when confessions go back and forth?",
                    "author": "ninety6days",
                    "created_utc": 1389885077.0,
                    "replies": [
                        {
                            "name": "t1_cer1xlw",
                            "parent_id": "t1_cer1paq",
                            "body": "Cops wouldn't let her get treatment until she confessed. Does that look like coercion to you? \n\n...Actually, it would probably help if you edited your post to link what you've read about the case so that readers have an idea of what you've been told.\n\nEDIT: I a word.",
                            "author": "electricsouls",
                            "created_utc": 1389885705.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cer3x2w",
            "parent_id": "t3_1v8eur",
            "body": "Odd that you should talk about \"blind support\" when you don't seem willing to tell us where you're getting your information (which seems suspiciously scanty).",
            "author": "taavo_podolak",
            "created_utc": 1389890514.0,
            "replies": [
                {
                    "name": "t1_cer45hi",
                    "parent_id": "t1_cer3x2w",
                    "body": "honestly, i searched reddit for her name and hit the first ten links i could find. also the wiki page, which is quoted below, paints a pretty clear picture.",
                    "author": "ninety6days",
                    "created_utc": 1389891027.0,
                    "replies": [
                        {
                            "name": "t1_cer46v4",
                            "parent_id": "t1_cer45hi",
                            "body": "That's not very specific at all. What sites besides wikipedia did you use? You know, it helps to be clear about this sort of thing.",
                            "author": "taavo_podolak",
                            "created_utc": 1389891112.0,
                            "replies": [
                                {
                                    "name": "t1_cer49ut",
                                    "parent_id": "t1_cer46v4",
                                    "body": "You're right on this part, I should have started with links but to be honest i'm picking more and more info as this thread goes on which makes it difficult. It's also kinda why i asked the question in the first place.",
                                    "author": "ninety6days",
                                    "created_utc": 1389891294.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}