{
    "name": "t3_1kforh",
    "title": "I believe that Golum/Smegal was not necessary to destroy the ring at Mt. Doom after Frodo and Sam made it into Mordor. CMV.",
    "body": "The basic assumption of the events at Mt. Doom is that, without the physical struggle between Frodo and Golum which results in the rings accidental destruction, no one would be able to summon the will power to throw the ring in-- and therefore some people claim that Golum is a hero too.\n\nI disagree.\n\nFirstly, only two people have ever tried to throw the ring into Mt. Doom and failed. From this it is commonly extrapolated that *no one* is capable of throwing the ring in intentionally, but I do not believe these two instances are proof of that.\n\nIn the first instance, the ring is *fresh off* of Sauron, and falls into the hands of 'an easily corrupted' human. I feel these two points are enough to cast doubt on this instance supporting the \"inability of anyone\" to directly destroy the ring, clearly the cards where stacked against us here.\n\nIn the second case, Frodo is a less easily corrupted Hobbit, but has had the ring for months. Even so, I believe *without* Golum, Frodo would have been able to destroy the ring himself. While climbing Mt. Doom, Frodo loses all strength and is unable to even move. Samwise heroically carries Frodo on his shoulders-- Then Golum intervenes, starting a fight with Sam. \n\nThis is the crucial moment. As the fight starts, Frodo summons a burst of willpower to propel himself the rest of the way up the mountain and to the edge of the fires of Mt. Doom. I believe that this burst of will would have been sufficient to cast the ring into the fire, if it had not been spent making it up the mountain.\n\nIf that burst of will was insufficient to cast the ring into the fire, I believe it would have at least staved off Frodo's total corruption, allowing Sam to acquire the ring in a state on near-zero corruption, and effortlessly throw the ring into the fire.\n\nWe have seen that the ring's power over individual people varies, and that exposure time is important. Given these factors, I believe that, while Golum's intervention worked out in the end, had he not followed the Hobbit's to Mt. Doom they would have managed to destroy the ring anyway. CMV.",
    "author": "Dr_Wreck",
    "num_comments": 22,
    "created_utc": 1376592584.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1kforh/i_believe_that_golumsmegal_was_not_necessary_to/",
    "comments": [
        {
            "name": "t1_cbogfez",
            "parent_id": "t3_1kforh",
            "body": "I don't think that time of exposure is the only factor, but also the proximity to Mordor, and more specifically, Mt Doom, where the ring was created. As the point of creation for the ring, it's influence becomes more pronounced there. I may be mistaken with the sequence of events here, but I don't believe Isildur was in possession of the ring for very long before he succumbed to it's influence and refused to throw it in. I suspect if Sam had picked up the ring at top of Mt Doom, he would have had just as much trouble throwing it in as Frodo. ",
            "author": "Amablue",
            "created_utc": 1376593160.0,
            "replies": [
                {
                    "name": "t1_cbogii7",
                    "parent_id": "t1_cbogfez",
                    "body": "Isildur had to walk from the battlefield in the Black Marshes(or whereever they cut off the finger, I'm fuzzy on details) to Mt. Doom-- for an 'easily corrupted human', and with the ring's inscription still glowing red hot from Sauron's finger-- I think it's reasonable to say that he was fully corrupted by the time he reached Mt. Doom.\n\nProximity to Mt. Doom makes sense-- But Frodo spends a not inconsiderable deal of time there before becoming so corrupted that he no longer desires to throw the ring in, I think a 'fresh' Sam still had the capacity to toss it, so long as Frodo still had the willpower to give it up.",
                    "author": "Dr_Wreck",
                    "created_utc": 1376593369.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cbogk1v",
            "parent_id": "t3_1kforh",
            "body": "Tolkein directly addressed this sort of point in his letters.\n\n&gt;Frodo deserved all honor because he spent every drop of his power of will and body, and that was just sufficient to bring him to the destined point, and no further. Few others, perhaps no others of his time would have got so far. Letter 192.\n\n&gt;\"The power of the ring would reach its maximum - impossible, I should say, for anyone to resist, especially after long possession, months of increasing torment, and when starved and exhausted.\" Letter 246\n\nhttp://www.americanidea.org/handouts/06240110.htm\n\n&gt;'If you re-read all the passages dealing with Frodo and the Ring, I think you will see that not only was it quite impossible for him to surrender the Ring, in act or will, especially at its point of maximum power, but that this failure was adumbrated from far back.' 191\n\nSo it's quite possible that no one else would be strong willed enough to bring the ring to the mountain (though in the past individuals who could existed) and he was likely the most strong willed of the people nearby. The taxing journey would have also severely weakened people's ability to destroy it. Frodo had long since been corrupted and it would have never been possible for him to destroy it, even with a burst of will.\n\nAs to whether Sam could have done it. \n\n&gt;\"Wild fantasies arose in his mind; and he saw Samwise the Strong, Hero of the Age, striding with a flaming sword across the darkened land, and armies flocking to his call as he marched to the overthrow of Barad-dur. And then all the clouds rolled away, and the white sun shone, and at his command the vale of Gorgoroth became a garden of flowers and trees and brought forth fruit. He had only to put on the Ring and claim it for his own, and all this could be\"\n\nSam was also being corrupted. I don't know if he'd have been able to throw it in. \n\n&gt;'No, not everything, Mr. Frodo. And it hasn't failed, not yet. I took it, Mr. Frodo, begging your pardon. And I've kept it safe. It's round my neck now, and a terrible burden it is, too.' Sam fumbled for the Ring and its chain. 'But I suppose you must take it back.' Now it had come to it, Sam felt reluctant to give up the Ring and burden his master with it again.\n\n&gt;'You've got it?' gasped Frodo. 'You've got it here? Sam you're a marvel!' Then quickly and strangely his tone changed. 'Give it to me!' he cried, standing up, holding out a trembling hand. 'Give it me at once! You can't have it!'\n\n&gt;'All right, Mr. Frodo,' said Sam, rather startled. 'Here it is!' Slowly he drew the Ring out and passed the chain over his head. 'But you're in the land of Mordor now, sir; and when you get out, you'll see the Firey Mountain and all. You'll find the Ring very dangerous now, and very hard to bear. If it's too hard a job, I could share it with you, maybe?'\n\nHe already found it very hard to hand it over.",
            "author": "Nepene",
            "created_utc": 1376593473.0,
            "replies": [
                {
                    "name": "t1_cbognd1",
                    "parent_id": "t1_cbogk1v",
                    "body": "No one showed to be totally immune-- But several resisted the ring's corruption from varying proximities for varying times. Faramir ultimately resists the same corruption that Boromir couldn't-- Sam carries the ring for some time and willingly returns it to Frodo--\n\nI think the very fantasy of Samwise being this great conqueror is the Ring's Stock corruption gambit, but it's really out of Sam's character. I doubt he was considerably tempted by that fantasy, even if he was a little. ",
                    "author": "Dr_Wreck",
                    "created_utc": 1376593693.0,
                    "replies": [
                        {
                            "name": "t1_cboi3fp",
                            "parent_id": "t1_cbognd1",
                            "body": "People resisted the ring's corruption temporarily, but it takes a huge amount of willpower to actively destroy the ring. It makes you work harder in the end stages.\n\nYour first point though, that Frodo could have destroyed the ring with his burst of willpower is clearly false. Tolkein said that he had long since been corrupted.\n\n &gt;'If you re-read all the passages dealing with Frodo and the Ring, I think you will see that not only was it quite impossible for him to surrender the Ring, in act or will, especially at its point of maximum power, but that this failure was adumbrated from far back.' 191\n\nI edited that in some time ago, but I don't know if you read it.\n\nOn Sam's fantasy, it presents him as a mighty gardener. He loved gardening, so those were the fantasies it used. He brings greenery to all the black places and achieves greatness. ",
                            "author": "Nepene",
                            "created_utc": 1376597222.0,
                            "replies": [
                                {
                                    "name": "t1_cboi4lx",
                                    "parent_id": "t1_cboi3fp",
                                    "body": "The passage you edited in clearly uses language which show's sam's only hesitation was out of compassion for Frodo and not out of temptation through the ring.",
                                    "author": "Dr_Wreck",
                                    "created_utc": 1376597300.0,
                                    "replies": [
                                        {
                                            "name": "t1_cboib78",
                                            "parent_id": "t1_cboi4lx",
                                            "body": "I interpreted the passage differently, that Sam had a subconscious desire to keep it and the ring was influencing him.\n\nThe other passage definitely shows the ring had influenced Sam.\n\nAnyway, I think you saying he was uncorrupted by the ring is hard to substantiate. Sam was weaker in will than Frodo, as Tolkein said, and he was starving and tortured and had already been partially corrupted. Even if you don't accept the above passage as proof of his corruption, the fact that he had a fantasy is proof. If he had got the ring he may have not been able to resist it. Having Golum there was very helpful.",
                                            "author": "Nepene",
                                            "created_utc": 1376597745.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cboifpa",
                                                    "parent_id": "t1_cboib78",
                                                    "body": "I would call Sam tempted, at best. Corrupted, not so much. Not yet-- And his overriding desire to protect Frodo, which is the only temptation to keep the ring that the ring could give him-- would override the Ring's temptation and let him destroy it.",
                                                    "author": "Dr_Wreck",
                                                    "created_utc": 1376598052.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cboiu19",
                                                            "parent_id": "t1_cboifpa",
                                                            "body": "1. Frodo wouldn't have surrendered the ring willingly. Sam would have likely had to kill him.\n\n2. Sam had worn the ring briefly, which would have likely corrupted him.\n\nAnyway, if he had tried it what I suspect would happen would be that Frodo would have put in the ring and fought with him, likely killing Sam as Sam wouldn't be willing to take the steps to win but Frodo would. Then he would have tried to escape until Sauron found him and took it, regaining his power.\n\nI suppose there's some small chance that Sam would have succeeded, but it's hardly certain.",
                                                            "author": "Nepene",
                                                            "created_utc": 1376599024.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_cbokb6z",
                            "parent_id": "t1_cbognd1",
                            "body": "&gt;No one showed to be totally immune\n\nTom Bombadil was portrayed to be",
                            "author": "Dr_Dippy",
                            "created_utc": 1376602823.0,
                            "replies": [
                                {
                                    "name": "t1_cbomaor",
                                    "parent_id": "t1_cbokb6z",
                                    "body": "True fact, but he is some form of higher order being-- there are theories that he's a god and the like-- so he doesn't really contribute to the hypothetical discussion on the ring's affects on mortals. ",
                                    "author": "Dr_Wreck",
                                    "created_utc": 1376608341.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cbogp6e",
            "parent_id": "t3_1kforh",
            "body": "When's the last time you saw the movie or read the book? In the movie, Frodo succumbed to the power of the Ring at the last second and put it on to escape Sam's intervention. If Gollum hadn't attacked Frodo, he would've just waltzed out into the world and Sauron would've likely gotten the ring from him. Sam was at his physical limits at that point and couldn't see Frodo to stop him. He was in no way prepared to take Frodo down like Gollum was. ",
            "author": "videoninja",
            "created_utc": 1376593817.0,
            "replies": [
                {
                    "name": "t1_cbogq70",
                    "parent_id": "t1_cbogp6e",
                    "body": "You didn't read my post all the way through.",
                    "author": "Dr_Wreck",
                    "created_utc": 1376593890.0,
                    "replies": [
                        {
                            "name": "t1_cboh50f",
                            "parent_id": "t1_cbogq70",
                            "body": "Maybe I misunderstood it? From what I gathered you were saying Frodo would've had the willpower to destroy the Ring on his own but there's no real evidence of that. You're going on to say even if Frodo didn't Sam would've been able to wrest it from him but that didn't happen either (at least in the movie). \n\nGollum hadn't even attacked at the point of Frodo putting the Ring on and turning away from his goal. Frodo literally failed at that point and Sam showed no initiative or ability to get the Ring back because he was emotionally and physically shattered at that point in the story. \n\nNow the reason I'm focusing on the movie is that's where Gollum's intervention actually does have more weight. In the books, Gollum bites the ring off Frodo's hand and falls into Mount Doom as an \"oopsie!\" moment of clumsiness. There was no physical struggle over ownership of the Ring post-biting. ",
                            "author": "videoninja",
                            "created_utc": 1376594896.0,
                            "replies": [
                                {
                                    "name": "t1_cboi8d2",
                                    "parent_id": "t1_cboh50f",
                                    "body": "&gt; Gollum hadn't even attacked at the point of Frodo putting the Ring on and turning away from his goal.\n\nSo it's *you* who hasn't seen the movie or read the book in awhile. Golum attacks them on the mountain and it is what separates Frodo and Sam in the first place. The entire situation you describe them in only occurs because of Golum, hence the hypothetical. \n\nYou may have misunderstood my post but it's fairly straightforward.",
                                    "author": "Dr_Wreck",
                                    "created_utc": 1376597553.0,
                                    "replies": [
                                        {
                                            "name": "t1_cboisgm",
                                            "parent_id": "t1_cboi8d2",
                                            "body": "Admittedly it's been a while since I've seen the movie, so I did forget about Gollum's first attack outside the chasm. That still doesn't change much of what happened. Frodo still would have likely put the ring on and left Sam. Until that point, Frodo was already cracking at the seams and Sam wasn't holding up well either. \n\nIf Sam's energies weren't spent fighting Gollum, it would have been spent hauling Frodo up. Also, the speculative willpower Frodo may or may not have had is kind of immaterial. If anything, the Ring had proven that its power to survive was strengthened at Mount Doom as it easily corrupted others. \n\nTolkien is even on record saying Frodo could not have given the Ring up at that point. In one of his letters he even said it was his intent to show  \"the power of Evil in the world is not finally resistible by incarnate creatures, however 'good'\". ",
                                            "author": "videoninja",
                                            "created_utc": 1376598913.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cboh71d",
            "parent_id": "t3_1kforh",
            "body": "Gollum's tale is one of power corrupting and eventually causing its own self-destruction. While the tale might have worked without his intervention at the end, it's important for *his* arc, not just the hobbits'. His greed for the ring eventually led to the ring's destruction and his own.",
            "author": "siosilvar",
            "created_utc": 1376595032.0,
            "replies": [
                {
                    "name": "t1_cboi528",
                    "parent_id": "t1_cboh71d",
                    "body": "I'm not talking about this from a literary standpoint, I'm talking about this from a practical standpoint. ",
                    "author": "Dr_Wreck",
                    "created_utc": 1376597329.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cboihao",
            "parent_id": "t3_1kforh",
            "body": "I think you might be missing the point of that part of the story.  The point isn't that fake magic trumps willpower--it's about the toll that an unhealthy obsession or addiction can take on someone.  Gollum's involvement in the destruction of the ring was needed from a *storytelling* point of view.\n\nThe point of including Gollum in the story, and the point of his presence at Mt. Doom, was to show the end result of an obsession with the ring.  Smeagal started out a decent enough hobbit, but by the time Bilbo and Frodo came around, he was a pathetic monster, all because of his obsession with the ring.  His obsession had destroyed everything good and worthwhile about him, and left him a husk of his former self, with no joy and no purpose aside from his greed and obsession.  It had figuratively destroyed him, and then at the end, it *literally* destroyed him.  \n\nSo a discussion of whether Frodo or Sam or an abstraction of a completely uncorrupted individual could or could not have done it themselves under different circumstances sort-of misses the point, I think.  The point was to show the corruption, and the effects it has on individuals at different levels of exposure.  ",
            "author": "spiffyzha",
            "created_utc": 1376598157.0,
            "replies": [
                {
                    "name": "t1_cboijnf",
                    "parent_id": "t1_cboihao",
                    "body": "No, you miss the point. Obviously everything in a book has a literary significance. This is a discussion about cannon and hypotheticals. ",
                    "author": "Dr_Wreck",
                    "created_utc": 1376598314.0,
                    "replies": []
                },
                {
                    "name": "t1_cbq1aex",
                    "parent_id": "t1_cboihao",
                    "body": "Tolkien would adamantly deny his novels lend themselves to allegory. It seems questionable to apply unintended symbolism to answer a concrete question about the lore, whether you do or don't accept the author's ownership of symbolic content in his storytelling.",
                    "author": "ammicha",
                    "created_utc": 1376796400.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cbp7hcg",
            "parent_id": "t3_1kforh",
            "body": "It should be noted that the ring is a symbol of state power(http://disinfo.com/2012/12/the-hobbit-as-anarchist-anti-state-manifesto/)\n\nSo the question how the ring can be destroyed is a question of how can state power be destroyed; is it destroyed by good leaders freeing their subjects or is it by mismanagement and outside forces? ",
            "author": "monkyyy",
            "created_utc": 1376682756.0,
            "replies": []
        }
    ]
}