{
    "name": "t3_1ibg1p",
    "title": "I don't think the Trayvon Martin case was racist at all. CMV",
    "body": "For me, the case was just a guy (who happened to be white), spotted a suspicious guy (who happened to be black). They cross paths, a misunderstanding occurs, and one ends up dead during a fight. Personally, I think Zimmerman would have done the same (ie following someone) for ANY person who looked suspicious. I also don't think the outcome of the case was racist either, since it was done in self defense, especially considering the injuries Zimmerman sustained. When all was said and done... yeah it's sad a teenager died, but I don't think there were any racial overtones at all. \n\nCMV, please. ",
    "author": "throwaway86753098675",
    "num_comments": 10,
    "created_utc": 1373860112.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1ibg1p/i_dont_think_the_trayvon_martin_case_was_racist/",
    "comments": [
        {
            "name": "t1_cb2vb6v",
            "parent_id": "t3_1ibg1p",
            "body": "The part that is in question is the \"looked suspicious.\"  Did trayvon being black have anything to do with him \"looking suspicious\".  So my first question is do you think there is a sentiment in our culture that feels that black people look/are more suspicious? You can look at the driving while black phenomenon for more detail on this point.  \n\nAlso, You did not mention this but there is also issue of the actions of the police.  Some argue that if Zimmerman was black and shot a white man, he would have been arrested.  It is hard to get any traction with this argument because what can be made of a woulda, shoulda, coulda,point without an actual example. ",
            "author": "Get72ready",
            "created_utc": 1373864675.0,
            "replies": [
                {
                    "name": "t1_cb2z73i",
                    "parent_id": "t1_cb2vb6v",
                    "body": "I think some analysis of Zimmerman's character needs to occur, so that we can gain a view into his personality and make an assessment over whether he felt Martin was suspicious because he was black.\n\n* Hispanic male who had been a victim of racial hatred in the past.\n* Has black roots, an afro-peruvian great-grandfather.\n* Run a business with a black business partner, whose family stayed at his house after a burglary.\n* Led an inquiry regarding the beating of a black homeless male, against a mostly white Sanford police department, publicly criticizing their procedure - Which led to the resignation of the police chief.\n\nAnd then put that person in the context:\n\n*Living in a gated community (with 20% of residents being black) which had been burglarized repeatedly by black assailants who consistently fled before the police could arrive.\n*Was neighborhood watch captain of that community, and was expected to keep an eye on activity he viewed as suspicious.\n*Never approached Martin, court evidence corroborated that although Martin became aware of Zimmerman's presence, he ran away. Later turning back away from his destination to confront Zimmerman, who moving away returning to his car.\n\nBecause yes, I believe that there is a sentiment in our culture that feels black individuals look/are more suspicious. And yes, I also feel that if Zimmerman were black, the law would have treated him differently. And both are race issues that affect America...\n\n... But does it affect the case itself? And is it ever right to factor in an individuals race into assessing the potential of them being suspicious? (No, I don't believe it is), is it human? (I think it may be to some extent, but this explains rather than justifies), and was it a factor of how Zimmerman assessed the situation?",
                    "author": "BlinkingZeroes",
                    "created_utc": 1373887010.0,
                    "replies": [
                        {
                            "name": "t1_cb2zhvu",
                            "parent_id": "t1_cb2z73i",
                            "body": "&gt;But does it affect the case itself?\n\nOnly with regard to the 2nd degree murder charge, It would be necessary to show anger toward Martin, race could be used as that motivator. \n\n&gt;Hispanic male who had been a victim of racial hatred in the past.\nHas black roots, an afro-peruvian great-grandfather.\nRun a business with a black business partner, whose family stayed at his house after a burglary.\nLed an inquiry regarding the beating of a black homeless male, against a mostly white Sanford police department, publicly criticizing their procedure - Which led to the resignation of the police chief.\n\nI think Zimmerman's view of any black out of the context is largely (not completely) irrelevant.  How does he feel about young black males on the streets of his neighborhood?, that is relevant. It is easy to make exceptions, exclusive or inclusive. \"my business partner is not like those other guys\" or \"these punks on the streets are not like my business partner.\" \n\n&gt;was it a factor of how Zimmerman assessed the situation?\n\nif the burglars are known to be black then it should have been a factor for Zimmerman otherwise he is an exceptionally poor detective.  \n",
                            "author": "Get72ready",
                            "created_utc": 1373889192.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cb32c0k",
                    "parent_id": "t1_cb2vb6v",
                    "body": "I am not sure if Martin's race had anything to do with \"looking suspicious.\" He looked like he didn't belong is all. \n\nYeah but see, I don't think the police were exactly wrong to not arrest Zimmerman. His injuries supported his self defense story (and I think they still do). ",
                    "author": "throwaway86753098675",
                    "created_utc": 1373901032.0,
                    "replies": []
                },
                {
                    "name": "t1_cb3ecr8",
                    "parent_id": "t1_cb2vb6v",
                    "body": "&gt; The part that is in question is the \"looked suspicious.\" Did trayvon being black have anything to do with him \"looking suspicious\". \n\nIf we believe Zimmerman's statements, and the police as well as a jury found no apparent reason not to, Zimmerman did not know Martin's race when he began following him. What attracted Zimmerman's attention was a man wearing a hood walking between houses at night, in a neighborhood that had been troubled by burglaries.\n\nLets put this another way. Is there any actual evidence to suggest that Zimmerman is a racist? This seems to be an assertion that's being made between the lines without any real support. \n\n&gt;So my first question is do you think there is a sentiment in our culture that feels that black people look/are more suspicious?\n\nSadly, yes. I'd say it's conditional: an older, clean-cut black man wearing a suit? No. A young black man wearing certain kinds of fashion, sporting tattoos and gold teeth? Yes. Is that racist? I'd argue no. Is it a form of prejudice? That's arguable - clothing and manner of dress are used for a variety of reasons, but one being to signify a certain set of beliefs and values, an adherence to a certain social \"code\". \n\nThe fact is that inner city/ghetto culture in this country has rightfully earned a reputation for thuggish behavior. It isn't George Zimmerman's fault that if you open a hip-hop club in a city, even in a nice neighborhood, you have to pay for ten times more security and still deal with a higher frequency of fights and gang activity. That's just a fact, and we can either own up to it and figure out how to deal with it, or we can go off into some hippie-dippy la-la land of ignorant political correctness. It isn't a matter of skin color, it's a matter of cultural mores and values promulgated by different quarters of society. But it is an important matter that needs to be addressed: the epidemic of violence in the inner city is claiming a lot of lives, and costing a lot more their livelihoods. If we really care about our children and our countrymen, we will summon up the courage to stop looking for scapegoats and face up to this serious problem. Trayvon Martin, who by all accounts knocked a guy onto the ground and then continued beating him mercilessly, is a sad victim of this culture, as are *so many* young black men and women. Look at the homicide rates in Chicago, look at the faces of the victims. Look at the perpetrators... it's not a bunch of George Zimmermans.\n\nI feel tremendous sympathy for the kid's family. I feel tremendous sympathy for the kid himself... he could be so many kids I grew up with, called friend, ate dinner with. We've all made mistakes, and you and I, dear reader, are still here to talk about it, able to learn from them and carry on with our lives. Sadly, Trayvon isn't still with us, and will never have that opportunity to learn from mistakes. He didn't deserve that fate. \n\nBut the reality is that George Zimmerman is not ultimately to blame for his fate... George Zimmerman had no other choice, if we take a rational reading of events. Anyone who says they would passively lay there and let themselves be pinned to the ground and beaten into unconsciousness or worse on the street is either lying or hopelessly naive, and probably both. What's to blame for Trayvon's fate is a culture that teaches our young men that they are not men unless they solve their problems with violence, that respect is synonymous with beating people up, and using your words and your head instead of your fists is cowardly, and that running away from a meaningless confrontation is a shameful act rather than a wise one. It's a fate that will continue to befall an unfortunate number of us, and disproportionately those of us who are black or poor or from the 'hood, until we steel ourselves to confronting the real problem.",
                    "author": "jzpenny",
                    "created_utc": 1373933444.0,
                    "replies": [
                        {
                            "name": "t1_cb7rsbm",
                            "parent_id": "t1_cb3ecr8",
                            "body": "&gt;If we believe Zimmerman's statements, and the police as well as a jury found no apparent reason not to, Zimmerman did not know Martin's race when he began following him. What attracted Zimmerman's attention was a man wearing a hood walking between houses at night, in a neighborhood that had been troubled by burglaries.\n\ndoesn't matter.  He realized he was black sometime between when he started following him and before he got out of his car.  He could have been MORE suspicious after knew his race and this is where speculation gets silly so i will stop.\n\n&gt;Lets put this another way. Is there any actual evidence to suggest that Zimmerman is a racist? This seems to be an assertion that's being made between the lines without any real support.\n\nYou are absolutely right.  If we want to prove that driving while black is a phenomenon, there is data to examine from a police department.  We don't have this kind of information available on Zimmerman, only our own cultural experiences.    Let me turn it on its head though.  What would such evidence look like?  He would have to be overtly racist and you don't really see those as much nowadays.  We also would not behaving this conversation if he had an \"ss\" tattoo.  I also hear what you are saying about the nature of \"hip hop\" culture.  I don't want to say I fully agree but you make many valid points.  Your description of the cultural issue is well stated. \n\n&gt;But the reality is that George Zimmerman is not ultimately to blame for his fate... George Zimmerman had no other choice,\n\nI disagree.  I think following someone at night is an aggressive action.  Zimmerman followed Trayvon because he thought they were a threat.  He got out of his car with a firearm, not a taser.  Every time he carries his gun outside of his house he acknowledges that he might have to use lethal force to defend himself. Any concealed carry guys would tell you this.  To get out of your car and to follow a threat you are acknowledging that you might have to shoot him.  I don't see anything of this as up for question.  Trayvon did not have to attack him but one could say he was responding to an aggressive action.  Bottom line, In my humble opinion, you don't get to voluntarily put yourself in harms way (remember he thought trayvon was a threat) when your only option is lethal force and there is currently no threat to person or property.\n\n&gt;Trayvon Martin, who by all accounts knocked a guy onto the ground and then continued beating him mercilessly,\n\nThe only account is Zimmerman's, so you are correct but your sample size is questionable. The medical examiner did not say wounds were serious. ",
                            "author": "Get72ready",
                            "created_utc": 1374498361.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cb2y910",
            "parent_id": "t3_1ibg1p",
            "body": "I actually agree with you in principle... I just wanted to point out that George Zimmerman is not white, he's Hispanic.",
            "author": "BroseppeVerdi",
            "created_utc": 1373879301.0,
            "replies": [
                {
                    "name": "t1_cb32ac8",
                    "parent_id": "t1_cb2y910",
                    "body": "I thought Hispanic was not a race?",
                    "author": "throwaway86753098675",
                    "created_utc": 1373900891.0,
                    "replies": []
                },
                {
                    "name": "t1_cb3grrv",
                    "parent_id": "t1_cb2y910",
                    "body": "Hispanic is an ethnicity, not a race.",
                    "author": "[deleted]",
                    "created_utc": 1373940358.0,
                    "replies": [
                        {
                            "name": "t1_cb3hafx",
                            "parent_id": "t1_cb3grrv",
                            "body": "The word \"ethnicity\" comes from the Greek \"ethnos\", which means \"race\"... at any rate, my point was that he's not white.",
                            "author": "BroseppeVerdi",
                            "created_utc": 1373941821.0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}