{
    "name": "t3_1wy59h",
    "title": "I don't think the last season of Dexter was that bad, CMV.",
    "body": "I recently finished watching Dexter on Netflix and before going in to the last season I had been warned by many of my friends and by the general internet consensus how bad it was. But throughout the season and after the finale, I was not totally disappointed. That being said, I do see how it's different than the previous seasons and I also could point out several things that could have been done better but in general I thought it was still entertaining and fun to watch. I would just like to know what so many people saw in it that made them so upset with the ending. How should they have ended it? I personally wasn't sure how they would wrap up the whole thing with Dexter getting away with his life and reputation and in the end it seemed like him faking his own death was one of the only options. Maybe some viewers thought he should have actually died but to me that's totally against Dexter's whole nature. He has a survival instinct that is always prevailing. Did anyone think he should have been exposed as a monster to the public like in Breaking Bad? Speaking of which, what made the ending of that show so much better? Please try and help me wrap my head around this.",
    "author": "thewesselmob",
    "num_comments": 7,
    "created_utc": 1391479425.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1wy59h/i_dont_think_the_last_season_of_dexter_was_that/",
    "comments": [
        {
            "name": "t1_cf6guot",
            "parent_id": "t3_1wy59h",
            "body": "Dexter season eight is awful.  It is so bad, that if there were a real life Dexter his first priority would be murdering everyone responsible for the travesty of season eight.  And I weep daily that there is not a real life Dexter.\n\nI am going to mention some events from the season.  I'm not calling these \"spoilers\" because that would imply that there was something to spoil.  Instead, I'm calling these \"saviors\" because I hope it ruins the plot and saves someone else from wasting their time with this idiotic show.\n\nLets start with what a good show is.  Dexter is a \"Dark Drama\" - and what I expect from this kind of show is, in a metaphor, a killer whale.  The whale is sleek and smooth in the same way that the show should be viscerally.  The whale is dangerous and the show should take risks and push boundaries.  The whale is subtle, a four and a half ton animal swimming at thirty miles an hour under the calm surface of the water - until the whale decides to let you see his dorsal.\n\nThe archetypal scene of season eight, was the one with Hanna McKay and that private detective on the bus.  Hanna injects the detective and tells him \"I've just given you a sedative, you'll wake up in a couple hours\".  Why did she say this?  I'll go through a few possible reasons.\n\n1. The character would have?  No.  Absolutely not.  Hanna is a subtle poisoner.  Announcing on a crowded bus, and in the company of a child, that you have just poisoned someone is not only reckless and idiotic (we know how this poison works, the guy is already zonked out, she is explaining to no one), but it is also anathema to her character.  She would want to keep things quiet and secret.\n\n2. The viewer needed the exposistion?  Nothing could be further from the truth.  Someone entirely unfamiliar with the series, watching that clip on mute would have been able to tell the relevant details.  She injects the guy, he passes out, she escapes.  Yup.  Plus, the Dexter viewer is intimately familiar with how this poison works.\n\n3. The show wants to make it painfully clear that Hanna (despite being a serial killer) isn't killing the guy now that she is a love interest.  Sadly, this is the correct answer.\n\nAt this point, the show has been neutered.  Any kind of danger or risk taking in terms of plotting elements is gone.  Hanna is the good person now, only doing good things.  She would never kill anyone and the show will use retard gloves to pointless drive that into you.\n\nContrast this with the scene in Breaking Bad were Lydia comments that there is only a single packet of Stevia remaining.  This scene feels like the lurch of an unexplained ripple beneath your life raft in the midst of still waters.  Dexter season eight is like they ranked all the Dexter fanfiction that existed and then decided to film one, but they accidentally chose from the bottom of the list instead of the top.\n\nWhere once the show was clever, it became bumbling and hamfisted.  Dexter can't do anything right.  Constantly failing to kill people he should, making mistakes, never learning from his actions.  Oh, taking this boy murderer under your wing now buddy?  HOW MANY FUCKING TIMES HAS THAT FAILED FOR YOU BY NOW?  Wants to kill Hanna, can't.  Wants to kill so and so.  Can't.  Wants to blah blah blah.\n\nThe narrative is clumsy and jagged.  The motivations of characters reverse for no real reason.  Deb wants to kill Dexter all of a sudden.  Nope, changed her mind, helping him again.  Now she is dead.  Dexter wants to live with Hanna, nope now he wants to kill himself now that Deb is dead.  Nope, he survived driving his boat through a hurricane and is now a logger.  There is a dangerous brain surgeon serial killer.  Nope, he is caught.  Now free again cause Dexter can't kill him.  Now caught, nope free.  Dexter has a new love interest, nope she is dead.  And on and on and on.  How are Masuka and his daughter getting along now?  Oh she uses drugs!\n\nThe show always struggled to be plausible, but in season eight it doesn't even bother trying.  Why is Hanna staying at your sister's house?  Why doesn't she wear a fucking wig when she goes out?  Again, look at the efforts they go to in Breaking Bad to disguise themself.  Now imagine Hanna walking into a hospital with no disguise AND GIVING THE ADDRESS WHERE SHE IS CURRENTLY STAYING! Why are you getting romantically involved with a serial killer whose MO is killing her partner?  And you left your son with her?  Great thinking Dex.\n\nI didn't watch Dexter to see the bumbling misadventures of a limp dicked blood spatter analysist as he just wants to be happy with his girlfriend.  I watched it because Dexter was a cool, powerful monster in plain sight.  The story was smart and felt like it was going places.  Season eight is like a parody of Dexter that forgot that parodies were supposed to at least be funny.",
            "author": "electricfistula",
            "created_utc": 1391482783.0,
            "replies": [
                {
                    "name": "t1_cf6hov9",
                    "parent_id": "t1_cf6guot",
                    "body": "&amp;#8710; Thank you. This is exactly what I was looking for. Well written too. I definitely did not pay so much attention to detail as you did. This may have been because of the fast pace at which I watched it. I see what you mean about the illogical transformation of collected serial killer to emotion filled family man. And how he survived the hurricane is also questionable. You seem to know the show well...how do you think it should have ended?\n\nEdit: Added delta",
                    "author": "thewesselmob",
                    "created_utc": 1391484597.0,
                    "replies": [
                        {
                            "name": "t1_cf6i1tq",
                            "parent_id": "t1_cf6hov9",
                            "body": "Honestly, the show should have ended in season four, maybe five.\n\nIf they had to stretch it (or just really wanted more money) then I would have made Dexter grow progressively more evil (perhaps after being betrayed by Hanna as he inevitably will be).  Dexter starts to kill more and more and his victims fit the code less and less.  But, this should be done in a way that gradually introduces the viewer to the darker Dexter.\n\nEventually, Deb figures things out, but exposing and arresting Dexter would cause all sorts of problems for her and she doesn't want that for her brother anyway, so Deb confronts Dexter to try and stop him, ultimately kills him and the final episode would be Deb getting into a situation where some horrible villain was going to get away clean because of some legal technicality, and Deb would decide to take over the role of her fallen brother.  She'd sneak into the house, creep up on the villain, she'd hesitate with second thoughts about her course of action, we'd tell by her face that she'd reached some resolution, then the series would end.  Leaving the viewer to debate what Deb would do, and what she should have done.",
                            "author": "electricfistula",
                            "created_utc": 1391485398.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cf6i29x",
                            "parent_id": "t1_cf6hov9",
                            "body": "Confirmed: 1 delta awarded to /u/electricfistula. ^[[History](/r/changemyview/wiki/user/electricfistula)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][[Subreddit](http://www.reddit.com/r/DeltaBot/)]",
                            "author": "DeltaBot",
                            "created_utc": 1391485426.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cf6jm5k",
                    "parent_id": "t1_cf6guot",
                    "body": "Great answer. What do you think happened that caused season eight to be so poorly done? ",
                    "author": "duck_oil",
                    "created_utc": 1391488923.0,
                    "replies": []
                },
                {
                    "name": "t1_cf6q2d9",
                    "parent_id": "t1_cf6guot",
                    "body": "&gt; Why are you getting romantically involved with a serial killer whose MO is killing her partner?\n\nThis was the precise point at which I was done with Dexter. Dexter used to be a calculating and intelligent killer. Then suddenly he became a bumbling idiot who made stupid decisions and refused to kill Hannah, even though she fit the Code, for seemingly no deeper reason than \"durrrr boobs and pretty blonde hair\". He suddenly and inexplicably became a hormonal teenager who was unable to see beyond his dick.\n\nThat and the way his son Harrison seems to drop in and out of existence in Dexter's world.\n\nAnd as for the motivations of characters changing on a whim, the whole Debra being in incestuous love with Dexter clear out of the blue, and then oh wait nevermind that's kinda creepy... scrap that. Uuuugh.\n\nThe glaring inconsistencies made that show so much of a joke that the best thing about it became coming online and reading the eviscerating reviews of each episode.\n",
                    "author": "FurryButt",
                    "created_utc": 1391518501.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cf6qwoo",
            "parent_id": "t3_1wy59h",
            "body": "Fully endorsing /u/electricfistula's great answer, and adding on.  Season 8 never felt like a final season.  So many new characters were introduced, just to be killed off.  Dr. Vogel's character, while brilliantly played by Charlotte Rampling, made no fucking sense.  Her connection to Dexter and Harry is ludicrous.  At no point in the series was she even hinted at.  To me, it was clear that the writers never envisioned this aspect of Dexter's myth when they created the show and the character, it was purely forced into place for this one season.  \n  \nThe other new characters also seemed to only be introduced to be killed so that the characters we've all come to know get to live (save Deb, who dies because of a one in a million blood clot- just so she and Dex can have one last conversation while she's in the hospital).  No other arc is closed.  Angel, Quinn, and Matthews are still in the dark about who Dexter really was.  This makes LaGuerta's death even more pointless than it already seemed.  Jamie still hasn't done anything important.  \n  \nThose things plus Dexter and Hannah turning into bumbling idiots as already pointed out turned the last season into a disaster.  The other HUGE GAPPING hole that was never addressed in either S7 or S8 was the scene in S5 where Deb walks in on Dexter and Lumen about to kill Jordan Chase (they can't see each other because of a opaque tarp) and Deb lets them go.  Suddenly Deb finds out Dexter is a serial killer and has this huge crisis of conscious.  In what universe does it make sense that the scene in the basement never comes up between the two of them???????????????  ",
            "author": "eye_patch_willy",
            "created_utc": 1391522132.0,
            "replies": []
        }
    ]
}