{
    "name": "t3_1ealr6",
    "title": "I really don't think the two matrix sequels are bad. As a matter of fact I love em.",
    "body": "Change my view. ",
    "author": "FullMetalAnon",
    "num_comments": 18,
    "created_utc": 1368503976.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1ealr6/i_really_dont_think_the_two_matrix_sequels_are/",
    "comments": [
        {
            "name": "t1_c9yd1j0",
            "parent_id": "t3_1ealr6",
            "body": "Please remember to include \"CMV\" in your post title for when you next post, thanks!",
            "author": "IAmAN00bie",
            "created_utc": 1368504115.0,
            "replies": [
                {
                    "name": "t1_c9yd9d8",
                    "parent_id": "t1_c9yd1j0",
                    "body": "Thanks! Sorry just discovered this subreddit haha",
                    "author": "FullMetalAnon",
                    "created_utc": 1368504802.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_c9yd609",
            "parent_id": "t3_1ealr6",
            "body": "What do you like about them?",
            "author": "DashFerLev",
            "created_utc": 1368504504.0,
            "replies": [
                {
                    "name": "t1_c9yd8ym",
                    "parent_id": "t1_c9yd609",
                    "body": "I just think the matrix wouldn't be as good on its own. The other two open the world of Zion and you get deeper into the smith character who is far more entertaining than neo IMO. Yes it's cheesy sometimes but most movies are these days. And the graphics weren't the best in reloaded, but they did what they could with what they had. The plots weren't lacking at all and the ending of the third was epic and beautiful. ",
                    "author": "FullMetalAnon",
                    "created_utc": 1368504768.0,
                    "replies": [
                        {
                            "name": "t1_c9ydep4",
                            "parent_id": "t1_c9yd8ym",
                            "body": "But like... the whole Zion thing was blown to pieces.  \n\nThey were **RIGHT** under the machine city.  \n\n&gt; smith character who is far more entertaining than neo IMO\n\nAbsolutely, mostly right.  He made huge blunders, though.  Like \n\n\"Oh, I have my new body.  This is literally everything I've ever wanted.  Let me go blow my cover and fight the one.\"\n\nand that gem \"There are thousands of me- Millions even.  But it's just going to be a one on one fight, Neo.\"\n\n&gt; The plots weren't lacking at all \n\nI do not have enough time in my life to explain all the plot holes with those two movies.  For instance:  \n\nIn the Trinity motor bike chase scene.  They morphed that truck driver... and nobody else.  Seriously.  Just morph someone like a half mile in front of her and open your car door.\n\n&gt; and the ending of the third was epic and beautiful.\n\nAnd it got really Jesus-ey for me.  I don't like watching secretly-religious movies.",
                            "author": "DashFerLev",
                            "created_utc": 1368505277.0,
                            "replies": [
                                {
                                    "name": "t1_c9ydie1",
                                    "parent_id": "t1_c9ydep4",
                                    "body": "Hmm got me thinking. And I agree for the most part.. Maybe it's because my dad got the boxset when I was about 11 and we watched all three together. They were my first r rated movies too. It could be more sentimental. ",
                                    "author": "FullMetalAnon",
                                    "created_utc": 1368505608.0,
                                    "replies": [
                                        {
                                            "name": "t1_c9ydlao",
                                            "parent_id": "t1_c9ydie1",
                                            "body": "Ooh!  That's a good one. \n\nWhen was the last time you saw all three?  \n\nWhen I was like 10 I saw Star Wars: Phanom Menace and I was like \"Wow, I really like this\" and then I saw it with my friends a few years ago in a 6 movie marathon and it took some heavy, heavy drinking to get through it.",
                                            "author": "DashFerLev",
                                            "created_utc": 1368505879.0,
                                            "replies": [
                                                {
                                                    "name": "t1_c9ydmcp",
                                                    "parent_id": "t1_c9ydlao",
                                                    "body": "I literally just watched all three. Like just finished revolutions. At a [7] mind you... Maybe watching movies sober would be better for my critiquing skills haha",
                                                    "author": "FullMetalAnon",
                                                    "created_utc": 1368505974.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_c9ydp3b",
                                                            "parent_id": "t1_c9ydmcp",
                                                            "body": "Name one movie you hate to watch high.",
                                                            "author": "DashFerLev",
                                                            "created_utc": 1368506221.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_c9ydsv7",
                                                                    "parent_id": "t1_c9ydp3b",
                                                                    "body": "Gandhi. Cause I'm siting there gorging my face, and he's got nothing to eat..",
                                                                    "author": "Jdf121",
                                                                    "created_utc": 1368506586.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_c9ydv9t",
                                                                            "parent_id": "t1_c9ydsv7",
                                                                            "body": "He *chooses* not to eat.\n\nAlso he's a bamf.  Bamfs are cooler while high.",
                                                                            "author": "DashFerLev",
                                                                            "created_utc": 1368506810.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_c9ye0ac",
                                                                                    "parent_id": "t1_c9ydv9t",
                                                                                    "body": "Still, he's hungry",
                                                                                    "author": "Jdf121",
                                                                                    "created_utc": 1368507297.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "name": "t1_c9ye0fr",
                                                                    "parent_id": "t1_c9ydp3b",
                                                                    "body": "A Serbian movie.\n\nEDIT: look it up ",
                                                                    "author": "FullMetalAnon",
                                                                    "created_utc": 1368507311.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_c9ye1t1",
                                                                            "parent_id": "t1_c9ye0fr",
                                                                            "body": "Remembering that movie made me sad inside.",
                                                                            "author": "DashFerLev",
                                                                            "created_utc": 1368507451.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_c9yds66",
                                    "parent_id": "t1_c9ydep4",
                                    "body": "The second two movies were an allegory of religion somewhat, but what really is happening in the movie is that humanity is trapped in a cycle it is doomed to repeat. The Matrix always reboots. It isn't just based on Judeo-Christian beliefs. The themes range from that, to Buddhism, to seclular simulation theory. \n\nThe last two movies bring TONS of philosophical depth to that trilogy that is lost on a lot of people. Specifically the conversation with the Architect. Most people call that scene boring and unnecessary. That couldn't be farther from the truth.",
                                    "author": "Jdf121",
                                    "created_utc": 1368506519.0,
                                    "replies": [
                                        {
                                            "name": "t1_c9ydusf",
                                            "parent_id": "t1_c9yds66",
                                            "body": "The first was, too.  \n\nI was gonna try and list them but I haven't seen them in years, so [the internet came to the rescue](http://anna.xanga.com/711293386/item/).\n\nAlso Smith had to kill the Oracle to get her futuresight.  wat?",
                                            "author": "DashFerLev",
                                            "created_utc": 1368506763.0,
                                            "replies": [
                                                {
                                                    "name": "t1_c9ye2gw",
                                                    "parent_id": "t1_c9ydusf",
                                                    "body": "The Architect is the 'order' of the Matrix, and the Oracle is the entity that is suppose to introduce 'disorder'. Smith is programmed by the Architect, so the struggle is really between Architect/Oracle, Devil/God, Good/Evil, Order/Disorder. It can't really be pigeon holed into one thing.",
                                                    "author": "Jdf121",
                                                    "created_utc": 1368507515.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_c9ye3mn",
                                                            "parent_id": "t1_c9ye2gw",
                                                            "body": "Well in the first one, Neo was a man, died, and was resurrected as the one.\n\nAlso other things.",
                                                            "author": "DashFerLev",
                                                            "created_utc": 1368507629.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}