{
    "name": "t3_1c4do4",
    "title": "I believe depression isn't a mental disorder. CMV",
    "body": "So, I don't believe depression is a mental disorder. I don't mean to be disrespectful, I just feel that way.\n\nI've seen so many moments when someone used it as an excuse to get out of work, to gain sympathy, or for attention.\n\nBack in Middle School to gain attention people would throw depression around and I think it wasn't depression, but just teenage hormones. I've seen people who claimed to have depression one day and the next seem totally fine.\n\nI feel like so many people have used it as an excuse it has ruined my opinion probably. But even then I feel like depression isn't its own disorder.\n\nSo CMV?",
    "author": "NeroJack",
    "num_comments": 11,
    "created_utc": 1365662885.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1c4do4/i_believe_depression_isnt_a_mental_disorder_cmv/",
    "comments": [
        {
            "name": "t1_c9cwqb4",
            "parent_id": "t3_1c4do4",
            "body": "Using my \"I'm suicidal\" throwaway for this one.  That should tell you something, actually.  It should tell you that not only am I depressed enough to have several plans on how to kill myself, but it's something I'm trying to keep secret and *not* get attention for.  That alone probably won't be enough, so let's get to argumentation, shall we?\n\n&gt; I've seen so many moments when someone used it as an excuse to get out of work, to gain sympathy, or for attention.\n\nTrue.  I see soccer players/footballers fall to the ground at being breathed on wrong, but that doesn't mean that there's no such thing as sprained ankles or bruised shins.  People occasionally make false allegations of rape for attention/for vindictive reasons, do you also believe that rape doesn't happen?\n\n&gt; I've seen people who claimed to have depression one day and the next seem totally fine.\n\nThat's because depression is poorly understood by most everyone who doesn't suffer from it.  You've been sad at some point in your life, right?  And I'm sure at some point you've had [intrusive thoughts](http://en.wikipedia.org/wiki/Intrusive_thoughts) about possibly killing yourself/dying at some point in your life, right?  That's not what depression is, despite what a lot of people who claim it might think.\n\nNo, depression is closer to... an allergy to sadness.  While the average person may get sad when unpleasant things happen, not unlike sneezing when there's too much cat-hair about, people like me have our eyes go red and puffy and our lungs close up.   Sometimes, depending on how bad the exposure is, and what tools we have to treat it, we *might* be fine the next day, or we might end up spending the next day having a hell of a time convincing ourselves that it's worth getting out of bed, even to eat.\n\nWhat's more, some of those people who want the world to end one day, and are perfectly fine the next may not be suffering from clinical depression at all, but may instead be manic/depressives. \n\n&gt; I feel like depression isn't its own disorder.\n\nIt's not always, but it doesn't change the fact that people like me, people who *do* have a hard time dealing with reality actually exist.\n\nAnd of course, it doesn't help that so many people who *are* depressed seem so upbeat.  There are a number of comedians who are depressed and on medication for it, but you'd never know, because you associate them with laughter.  That's at least partially because they are using comedy to fight off the demons.  What you see as them getting emotionally high is sometimes nothing more than them trying to get back to normal.\n\nBut I suppose none of this means anything, because I can't really give you any true insight into how I think, how my brain (mal)functions.  So, please, try [this \"text adventure\"](http://www.depressionquest.com/) and see what you think.",
            "author": "NotTheHelpIWant",
            "created_utc": 1365664641.0,
            "replies": []
        },
        {
            "name": "t1_c9cwt98",
            "parent_id": "t3_1c4do4",
            "body": "Edit: Also, it's a throwaway for privacy. Obviously, but just pointing it out.\n\nI have answered this question before, but never on the internet, so bare with me.\n\nI have severe to mild Clinical Depression and severe to mild Generalized Anxiety Disorder. I have been diagnosed professionally and have done therapy and taken different anti-depressants for a few years. My lifelong struggle with Depression and Anxiety began when I was very young, at the age of two. My father was severally injured in a work related accident, and it nearly killed him. My life was flipped upside down and I was too young to comprehend why.\n\nIt has a happy ending though. My father is just fine and went back to work and my parents are still happily married after 28 years together. That being said, the lasting effects ruined my childhood. I have tried to think of a better way to phrase it, but honestly that’s what it simply comes down to. Childhood Depression and Anxiety often carries different symptoms, and sadly the tests and knowledge surrounding both disorders is adult centered.\n\nAt the age of three I would begin my relationship with Panic Attacks. I would sit humming and rubbing my face and tune the world out. To a three year old it was the easiest way to calm myself. My elementary school teachers would notice this behavior and my mother told me years later they even brought it up during parent teacher conferences. I can’t explain how furious this makes me. Even at the age of 20, currently in college, I would consider confronting those teachers if I could. They ignored obvious signs of distress and because it wasn’t from child abuse I fell through the cracks. I feel let down by every single adult who did not notice, help, or at the least support me.\n\nBy Middle School I did online research into Depression and Anxiety and knew what had been following me my whole life. The research told me what I had known all along, it isn’t in your control. [From brain structures of depressed individuals being different than non-depressed people, to the brain not absorbing enough chemicals that balance mood, and certain hormone imbalances,]( http://en.wikipedia.org/wiki/Biology_of_depression) I realized it wasn’t my fault. By High School I was considering suicide and I only resisted for the happiness of my family. Later in High School I would be diagnosed and began treatment. Today, I am on the downward slope after climbing the mountain, and can confidently say I will demand a Depression and Anxiety free life from now on.\n\nIt often haunts me, even today, that I have no prior memories to being depressed and anxious. I was simply so young when it began that I don’t know what “normal” is like. It makes treatment complicated, to say the least.\n\nTo describe what Depression and Anxiety feel like it pretty challenging, but I’ve had to do this exercise before so it’s easier now. When depressed it consumed me. I had difficulty concentrating, which made school a nightmare, and my Depression would interrupt my sleep adding to the difficulty concentrating. The longest I have gone without sleep is 3 and a half days. Your mind eventually feels like mush, your feet feel as heavy as lead, and you have to concentrate on opening your eyes after you blink. The longest I have ever slept was 17 hours straight and I still felt somewhat tired after. My body simply never felt fully awake or energized. I had extreme guilt and feelings of being worthless. I hated me more than anyone can hate another person. Imagine every second, minute, and hour your mind is on a loop of horrible thoughts. “You are so stupid/useless/worthless. No one likes you. That person thinks you are stupid. Why can’t you act like a normal person for one day? Do you see how horrible you did on that school assignment? It’s all your fault. Your fault. It’s always your fault.” If I said any of that to another person it would be considered verbal abuse, and I did it to myself for 20 years. It is the most exhausting and energy consuming experience. It’s also what often fuels suicidal thoughts; you feel worthless and believe the world would be better without you here. So why would you not kill yourself?\n\nWhat people often don’t know is that Depression can cause physical ailments as well. I would have loss of appetite and simply not eat, I had constant mild pain, headaches, and my mental health disorders lowered my immune system causing illness more frequently. The longest I have gone without eating was one week due to extreme depression. My body constantly hurt in some way, usually my back or neck where I held most of my tension. The tension would lead to headaches and they never seemed to fully go away. \n\nAs for anxiety it is constant stress and worrying. The worst part, though, about anxiety is the panic attacks. I can honestly say it is the closest feeling to death I can imagine. It feels like a combination of a heart attack, drowning, and complete emotional distress. My heart races to the point where I can see my heart beat fluttering my shirt. I become hot from the increased heart rate and will often sweat. The sudden increase in temperature causes sudden chills, like a fever. I shake if I am alone, but if I am in public I simply lock up and demand as much control as I can muster. I suddenly can’t breath and feel like I am drowning. When the attack first hits I freeze in shock, like someone has just hit me with all their strength, and I stop breathing. After the sudden shock wears off I start attempting to gasp for air, but nothing happens. The lack of air causes sudden tunnel vision and blurred vision. I hear nothing during panic attacks as my ears begin to ring loudly from the sudden spike in blood pressure. My chest feels like someone has punched me through the heart and is ripping everything out of me. At the same time if feels like someone has stabbed me in the back with a knife made of dry ice. It is so cold, hot, and sharp all at once. At my worst I had 15 to 20 attacks a day. I wouldn’t wish a panic attack on my worst enemy.\n\nNow that I am older things have become easier. I have more life experience to put stressful situations and depression into context. The more life experience you gain the more you feel you can overcome, because you have made it this far. Honestly, the saying, “It gets better,” is completely accurate. All bad situations pass at some point, but for those with Depression and Anxiety the bad situation is yourself, and so you must address it or else every situation will seem equally bad forever.",
            "author": "CMVThrowaway1",
            "created_utc": 1365665131.0,
            "replies": [
                {
                    "name": "t1_c9cwx8n",
                    "parent_id": "t1_c9cwt98",
                    "body": "Wow, I don't really know what to say to this.\n\nI wish I could give you more than just a Delta. &amp;#8710;\n\nI just needed someone to explain why, and you did that. I wish you hadn't used a throwaway so I could give you a Delta for real.",
                    "author": "NeroJack",
                    "created_utc": 1365665835.0,
                    "replies": [
                        {
                            "name": "t1_c9cx6sr",
                            "parent_id": "t1_c9cwx8n",
                            "body": "Confirmed - 1 delta awarded to /u/CMVThrowaway1",
                            "author": "DeltaBot",
                            "created_utc": 1365667641.0,
                            "replies": []
                        },
                        {
                            "name": "t1_c9cx764",
                            "parent_id": "t1_c9cwx8n",
                            "body": "deltas need to be the first character to be registered, fyi.",
                            "author": "3rd_Shift_Tech_Man",
                            "created_utc": 1365667715.0,
                            "replies": [
                                {
                                    "name": "t1_c9dla74",
                                    "parent_id": "t1_c9cx764",
                                    "body": "Looks like it got registered just fine.",
                                    "author": "Troacctid",
                                    "created_utc": 1365743975.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "name": "t1_c9cy0oj",
                            "parent_id": "t1_c9cwx8n",
                            "body": "Something else to consider:  Whether or not you want to look at the physiological causes of depression, the symptoms, etc...  Depression isn't about being sad all the time, but instead, about not being able to feel happiness.  You can (usually) remember times in which you were happy, or that you can be happy, but you can't actually remember what it felt like or how to feel that way again.  ",
                            "author": "Novori12",
                            "created_utc": 1365674410.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_c9d39gw",
                    "parent_id": "t1_c9cwt98",
                    "body": "∆ \n\nThat was eye opening.  I don't believe I shared the OP's view, but certainly this changed my mind on certain things in my own life I've been dealing with.",
                    "author": "RobertK1",
                    "created_utc": 1365696366.0,
                    "replies": [
                        {
                            "name": "t1_c9d3a73",
                            "parent_id": "t1_c9d39gw",
                            "body": "Confirmed - 1 delta awarded to /u/CMVThrowaway1",
                            "author": "DeltaBot",
                            "created_utc": 1365696421.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_c9d5s0t",
            "parent_id": "t3_1c4do4",
            "body": "Depression as a mood and depression as a mood disorder are two different things. Many people experience periods of transient depression. This is not a disorder, but it still can be quite severe and result in self-harm or suicide. Depression as a mood disorder is persistent, and in many cases lifelong, feelings of being \"down\", inadequate, worthless, suicidal, and just generally dissatisfied with life. \n\n&gt;I've seen people who claimed to have depression one day and the next seem totally fine.\n\nThese may be people who are experiencing transient periods of depression, these may be liars, or they may be people covering up their depression. Speaking for myself as someone who has an anxiety disorder that causes persistent depression, I was known to be quite a boisterous, friendly and upbeat person in college. Many times I was the life of a party and I had a very large group of friends among whom I was known for being excitable and happy. Then I would go to my dorm room and cry or cut myself. Neither of those things was fake either. My friends genuinely made me happy, and why would I want to bring out my depression into a situation in which I was happy? Why would I want to deliberately bring myself and others down? On top of this, I would occasionally experience manic episodes. Mania is the other pole from which bipolar disorder gets its name. Whereas depression is characterized by a lack of energy and feelings of apathy or hopelessness, mania is characterized by an overwhelming intensity of energy that can result in anxiousness and panic, often resulting in that hair-trigger anger that people imagine when they think of BPD, or if you're lucky and spending time with people you like that mania can result in a high-energy euphoria that is actually one of the best feelings I have ever experienced. One of the things that bummed me out the most when I went on medication was knowing that these euphoric episodes would go away.\n\nAnyways, hope that helped some.",
            "author": "Sandlicker",
            "created_utc": 1365702943.0,
            "replies": [
                {
                    "name": "t1_c9dh6mv",
                    "parent_id": "t1_c9d5s0t",
                    "body": "Thank you for sharing. Could I ask what you were diagnosed as and what type of medication they put you on? I know this isn't strictly related to the subreddit, but what you're describing scarily fits me, and that ability to go from happy to hopeless and back again has distressed and puzzled me. I tried going to therapy and getting a diagnosis once, but all we succeeded in doing was identifying that the girl, who was scared of driving because she might impulsively kill herself by causing a wreck, was depressed. I did not find it terribly helpful. Anyway, thanks in advance if you reply.",
                    "author": "throckmorton13",
                    "created_utc": 1365732145.0,
                    "replies": []
                }
            ]
        }
    ]
}