{
    "name": "t3_1jcsg3",
    "title": "TCMV Tuesday - 07/30/13",
    "body": "Welcome to TCMV Tuesday, our weekly post where we can celebrate our ability to adopt a new mindset or gain another perspective. Tell us what experiences you've had outside our subreddit, either recently or in your lifetime, that made you think \"**This Changed My View**\". Give us your stories in the comments!\n\nYou can consider these questions to help get you thinking:\n\n* Known or met someone with an interesting ideology or opinion that caused you to reconsider your own?\n\n* Had an experience, good or bad, that changed your perspective?\n\n* Learned something new that challenged what you believed?\n\n* Ever have your tastes or interests changed?\n\n* Read an article or seen a video that got you thinking differently?\n\nAnd just as a reminder, comment discussions here are not debate-oriented, so there's no obligation to take opposing sides in conversations here (in other words, Rule 1 does not apply here).",
    "author": "AutoModerator",
    "num_comments": 4,
    "created_utc": 1375200012.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1jcsg3/tcmv_tuesday_073013/",
    "comments": [
        {
            "name": "t1_cbde3gg",
            "parent_id": "t3_1jcsg3",
            "body": "I have recently been going through a tough time in relation to my social life. My now ex girlfriend left me to date my best friend of 15 years. Neither of them were particularly repentant and seemed to be under the impression that they had done nothing really wrong. I had been having a hard time going through this break up mainly alone because my best friend and confidant was now dating my ex of 2 years. \n\nNow, I had never been a firm believer in the importance of talk therapy, and going to see a counselor and talk through whatever issues I had. But, one day, I was talking to one of my friends, who had suggested that I start seeing a therapist. I scoffed at the notion, until he explained the importance of seeing a therapist. Though I can't remember verbatim, this was the gist of it:\n\nTherapy is important, not necessarily because you are going to walk away with anything remarkably profound that you didn't previously know, but rather because it gives you an opportunity to express yourself to someone who has no \"horse in the race\"  so to speak. Talk to someone who won't judge anything you say or feel, or hold it against you anytime in the future. It provides an environment for true expression without fear of reputation, or hurting another person, etc. It allows you to truly say what you're feeling, not necessarily to accomplish anything other than to allow your feelings to keep from being bottled up.\n\nSince he told me that, I have been seeing a therapist to deal with much more than my current social predicament, and it has been working wonders",
            "author": "chitownredditor",
            "created_utc": 1375202338.0,
            "replies": [
                {
                    "name": "t1_cbdfj9b",
                    "parent_id": "t1_cbde3gg",
                    "body": "Wow, that sounds rough. Glad to see things are getting better for you, though!",
                    "author": "IAmAN00bie",
                    "created_utc": 1375205686.0,
                    "replies": []
                },
                {
                    "name": "t1_cbe1001",
                    "parent_id": "t1_cbde3gg",
                    "body": "That's awesome! Have you tried meditation as well? I hear that's absolutely amazing in conjunction with talk therapy.",
                    "author": "piyochama",
                    "created_utc": 1375278366.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cbdodgh",
            "parent_id": "t3_1jcsg3",
            "body": "About a month ago I posted a CMV about how I think tipping should be made illegal (my view was NOT changed), and today I read [this](http://jayporter.com/dispatches/observations-from-a-tipless-restaurant-part-1-overview/) article about a San Diego restaurant that forbids tips!",
            "author": "_Search_",
            "created_utc": 1375227152.0,
            "replies": []
        }
    ]
}