{
    "name": "t3_1fyfb5",
    "title": "I believe the U.S. is a Illiberal democracy manipulated by those with control of money. CMV",
    "body": "Definition of [Inverse totalitarianism](https://en.wikipedia.org/wiki/Inverted_totalitarianism)\n\nThese are some media Shareholders\n\n* [Disney Corp](http://finance.yahoo.com/q/mh?s=DIS+Major+Holders)\n\n* [Time Warner](http://finance.yahoo.com/q/mh?s=TWX+Major+Holders)\n\n* [CBS](http://finance.yahoo.com/q/mh?s=CBS+Major+Holders)\n\n* [News corp](http://finance.yahoo.com/q/mh?s=NWSA+Major+Holders)\n\nThese are some banks and their Shareholders\n\n* [Goldman Sachs](http://finance.yahoo.com/q/mh?s=GS+Major+Holders)\n\n* [Bank of America](http://finance.yahoo.com/q/mh?s=BAC+Major+Holders)\n\n* [CITI bank](http://finance.yahoo.com/q/mh?s=C+Major+Holders)\n\n* [Deutsche Bank](http://finance.yahoo.com/q/mh?s=DB+Major+Holders)\n\nThese are some major tech and communications companies and their shareholders\n\n* [google](http://finance.yahoo.com/q/mh?s=GOOG+Major+Holders)\n\n* [apple](http://finance.yahoo.com/q/mh?s=AAPL+Major+Holders)\n\n* [at&amp;t](http://finance.yahoo.com/q/mh?s=T+Major+Holders)\n\n* [verizon](http://finance.yahoo.com/q/mh?s=VZ+Major+Holders)\n\nThe names that always come up in these companies and many more are Vanguard, Blackrock, State Street, and Fidelity.  Look up other fortune 500 companies for yourself.  \n\n[These companies are the ones who are trying to get even more control of internet with CISPA](http://maplight.org/us-congress/bill/112-hr-3523/1061747/contributions-by-vote?sort=asc&amp;order=%24+From+Interest+Groups%3Cbr+%2F%3EThat+Supported) \n\nIts important to know that the banks not only bribe our congressmen but have direct control of the Federal Reserve Bank which gives us the federal reserve notes that is our money (pull out a dollar bill and tell me what it says.....not U.S. Treasury Note). When you look [how the Fed creates money](http://www.youtube.com/watch?v=99DYh8Zpkpw) it makes sense that.......\n\n[Each Federal Reserve Bank is a separate corporation owned by commercial banks in its region. The stockholding commercial banks elect two thirds of each Bank’s nine member board of directors. The remaining three directors are appointed by the Federal Reserve Board. The Federal Reserve Board regulates the Reserve Banks, but direct supervision and control of each Bank is exercised by its board of directors. 12 U.S.C. Sect. 301. The directors enact by-laws regulating the manner of conducting general Bank business, 12 U.S.C. Sect. 341, and appoint officers to implement and supervise daily Bank activities. These activities include collecting and clearing checks, making advances to private and commercial entities, holding reserves for member banks, discounting the notes of member banks, and buying and selling securities on the open market. See 12 U.S.C. Sub-Sect. 341-361.](http://www.globalresearch.ca/the-federal-reserve-is-a-private-financial-institution/8518) \n\nThere is actually a story in the bible of all places that is relevant to this.  Jesus when he throws out the money changers in the temple.  Whether or not you believe in god/religion or not does not diminish the value of that story. It shows us that the monopoly of money was an issue thousands of years ago.\n\nTL/DR there are tangible reasons for the sayings\n\n* Follow the Money\n\n* Money is the root of all evil\n\nCMV\n",
    "author": "thetruthisjustice",
    "num_comments": 2,
    "created_utc": 1370738883.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1fyfb5/i_believe_the_us_is_a_illiberal_democracy/",
    "comments": [
        {
            "name": "t1_caf270x",
            "parent_id": "t3_1fyfb5",
            "body": "Why would you want that view changed? Its true. Its always been true. Just because communism didn't work doesn't mean Marx was wrong. No one is really trying to hide the glaring fault in capitalism is that it focuses power with the rich everyone knows money controls everything including the government, especially everyone on reddit",
            "author": "keenan123",
            "created_utc": 1370748080.0,
            "replies": []
        },
        {
            "name": "t1_caf702m",
            "parent_id": "t3_1fyfb5",
            "body": "Counter example, a new Detroit Windsor bridge was on the ballots to be approved.  The owner of a competing bridge campaigned heavily for it to be not approved.  In the end it was approved proveing money can't buy all elections",
            "author": "insaneHoshi",
            "created_utc": 1370774012.0,
            "replies": []
        }
    ]
}