{
    "name": "t3_1pg4zf",
    "title": "I don't think regifting is a bad thing - CMV.",
    "body": "Regifting is the action of giving someone a gift that was once given to you as a gift. It's usually done when the regifter doesn't have a use, want, or need for the item and/or thinks that another person would like it.\n\nThe problem is that, generally speaking, if at any point it's revealed that the gift you gave someone was a regift, it suddenly cheapens the quality of the gift and can even be taken as an insult to the recipient.\n\nI can understand how it might reflect a cheap nature on the part of the gift-giver, but I think that if a regift really reflects one's belief that the recipient would like and value the gift, it mitigates the means to which the giver initially got it. ",
    "author": "GameboyPATH",
    "num_comments": 9,
    "created_utc": 1383026185.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1pg4zf/i_dont_think_regifting_is_a_bad_thing_cmv/",
    "comments": [
        {
            "name": "t1_cd1yjx1",
            "parent_id": "t3_1pg4zf",
            "body": "I agree that if a regift *genuinely* reflects one's belief that the recipient would like and value the gift, it counteracts a \"cheapness\" factor.\n\nI'm not sure that the assumption that the regifter \"thinks that another person would like it\" always applies. The regifter is usually weighing their personal convenience over whether the next person would like it. This is the problem in which people base their judgment of regifting.\n\nThe problem is that regifting is not *usually* based on the fact that the gift is a perfect fit for the next giftee. This is just not the case, statistically; it's generally statistically unlikely over the entire population that a gift that one receives and doesn't want, *perfectly* fits the next recipients desires. Yes there might be people who love a gift and *still* regift it to someone else, even though they want it, but I think this is rare.\n\nSo I agree that it's not always a bad thing, but I do think that it is generally an *indication* that there may be selfish thinking/behavior going on on the part of the regifter.\n\nAlso, the original gift is usually meant to be for the regifter and selected carefully and in good faith by the original gifter as such. Logically, since the gift is given, there shouldn't be a problem with whatever the regifter wants to do with it, they can regift it or burn it or chuck it in the trash. But although logically a person should be able to do what they want with the gift, we do frown on people who don't take gifts seriously; by regifting it if they don't want it or burning/throwing it out.",
            "author": "convoces",
            "created_utc": 1383027133.0,
            "replies": [
                {
                    "name": "t1_cd2oaft",
                    "parent_id": "t1_cd1yjx1",
                    "body": "After posting, I did some research, and it doesn't seem like many people have as negative an opinion on general regifting as I thought, which kind of nullifies my assumed premise in the first place (that it's never acceptable). Like you said, the exceptions to the general trend seem to be acceptable, which in itself already opposes my posted view.\n\nBut I also think it's a good point that you mentioned how it can disrespect the intentions of the person who initially gave the gift first. Point is, you earned a ∆. (which, holy shit, you already have so many!)",
                    "author": "GameboyPATH",
                    "created_utc": 1383104568.0,
                    "replies": [
                        {
                            "name": "t1_cd2obq4",
                            "parent_id": "t1_cd2oaft",
                            "body": "Confirmed: 1 delta awarded to /u/convoces. ^[[History](/r/changemyview/wiki/convoces)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][[Subreddit](http://www.reddit.com/r/DeltaBot/)]",
                            "author": "DeltaBot",
                            "created_utc": 1383104664.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cd2rjoh",
                            "parent_id": "t1_cd2oaft",
                            "body": "Thanks for the delta!",
                            "author": "convoces",
                            "created_utc": 1383115444.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cd20dtq",
            "parent_id": "t3_1pg4zf",
            "body": "The issue that people tend to have with regifting is that there tends to be little thought or transparency with it. It's fine if you give me something that someone else gave you because you had no use for it, but I'd rather know it was a regift rather than giving the impression that you had gone out and got me a thoughtful gift. I've gotten plenty of hand me down gifts and enjoyed them greatly (a friend regifted a blouse to me that didn't fit her anymore and I wear it all the time). \n\nI have had issues with regifting in the past, and told the people who regifted me to not even bother with giving me presents anymore because it was obvious that they were just given to me to give me a present. One year I recieved a birthday present that was just a bag full of regifted items, including a crucifix (I am not, nor have I ever been Catholic) and a pen and pencil set that had the christmas tag with someone else's name still in it (I was born in the summer). I don't want a present for the sake of a present; I want to know that you thought of me when you decided to give me a gift. \n\nI love getting gifts and saving people money. I just like honesty more. \n\nSo, as I see it, it's not the regifting that's the issue, it's the dishonesty involved. ",
            "author": "Ipsey",
            "created_utc": 1383038963.0,
            "replies": [
                {
                    "name": "t1_cd2ohye",
                    "parent_id": "t1_cd20dtq",
                    "body": "So it sounds like that even if regifting, in itself, is not a bad thing, it's very often done poorly or without as much consideration as an original gift would have. Even if I disagree, I think that helps me understand why people might have negative feelings toward regifting. So thanks, here's a ∆ .\n\nWhere I'd still disagree, though, is whether or not it's better to tell someone that a gift is regifted. I don't think the knowledge that those pencils were regifted would help you value the gift or the person much more. But suppose you chose to regift something nice for someone, something they'd like - would their knowledge of it being a regift hinder its value?",
                    "author": "GameboyPATH",
                    "created_utc": 1383105117.0,
                    "replies": [
                        {
                            "name": "t1_cd2oizj",
                            "parent_id": "t1_cd2ohye",
                            "body": "Confirmed: 1 delta awarded to /u/Ipsey. ^[[History](/r/changemyview/wiki/Ipsey)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][[Subreddit](http://www.reddit.com/r/DeltaBot/)]",
                            "author": "DeltaBot",
                            "created_utc": 1383105194.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cd2ssov",
                            "parent_id": "t1_cd2ohye",
                            "body": "The fact that the pencils were regifted was sort of a huge insult, especially since they still had someone else's name on it. It showed that the person who gave it to me didn't put enough thought into the gift to even remove information that it was regifted, they just grabbed something and handed it over. It's the thoughtlessness in that instance that made it offensive. \n\nIf you don't want to advertise regifting, you can say something like \"when I saw this I thought of you\" and to me, the thought is stated and overt. Just remember to take off all the gift tags first :D ",
                            "author": "Ipsey",
                            "created_utc": 1383123406.0,
                            "replies": [
                                {
                                    "name": "t1_cd35xm7",
                                    "parent_id": "t1_cd2ssov",
                                    "body": "&gt;especially since they still had someone else's name on it.\n\nOuch.",
                                    "author": "GameboyPATH",
                                    "created_utc": 1383164815.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}