{
    "name": "t3_1nh3z4",
    "title": "I think There Will Be Blood is a terrible movie. CMV (Spoilers, obviously)",
    "body": "Honestly, where to even begin describing why I don't like this movie.\n\n* Characters:  Daniel Plaineview makes no fucking sense.  He seems pretty reasonable in the beginning of the film.  Sure he's a bit of a dick to Eli, but honestly, Eli is a cunt.  For some reason, Daniel just snaps and goes Heisenberg the second H.W. loses his hearing.  Daniel's character is pretty much pointless after H.W. loses his hearing.  Now onto Eli.  Eli is a little whiny bitch.  Seriously, how does he have a following?  He has the worst public speaking voice ever, honestly, he sounds like a 4 year old having a temper tantrum.  I could see him having an actual following if he had a deeper voice, or had a more Hitler style of giving sermons.  Eli doesn't really serve any purpose after Daniel bought the land.  H.W.  H.W. is pretty much just Daniel's cute face, which at least Daniel admits, but he's really not relevant to the plot in the least and doesn't even need to exist.  Henry.  What the fuck was the point of that?  If there's any characters who I missed, well, they weren't memorable then.\n\n* Plot/Narrative:  There doesn't seem to be one.  What the fuck was that ending?\n\n* Storytelling:  I don't think the people who made this movie know what story telling actually is, the entire film just seems disjointed and makes no sense.  \n\n* Music:  The music didn't really add to the movie in most cases, it just was kind of in the way.\n\nSo, there's my reasons for not liking the movie.  So many people give it such high praise, and I don't even understand why.  I checked the Wikipedia article for it and the worst reviews it got basically said \"meh.\"  I'm not even meh about this movie, I downright don't like it.",
    "author": "ProjectD13X",
    "num_comments": 21,
    "created_utc": 1380585242.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1nh3z4/i_think_there_will_be_blood_is_a_terrible_movie/",
    "comments": [
        {
            "name": "t1_cciixvk",
            "parent_id": "t3_1nh3z4",
            "body": "Here is a good explanation from someone who has watched a lot of movies: http://www.rogerebert.com/reviews/there-will-be-blood-2008 (Not saying Ebert is famous so he's right, just that sometimes a review helps you understand).\n\nAs you said it isn't a perfect movie but certainly better than a 'meh'.",
            "author": "[deleted]",
            "created_utc": 1380585929.0,
            "replies": [
                {
                    "name": "t1_ccik36d",
                    "parent_id": "t1_cciixvk",
                    "body": "Eh, that article didn't really say WHY it was good, just that it was good.  At the end he brings up some of the problems with the movie, but then just says \"FUCK THAT THOUGH, THIS IS GREAT.\"\n",
                    "author": "ProjectD13X",
                    "created_utc": 1380589205.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_ccik429",
            "parent_id": "t3_1nh3z4",
            "body": "No offense to you at all, but I think given it was a time period movie in a very specific time and place to American History, you just weren't able to fill in the gaps in the plot because you don't identify with that time period or what it led to for America. I really liked it, but one of the reasons I did was because my ancestors homesteaded in Texas, and were involved in the \"all bidness\" in the 20th Century. ",
            "author": "Jest2",
            "created_utc": 1380589272.0,
            "replies": [
                {
                    "name": "t1_ccikdwx",
                    "parent_id": "t1_ccik429",
                    "body": "So the movie is only appreciable to a very specific demographic?  That doesn't really make sense given how much critical praise it received. ",
                    "author": "ProjectD13X",
                    "created_utc": 1380590044.0,
                    "replies": [
                        {
                            "name": "t1_ccilxzm",
                            "parent_id": "t1_ccikdwx",
                            "body": "Not necessarily, it doesn't. Different people like movies for different reasons. I was just suggesting you didn't feel a connection to the plot, and maybe if you looked at it from a \"So this is what led to the popularity of the 80's hit show Dallas\" perspective. It's more interesting, IMO, if you consider the oil business culture, and what it has in common with the cut throat oil industry today. So, even though I can't change your view I was just offering a new way to look at the plot to see if it would create new meaning of the movie to you. ",
                            "author": "Jest2",
                            "created_utc": 1380594359.0,
                            "replies": [
                                {
                                    "name": "t1_ccimlnw",
                                    "parent_id": "t1_ccilxzm",
                                    "body": "I think u/dronezero's comment helps me understand it better, but thank you for your explanation",
                                    "author": "ProjectD13X",
                                    "created_utc": 1380596163.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ccikowu",
            "parent_id": "t3_1nh3z4",
            "body": "There Will Be Blood is a character study. And like in all character studies the plot is only really relevant in so far as it develops the character. So saying there isn't much of a plot isn't really a critique. There doesn't necessarily need to be one. \n\nAs far as Plainview's character. I don't see any sort of sudden shift after H.W. loss of hearing. From the very start Plainview is a ruthless business man to the point of being a sociopath. When Plainview takes H.W. initially it isn't because he cares for the child, but because he sees a way to take advantage of him to further his business. Plainview consistently shows throughout the movies that he will go to any length to make more money. And that is the purpose that Henry serves. You notice that Plainview lets Henry hang around up until the point where he threatens the business, then Plainview snaps and murders this man that we thought he had formed a loose bond with. \n\nAs for Eli, he is not supposed to be a likeable character. I am surprised that you don't think his speeches were any good as they are some of the most striking and forceful in recent memory. And despite the high pitched voice he is a very strong character and nearly as ruthless as Plainview. Being soft spoken doesn't prevent people from rising to power especially in a religion like Christianity that praises meekness. You will also notice that his parish seems to be well cowed with no particularly strong individuals. \n\nI am also quite shocked you didn't like the music. I don't think there is any way to change your view on this as it is going to come down to a matter of taste. However, myself and most other people that saw it found it was widely considered one of the best soundtracks of the year. It would have been a strong contender for the Oscar for best score, but it used non-original material.",
            "author": "dronezero",
            "created_utc": 1380590895.0,
            "replies": [
                {
                    "name": "t1_ccikxv1",
                    "parent_id": "t1_ccikowu",
                    "body": "Ah, see, I never knew what a character study was (I'm still a bit unclear on the details), but I guess that makes sense.  I guess I just don't like character studies then.",
                    "author": "ProjectD13X",
                    "created_utc": 1380591571.0,
                    "replies": []
                },
                {
                    "name": "t1_ccioh9v",
                    "parent_id": "t1_ccikowu",
                    "body": "You can have a character study without ending up in the position Blood did. \n\nI was also not a fan of the movie partially because it kind of got caught in this limbo where it couldn't decide what it wanted to be. \n\nIt started to be a character study but Plainview himself is kind of one-dimensional and doesn't present much of himself except this sociopathic desire to succeed. He also doesn't seem to have a motivation to want to do well. He does what he does for reasons the audience is unaware of in a move that seems very \"because I said so\" on the part of the screen writer.\n\nIt went partially drama but was severely disjointed and felt like long stretches of inactivity punctuated by sudden bursts of activity that jerked you out of your comfortable seat. It lept ahead a quarter century seemingly only for two scenes at the end and it felt out of place with the rest of the movie.\n\nIt sort of went the \"biopic of the oil man of early America\" route but it didn't really show much context for Plainview's actions and you only really saw things from his point of view. There wasn't much screen time given to the world so we had a place to put Plainview in context with his times.\n\nIt tried to be everything but just kinda ended up being a mishmash that was hard to digest.\n\nPlainview killing Eli was a puzzling move because Eli, while irritating, didn't threaten Plainview's interests at all, Plainview had already humiliated Eli and had absolutely nothing to gain from beating his brains in. It felt out of character for Plainview because it was such a wild, unpredictable thing to do with almost no trigger coming from a character who was presented as being incredibly calculating and controlled much of the time.\n\nThe acting was great but I think it fell flat in the writing. ",
                    "author": "HeloRising",
                    "created_utc": 1380601895.0,
                    "replies": [
                        {
                            "name": "t1_ccip0by",
                            "parent_id": "t1_ccioh9v",
                            "body": "It is not necessary to have a complex character for a character study in feature film. The character only needs to be interesting. I think that Plainview is plenty interesting. There was some ambiguity in his character that keeps you intrigued. There is obviously something to his relationship with H.W. that goes beyond simple exploitation. Saving him from the oil well and the way he cradle him afterwards shows that there is some sort feelings there. Also how he greets H.W. on his return from the school again shows that something has developed between them. Also his interactions with Henry show that he wanted some sort of human relationship otherwise he would of just sent him away after their first meeting.\n\nI didn't have any problem with the structure of the movie or the leaps in time. This is the first I've heard of anybody having issue with that as well. I don't know what else to say about that.\n\nI don't think broader context was really necessary for the film and in fact think that the intense focus on Plainview was one of its strengths. I think broadening the focus would have meant that the film would have lost its tension.\n\nI don't see Plainview killing Eli as puzzling. In fact I think it is really the only ending that would have made sense. What happens to somebody that is driven by success to sociopathic ends after they win that success? They turn on themselves and anybody around them. This is why it also showed Plainview pushing H.W. out of his life for good. ",
                            "author": "dronezero",
                            "created_utc": 1380603828.0,
                            "replies": [
                                {
                                    "name": "t1_cciqg64",
                                    "parent_id": "t1_ccip0by",
                                    "body": "&gt;It is not necessary to have a complex character for a character study in feature film. The character only needs to be interesting. I think that Plainview is plenty interesting. There was some ambiguity in his character that keeps you intrigued. There is obviously something to his relationship with H.W. that goes beyond simple exploitation. Saving him from the oil well and the way he cradle him afterwards shows that there is some sort feelings there. Also how he greets H.W. on his return from the school again shows that something has developed between them. Also his interactions with Henry show that he wanted some sort of human relationship otherwise he would of just sent him away after their first meeting.\n\nI don't see Plainview as that interesting. He's a sociopath and almost everything he does can be chalked up to some ulterior motive; the time he spends with Henry is time spent grooming an ally and a strong relationship with H.W. is to secure the boy's loyalty in future. Even if those brief, shining moments of humanity are genuine he still acts like a near total sociopath in virtually every other aspect of his life. \n\n&gt;I didn't have any problem with the structure of the movie or the leaps in time. This is the first I've heard of anybody having issue with that as well. I don't know what else to say about that.\n\nIt was a bit jarring for me because the time jump happened only once, it was for a very long time, and it seemed very tacked on. \n\n&gt;I don't think broader context was really necessary for the film and in fact think that the intense focus on Plainview was one of its strengths. I think broadening the focus would have meant that the film would have lost its tension.\n\nThe broader context would have been necessary if they were trying to show Plainview as a man of his times but they didn't really do that. I also don't think the movie had any real tension, at least it didn't come through for me. The way the movie was set up you had a strong indication throughout that Plainview was going to succeed and yes there was mild curiosity about some of the characters but most didn't stick around long enough or frequently enough to earn much notice.\n\n&gt;I don't see Plainview killing Eli as puzzling. In fact I think it is really the only ending that would have made sense. What happens to somebody that is driven by success to sociopathic ends after they win that success? They turn on themselves and anybody around them. This is why it also showed Plainview pushing H.W. out of his life for good. \n\nThat makes sense however the action in the context of the story and the character doesn't. It's an incredibly out-of-character thing for Plainview to do and for him to just suddenly snap doesn't make much sense. You don't get much context around that part of the movie to know if there's been anything else going wrong, the impression is that he's at the top of the world at the moment so why haul off and demolish someone's skull for no apparent reason? \n\nAnd his \"I'm finished\" line is a little wonky as well; he's a very, very wealthy man with probably a great deal of political connections in an era defined by corruption. Wealthy and powerful men have done far worse than he did in that situation and walked away clean. How is that one act his undoing?",
                                    "author": "HeloRising",
                                    "created_utc": 1380610415.0,
                                    "replies": [
                                        {
                                            "name": "t1_cciwoys",
                                            "parent_id": "t1_cciqg64",
                                            "body": "Plainview tells us exactly what his motivations are when he says, \"I have a competition in me. I want no one else to succeed. I hate most people.\"\n\nThat's it, right there, and all of his actions in the film - from the opening digging in the ground to the ending of murdering Eli stems from this insane view of competition and success.\n\nAnd this makes him a very interesting and dynamic character. My favorite scene is when he's standing in the raining oil, staring at the jetting stream and smiling. Why is Plainview happy? His son was just injured, this incident could have shaken trust in his outfit and business, he could have lost personnel or a fire could have spread. Look at how everyone around him is acting during this scene. They're running and working and panicking. And he's smiling. He is happy because he knows it means the well is good and will be a success, and that is all he cares about.\n\n&gt; And his \"I'm finished\" line is a little wonky as well; he's a very, very wealthy man with probably a great deal of political connections in an era defined by corruption. Wealthy and powerful men have done far worse than he did in that situation and walked away clean. How is that one act his undoing?\n\nI've never interpreted the \"I'm finished\" to refer to his undoing as a human. It his undoing as a person. He's \"finished\" being a crazy sociopath obsessed with seeing other people fail, he's finished being the person he was for the whole movie. His final interaction with Eli - one of the few people able to get to Daniel and humiliate him is the catalyst that finally calms his \"fuck everyone else\" drive. I'm sure he will continue to be successful, and has squandered his personal relationships, but he is no longer the same person who drinks other people's milkshakes.",
                                            "author": "BenIncognito",
                                            "created_utc": 1380643127.0,
                                            "replies": [
                                                {
                                                    "name": "t1_ccix5i4",
                                                    "parent_id": "t1_cciwoys",
                                                    "body": "&gt;Plainview tells us exactly what his motivations are when he says, \"I have a competition in me. I want no one else to succeed. I hate most people.\"\n\nAlright, but why? I guess it doesn't square with me because it feels very forced on the part of the character; he's that way because he's written to be that way and we have no visible explanation of why he acts the way he does except that the script calls for it.\n\n&gt;I've never interpreted the \"I'm finished\" to refer to his undoing as a human. It his undoing as a person. He's \"finished\" being a crazy sociopath obsessed with seeing other people fail, he's finished being the person he was for the whole movie. His final interaction with Eli - one of the few people able to get to Daniel and humiliate him is the catalyst that finally calms his \"fuck everyone else\" drive. I'm sure he will continue to be successful, and has squandered his personal relationships, but he is no longer the same person who drinks other people's milkshakes.\n\nBut why all of a sudden? He's directly or indirectly killed other people before and it didn't cause this revelation, Eli humiliated him before and he didn't \"see the light.\" Why does one seemingly spontaneous act of violence flip the switch?\n",
                                                    "author": "HeloRising",
                                                    "created_utc": 1380644467.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_ccixbiz",
                                                            "parent_id": "t1_ccix5i4",
                                                            "body": "&gt; Alright, but why? I guess it doesn't square with me because it feels very forced on the part of the character; he's that way because he's written to be that way and we have no visible explanation of why he acts the way he does except that the script calls for it.\n\nWe don't get much of Plainview's past, but there is some implication that his early life was difficult. He isn't even aware of his family enough that a stranger can pretend to be his half brother.\n\nBut to continue, why does any character do anything? At some point you reach a point where you have to accept, \"because that's the way he is.\" Daniel Plainview is a broken man.\n\n&gt; But why all of a sudden? He's directly or indirectly killed other people before and it didn't cause this revelation, Eli humiliated him before and he didn't \"see the light.\" Why does one seemingly spontaneous act of violence flip the switch?\n\nBecause as far as we know, there is no one else. The scene right before this one is him essentially disowning his son, then Eli visits and he enacts revenge for past humiliation. He's finished and never says what, exactly, he is finished with. My thought is that he is *literally* finished with his guest (he's talking to his servant), but that the phrase has a deeper meaning for the audience. That the man with a competition in him is gone because it has finally driven him to a murderous rage.",
                                                            "author": "BenIncognito",
                                                            "created_utc": 1380644945.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_ccj0wnu",
                                                                    "parent_id": "t1_ccixbiz",
                                                                    "body": "&gt;We don't get much of Plainview's past, but there is some implication that his early life was difficult. He isn't even aware of his family enough that a stranger can pretend to be his half brother. But to continue, why does any character do anything? At some point you reach a point where you have to accept, \"because that's the way he is.\" Daniel Plainview is a broken man.\n\nAnd that, to me, is weak writing. There are certain things you can ask an audience to accept just on faith, suspension of disbelief is a thing, but to expect the audience to jive with a main character who seemingly has no reason to be the way he is in a film like Blood is pushing it.\n\nIf you're talking something like Pulp Fiction, no Vince and Jules' motivations are not really a vital part of the story for it to be a good story or for them to be enjoyable characters. \n\nYou can also have good characters who are im/amoral to others and not have it be there solely because the script was written that way. The Operative from Serenity is a good example; one small exposition and you understand why he does what he does and it's presented in a way that makes him seem human and if not relatable than at least understandable.\n\nPlainview is sociopathic to a degree that makes him seem inhuman and it makes those small acts of humanity suspect if they're even believable. He comes off as the quintessential villain but he has the same problem as most villains in fiction; he's a rather two-dimmensional character thus a movie based solely on him is not that entertaining and attempts to humanize him seem forced.\n\n&gt;Because as far as we know, there is no one else. The scene right before this one is him essentially disowning his son, then Eli visits and he enacts revenge for past humiliation. He's finished and never says what, exactly, he is finished with. My thought is that he is literally finished with his guest (he's talking to his servant), but that the phrase has a deeper meaning for the audience. That the man with a competition in him is gone because it has finally \n\nTo me, saying as though \"I'm done with this person\" now in the literal sense like you were saying makes more sense for Plainview as a person. He's a sociopath so killing Eli means nothing. That also is kind of a let-down for an ending, making it feel a little hurried.",
                                                                    "author": "HeloRising",
                                                                    "created_utc": 1380654590.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_ccj1coy",
                                                                            "parent_id": "t1_ccj0wnu",
                                                                            "body": "&gt; And that, to me, is weak writing. There are certain things you can ask an audience to accept just on faith, suspension of disbelief is a thing, but to expect the audience to jive with a main character who seemingly has no reason to be the way he is in a film like Blood is pushing it.\n\nI disagree, why do you think Plainview doesn't have a reason to be the way he is? I don't think every character trait needs an explanation for something to be considered good writing. I don't think his *motivations* behind the things he does are necessary, as he is a believable character. I buy that a person like Plainview might have existed. My armchair psychology diagnoses would be borderline personality disorder.\n\n&gt; You can also have good characters who are im/amoral to others and not have it be there solely because the script was written that way. The Operative from Serenity is a good example; one small exposition and you understand why he does what he does and it's presented in a way that makes him seem human and if not relatable than at least understandable.\n\nYou've made me think about the scene where he tells Henry about his competitive drive a little more. And something has struck me about it, he starts out by asking Henry if he has a competitive side to him (and remember he was under the impression that Henry was his brother). This signals to me that Daniel knows something is wrong with him - and suspects a mental illness might run in the family. Like I said before, we don't get much but bits and pieces about Daniel's past, but it's clear he didn't care much for his home. Perhaps his father suffered similarly?\n\nOf course, this is only speculation on my part. But I think There Will Be Blood was a subtle film that didn't really want to provide exposition. The whole dynamic between Eli and his twin is never explained fully, but we can puzzle some bits together from the movie.\n\n&gt; Plainview is sociopathic to a degree that makes him seem inhuman and it makes those small acts of humanity suspect if they're even believable. He comes off as the quintessential villain but he has the same problem as most villains in fiction; he's a rather two-dimmensional character thus a movie based solely on him is not that entertaining and attempts to humanize him seem forced.\n\nWe're you watching a different movie than me? Plainview comes across (to me) as a tortured and lonely person who treats the world with disdain (\"I hate people\"). He can stop thinking about other people's success and it drives him crazy. He can't even take his kid to a nice meal without A) Drinking and B) Hassling the competitors who show up. I don't view him as the villain - after all he does provide the town with the wealth and prosperity he promised. He just also used up everything else so no one else could compete with him. He's not a *good* person. But I don't see anything he does as particularly malicious until he beats Eli to death.\n\n&gt; To me, saying as though \"I'm done with this person\" now in the literal sense like you were saying makes more sense for Plainview as a person. He's a sociopath so killing Eli means nothing. That also is kind of a let-down for an ending, making it feel a little hurried.\n\nI think it is clear Plainview's last words in the movie are \"I'm finished\" as though he were telling servant that he is finished seeing the guest. However, I think the writers/director were trying to go with a more broad approach to the character. He's finished with Eli, but he's also finished being the Daniel Plainview we just spent the last two and a half hours watching.",
                                                                            "author": "BenIncognito",
                                                                            "created_utc": 1380655748.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_ccj23jt",
                                                                                    "parent_id": "t1_ccj1coy",
                                                                                    "body": "&gt;I disagree, why do you think Plainview doesn't have a reason to be the way he is? I don't think every character trait needs an explanation for something to be considered good writing. I don't think his motivations behind the things he does are necessary, as he is a believable character. I buy that a person like Plainview might have existed. My armchair psychology diagnoses would be borderline personality disorder.\n\nWhen you have behavior as extreme as Plainview's tends to be, you need *something* to tell you why. Otherwise it just seems arbitrary. I don't think we need his whole life story but there is almost nothing in the film that gives you any clue as to why Plainview is the way he is.\n\n&gt;You've made me think about the scene where he tells Henry about his competitive drive a little more. And something has struck me about it, he starts out by asking Henry if he has a competitive side to him (and remember he was under the impression that Henry was his brother). This signals to me that Daniel knows something is wrong with him - and suspects a mental illness might run in the family. Like I said before, we don't get much but bits and pieces about Daniel's past, but it's clear he didn't care much for his home. Perhaps his father suffered similarly?\n\nMaybe, but I think that's a lot to draw from one question. He could just as easily been sizing his \"brother\" up to see if he would be a threat.\n\n&gt;We're you watching a different movie than me? Plainview comes across (to me) as a tortured and lonely person who treats the world with disdain (\"I hate people\"). He can stop thinking about other people's success and it drives him crazy. He can't even take his kid to a nice meal without A) Drinking and B) Hassling the competitors who show up. I don't view him as the villain - after all he does provide the town with the wealth and prosperity he promised. He just also used up everything else so no one else could compete with him. He's not a good person. But I don't see anything he does as particularly malicious until he beats Eli to death.\n\nLonely I'll buy but he comes off more as a sociopath who puts his own needs and wants ahead of everything and everyone else. He does provide for people but it seems like more of a business transaction, buying goodwill so he can continue drilling, rather than genuine altruism. He's willing to try and cheat Eli's family out of their property, he uses HW, I'm pretty sure that qualifies as malicious.\n\n",
                                                                                    "author": "HeloRising",
                                                                                    "created_utc": 1380657628.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ccin322",
            "parent_id": "t3_1nh3z4",
            "body": "The movie is all about Plainview's charater so if you don't understand him, the movie can be quite a snoozer.  What you have to understand first is that he's a Type A personality to the extreme. Another way to describe Plainview might be a sociopath.  If you are more of a Type B person, and have never had a relationship with a Plainview kind of person, you are probablly not going to like or relate to the character. \n\n&gt;H.W. is pretty much just Daniel's cute face, which at least Daniel admits, but he's really not relevant to the plot in the least and doesn't even need to exist.\n\nHW is extremely important to the movie because HW brings out Plainview's humanity. He geinuinely cares for the child, and he is devasted when he causes him to lose his hearing. Thus the scene in the church where Eli makes him confess... \n",
            "author": "grlthng",
            "created_utc": 1380597507.0,
            "replies": [
                {
                    "name": "t1_cciw8ih",
                    "parent_id": "t1_ccin322",
                    "body": "I think you're misreading the confession scene.  Daniel had been unable to purchase the land from Bandy, a devout member of Eli's church.  He only agreed to consider selling it if Daniel would join the church.  Eli then, in Daniel's mind, humiliated him by putting him through the confession.  He never actually buys the land and the land is left to the church when Bandy dies.  He gets the oil another way.  \"I drink your milkshake!\"  then returns the favor to Eli by making him deny God when Eli comes to him in desperation trying to sell the land.",
                    "author": "eye_patch_willy",
                    "created_utc": 1380641788.0,
                    "replies": []
                }
            ]
        }
    ]
}