{
    "name": "t3_1hie6y",
    "title": "I believe that Zimmerman's belief that his life was in danger was unreasonable. CMV.",
    "body": "Zimmerman states that Trayvon confronted him, after Trayvon's girlfriend had said Trayvon got close to his dad's girlfriends house, and attacked Zimmerman. While this doesn't make sense to me, I will admit that it is plausible this is how it happened. What doesn't seem plausible to me, is that a man who was taking MMA classes three times a week, had no means to defend himself while pinned downed in a ground and pound position, which is stated as being an MMA position. What seems even less plausible to me is that Trayvon was all at once suffocating Zimmerman, slamming his head against the ground, and reaching for Zimmerman's gun while telling Zimmerman, \"you're going to die tonight.\" What would compel Trayvon, a kid who had really only ever gotten in trouble for smoking weed, to decide to kill a man he didn't know?",
    "author": "bingsearchforever",
    "num_comments": 127,
    "created_utc": 1372787795.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1hie6y/i_believe_that_zimmermans_belief_that_his_life/",
    "comments": [
        {
            "name": "t1_caumnu6",
            "parent_id": "t3_1hie6y",
            "body": "I don't follow the case but I can suggest a couple points based off of what you talked about\n\n&gt;What doesn't seem plausible to me, is that a man who was taking MMA classes three times a week, had no means to defend himself while pinned downed in a ground and pound position\n\nThere is an immense difference between training and what you perceive as a life or death situation. You are going to be running off of instinct, it's like how a drowning man will try to pull down someone who is trying to save him. Also, I've heard that since there aren't any certifications for martial arts, it's a big issue that there are scams which aren't really teaching anything useful but this was from a cracked article so take it with a grain of salt.\n\n&gt;What seems even less plausible to me is that Trayvon was all at once suffocating Zimmerman, slamming his head against the ground, and reaching for Zimmerman's gun while telling Zimmerman, \"you're going to die tonight.\" \n\nWell the thing is, Trayvon probably wasn't but that doesn't mean Zimmerman is lying. He was placed in a high stress situation and it isn't unreasonable that he could have thought trayvon was reaching for his gun for whatever reason. In hindsight, this might not have been true but self-defense claims don't require him to have perfect knowledge of the situation.",
            "author": "Daedalus1907",
            "created_utc": 1372788975.0,
            "replies": []
        },
        {
            "name": "t1_caunbp5",
            "parent_id": "t3_1hie6y",
            "body": "&gt; What doesn't seem plausible to me, is that a man who was taking MMA classes three times a week\n\nIt sounds like he just started, although I can't find a good source for this. One headline said \"In the weeks before the shooting,\" but I can't find out exactly what they mean. Let's say that's about a month.\n\nI don't think you can reliably escape mount after 12 mma classes against a stronger opponent in a stressful situation. I don't think you could do so after 12 classes of straight ground grappling where you had spend a fair portion of the time on obtaining/escaping mount. \n\n&gt; What seems even less plausible to me is that Trayvon was all at once suffocating Zimmerman, slamming his head against the ground, and reaching for Zimmerman's gun while telling Zimmerman, \"you're going to die tonight.\" \n\nI'm sitting on your chest, which makes it a bit harder to breath to begin with. I grab your neck with my right hand and pound your head on the ground. I reach for your gun with my left hand. My mouth is still free for trash talking. \n\nI doubt that he would be simultaneously choking and slamming GZ; most likely did one, then the other. If I was choking you and you moved your head forward, I could slam you back down, but you wouldn't want to do that because moving your head forward would put even more pressure on your throat.\n\n&gt; What would compel Trayvon, a kid who had really only ever gotten in trouble for smoking weed, to decide to kill a man he didn't know?\n\nMaybe he's done more bad stuff than that. Weed was just the only thing he got caught for. \n\nI suspect he probably just wanted to beat up GZ, but once the gun came into play he figured \"kill or be killed.\" ",
            "author": "white_soupremacist",
            "created_utc": 1372790656.0,
            "replies": [
                {
                    "name": "t1_cauphni",
                    "parent_id": "t1_caunbp5",
                    "body": "&gt; I suspect he probably just wanted to beat up GZ, but once the gun came into play he figured \"kill or be killed.\" \n\nIf that's true, Zimmerman is the one who escalated the situation and Martin was the one acting in self-defense.",
                    "author": "BlackHumor",
                    "created_utc": 1372796122.0,
                    "replies": [
                        {
                            "name": "t1_caupmcb",
                            "parent_id": "t1_cauphni",
                            "body": "&gt; If that's true, Zimmerman is the one who escalated the situation and Martin was the one acting in self-defense.\n\nThis in itself doesn't make sense:\n\nSomeone comes into your home to rob you. He's armed only with a baseball bat. You live in a castle doctrine state, so you pull out your firearm. He runs towards you with the bat. You shoot him. \n\nUnder your legal analysis, did you escalate the situation and therefore the robber is acting in self defense? Or is his prior act (of invading your house) the cause the matter?",
                            "author": "cosimothecat",
                            "created_utc": 1372796457.0,
                            "replies": [
                                {
                                    "name": "t1_cauq8sg",
                                    "parent_id": "t1_caupmcb",
                                    "body": "http://thecriminallawyer.tumblr.com/post/24691276257/15-self-defense-it-was-him-or-me\n\nYou just gave a very anomalous situation there. A baseball bat is certainly capable of killing someone, and it happened in your house, so in this case you are justified. You didn't even escalate the situation, since the baseball bat was already \"deadly force\", or at least I'd say it was.\n\nIf someone hits you with no weapon, as Zimmerman alleged Martin did, it's absolutely not justified to pull a gun on them.",
                                    "author": "BlackHumor",
                                    "created_utc": 1372798059.0,
                                    "replies": [
                                        {
                                            "name": "t1_cauqd3a",
                                            "parent_id": "t1_cauq8sg",
                                            "body": "&gt; If someone hits you with no weapon, as Zimmerman alleged Martin did, it's absolutely not justified to pull a gun on them.\n\nWhat if that person was Mike Tyson? Not being flippant here - but obvious Mike Tyson's fists qualify as deadly weapon.\n\nWould a reasonable person, in Zimmerman's situation, believe that his life is in danger? I don't know - because the **case is not fully presented yet**. ",
                                            "author": "cosimothecat",
                                            "created_utc": 1372798367.0,
                                            "replies": [
                                                {
                                                    "name": "t1_caurhj9",
                                                    "parent_id": "t1_cauqd3a",
                                                    "body": "Treyvon Martin was not Mike Tyson.\n\nTo say that fists qualify as \"deadly force\" in general makes a mockery of the whole concept of \"non-deadly force\". The concept exists in law for a reason.",
                                                    "author": "BlackHumor",
                                                    "created_utc": 1372801426.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_caurw1x",
                                                            "parent_id": "t1_caurhj9",
                                                            "body": "You seem to feel there is a specific legal definition for \"deadly force\" but this differs between states and is often left to the discretion of the DA and a jury.  \n\nIn any case ... fists often do legally qualify as deadly force in a number of situations.      \n\nA young man against an old woman?        \nFists will almost certainly be seen as deadly force by the court.   \n\n5 young men against another young man?       \nOne man on top of another, on a concrete surface?    \n\nIt could be decided either way.     \nThis is where the discretion comes in.      \n\nIt can be surprisingly subjective. \n\nI can assure you that there is absolutely not a well defined and objective definition of what constitutes lethal force.",
                                                            "author": "akai_ferret",
                                                            "created_utc": 1372802555.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "name": "t1_cautyr8",
                                                            "parent_id": "t1_caurhj9",
                                                            "body": "Maybe we are losing sight of something here. According to Zimmerman, Martin verbally threatened to kill him. If (and this is a big if) we believe him, then wouldn't that argue that pulling a gun is proportional? \n\nThe jury's decision will in part rest on whether they believe Zimmerman was reasonable in his beliefs. ",
                                                            "author": "cosimothecat",
                                                            "created_utc": 1372808682.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cavdpsk",
                                                                    "parent_id": "t1_cautyr8",
                                                                    "body": "I think the court case was over before it started.  The burden of proof is very low for the defense.  As long as the jury thinks there's a reasonable possibility Zimmerman's account is true he will be found not guilty.   All evidence presented so far by the prosecution either supports Zimmerman's version or fails to contradict it.  ",
                                                                    "author": "AsterJ",
                                                                    "created_utc": 1372880886.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "name": "t1_causk3i",
                                            "parent_id": "t1_cauq8sg",
                                            "body": "[deleted]",
                                            "author": "[deleted]",
                                            "created_utc": 1372804482.0,
                                            "replies": [
                                                {
                                                    "name": "t1_causna0",
                                                    "parent_id": "t1_causk3i",
                                                    "body": "&gt;I would feel completely justified in using a firearm to defend myself against a person who was attempting to punch me, even if they had not yet laid a single hand on me.\n\nYou would *certainly* go to jail for that. You would *certainly* be convicted. This is not even disputable; if you shoot someone who was merely *attempting* to punch you any jury in the world would convict you.\n\nYou need to have a reasonable belief that your life is in danger. The mere fact that it's possible to beat someone to death doesn't mean it's reasonable to shoot anyone who throws a punch at you.",
                                                    "author": "BlackHumor",
                                                    "created_utc": 1372804734.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cauukxk",
                                                            "parent_id": "t1_causna0",
                                                            "body": "&gt; You would certainly go to jail for that. You would certainly be convicted. This is not even disputable; if you shoot someone who was merely attempting to punch you any jury in the world would convict you.\n\nAnd you are *certainty* wrong. To quote Florida's Self-Defense Law FL 782.02:\n\n&gt; The use of deadly force is justifiable when a person is resisting any attempt to murder such person **or to commit any felony upon him or her** or upon or in any dwelling house in which such person shall be.\n\nSo long as that bunch is thrown in aid of a felony committed upon him, he may draw his gun. ",
                                                            "author": "cosimothecat",
                                                            "created_utc": 1372810581.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cauutzf",
                                                                    "parent_id": "t1_cauukxk",
                                                                    "body": "Neither assault nor battery is automatically a felony.\n\nhttp://www.leg.state.fl.us/Statutes/index.cfm?App_mode=Display_Statute&amp;Search_String=&amp;URL=0700-0799/0784/Sections/0784.03.html",
                                                                    "author": "BlackHumor",
                                                                    "created_utc": 1372811341.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "name": "t1_cavbz9r",
                                                            "parent_id": "t1_causna0",
                                                            "body": "I'm an attorney and a rock star, but not your attorney so this isn't legal advice, but you are incorrect.  It is reasonable to defend yourself against a near certain forceful attack.  It's not up to the victim to risk surviving an assault to see if post hoc if self defense was necessary.  Don't start fights.  ",
                                                            "author": "[deleted]",
                                                            "created_utc": 1372876393.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "name": "t1_cavbwtm",
                                            "parent_id": "t1_cauq8sg",
                                            "body": "That's absolutely incorrect.  Hitting someone with force is absolutely a reasonable threat to their life or causing serious bodily injury.  Human beings are fragile.  The movies of people taking hit after hit and never having serious injury are a fantasy.\n\nYou strike someone with force and without adequate provocation and you are taking your own life in your hands.  It's not up to the victim to hope that he doesn't get injured.  It's your risk, you take it.    \n",
                                            "author": "[deleted]",
                                            "created_utc": 1372876220.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_cauqajh",
                                    "parent_id": "t1_caupmcb",
                                    "body": "This reasoning breaks down when you consider that Zimmerman was the person who initiated the encounter in the first place, by stalking Martin and continuing to do so against direct orders by authorities.",
                                    "author": "HiroariStrangebird",
                                    "created_utc": 1372798188.0,
                                    "replies": [
                                        {
                                            "name": "t1_cauqglb",
                                            "parent_id": "t1_cauqajh",
                                            "body": "FWIW, the operator said he didn't have to follow him, not \"Stop following him\". Could go either way.",
                                            "author": "djpaulross2",
                                            "created_utc": 1372798611.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cavz2wp",
                                                    "parent_id": "t1_cauqglb",
                                                    "body": "he said \"we don't need for you to do that\"",
                                                    "author": "chefontheloose",
                                                    "created_utc": 1372964462.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "name": "t1_cauqht4",
                                            "parent_id": "t1_cauqajh",
                                            "body": "&gt; Zimmerman was the person who initiated the encounter in the first place\n\nThe 'initiation of encounter' itself doesn't justify anything. Martin's state of mind on being followed matters. Did he think his life was in danger? Of course, unfortunately, Martin is dead so we can't ask him. Hence, there's a real question for the Jury to decide. But just because Zimmerman 'initiated' the encounter doesn't *in itself* justify his guilt. \n\n&gt; continuing to do so against direct orders by authorities.\n\nThe dispatcher told zimmerman that he doesn't need to follow martin. He wasn't 'directly ordered'. Furthermore, it's questionable whether dispatcher can issue authoritative commands. ",
                                            "author": "cosimothecat",
                                            "created_utc": 1372798699.0,
                                            "replies": []
                                        },
                                        {
                                            "name": "t1_cauql39",
                                            "parent_id": "t1_cauqajh",
                                            "body": "A 911 operator isn't an authority who can give someone direct orders.\n\nThe job requires a High School diploma and some in-service training.\n\nThey are not law enforcement officers and have no standing to tell you want you can and can't do.\n\nhttp://agency.governmentjobs.com/naplesfl/default.cfm?action=viewJob&amp;jobID=677388",
                                            "author": "mrrp",
                                            "created_utc": 1372798938.0,
                                            "replies": []
                                        },
                                        {
                                            "name": "t1_caure5x",
                                            "parent_id": "t1_cauqajh",
                                            "body": "Except there is no evidence that Zimmerman kept following Martin after insctructed that it wasn't necessary. ",
                                            "author": "svengalus",
                                            "created_utc": 1372801162.0,
                                            "replies": [
                                                {
                                                    "name": "t1_caurlql",
                                                    "parent_id": "t1_caure5x",
                                                    "body": "...except the fact that if he hadn't followed Martin none of this would have happened?",
                                                    "author": "BlackHumor",
                                                    "created_utc": 1372801751.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_caurstx",
                                                            "parent_id": "t1_caurlql",
                                                            "body": "You can't possibly have evidence for what would have happened if things were different. We have to look at the actual real-world evidence.",
                                                            "author": "svengalus",
                                                            "created_utc": 1372802303.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_causlau",
                                                                    "parent_id": "t1_caurstx",
                                                                    "body": "No, I'm saying, if he had not followed Martin after he was instructed not to none of this would have happened. He would not have gotten out of his car, he would not have encountered Martin, Martin would still be alive and Zimmerman would not be on trial for murder.\n\nThe very fact that a crime occurred is itself proof that he ignored the instructions of the dispatcher and followed Martin.",
                                                                    "author": "BlackHumor",
                                                                    "created_utc": 1372804578.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_causxg3",
                                                                            "parent_id": "t1_causlau",
                                                                            "body": "&gt; The very fact that a crime occurred is itself proof that he ignored the instructions of the dispatcher and followed Martin.\n\nUnless Zimmerman stopped following Martin and Martin was following Zimmerman.\n\n",
                                                                            "author": "babooshkayaya",
                                                                            "created_utc": 1372805551.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_cauuln3",
                                                                                    "parent_id": "t1_causxg3",
                                                                                    "body": "But Zimmerman was in his car when making the call, and he was not in his car when the incident happened. He had to have gotten out and followed Martin further.",
                                                                                    "author": "BlackHumor",
                                                                                    "created_utc": 1372810640.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "name": "t1_caut5rf",
                                                            "parent_id": "t1_caurlql",
                                                            "body": "And if Martin had gone straight home or stayed at home none of this would have happened either.  None of that  really matters because none of them are acts of aggression or provocation.    What matters is who initiated the physical conflict.",
                                                            "author": "HeveStolt",
                                                            "created_utc": 1372806226.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "name": "t1_cav4ico",
                                                            "parent_id": "t1_caurlql",
                                                            "body": "\"and you wouldn't have been raped if you stopped drinking when I told you to.\"",
                                                            "author": "[deleted]",
                                                            "created_utc": 1372852733.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "name": "t1_cavz2bt",
                                                    "parent_id": "t1_caure5x",
                                                    "body": "there is evidence, he said it himself in the video reeinactment with police. He gets to the T tells them an address and he says something like, when I was back there they said \"we don't need you to do that\"about following TM, but he kept walking because he was determined to give his location, even though his truck was parked in a cul de sac right by the clubhouse, the police would have easily spotted it. TM didn't know that was what GZ was doing because GZ never tried to identify himself to the teen. \n\nIf it were me, I would have yelled in the direction I saw this kid go \"I am with the neighborhood watch, the police are on their way\" and kept my ass in the car until the real police showed up. ",
                                                    "author": "chefontheloose",
                                                    "created_utc": 1372964408.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "name": "t1_cauwdz1",
                                            "parent_id": "t1_cauqajh",
                                            "body": "That's not what happened. First of all, they asked him to stop following Trayvon for the sake of Zimmerman's safety, not Trayvon's. \n\nSecond, Zimmerman did in fact stop following him when they asked him to. If you listen to the full recording, Zimmerman actually says \"ok\" when they tell him that he doesn't need to follow.\n\nAlso, being followed isn't justification for hitting someone. Unless Zimmerman threw the first punch, Trayvon initiated the encounter. And honestly I see no reason why Zimmerman would hit him. What reason does he have? What is the motive? If he had intended to kill the kid all along then why would he have called the police?",
                                            "author": "JKoots",
                                            "created_utc": 1372816109.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_cauprib",
                            "parent_id": "t1_cauphni",
                            "body": "I'm not sure that's true. If you start a fight and someone ends up dead, the state tends to take a dim view.",
                            "author": "white_soupremacist",
                            "created_utc": 1372796816.0,
                            "replies": [
                                {
                                    "name": "t1_caupxsz",
                                    "parent_id": "t1_cauprib",
                                    "body": "http://thecriminallawyer.tumblr.com/post/24691276257/15-self-defense-it-was-him-or-me\n\nIf you escalate a fight to deadly force, you're responsible if someone dies EVEN IF you weren't the one who started the fight in the first place.",
                                    "author": "BlackHumor",
                                    "created_utc": 1372797261.0,
                                    "replies": [
                                        {
                                            "name": "t1_cauqa79",
                                            "parent_id": "t1_caupxsz",
                                            "body": "True. The question turns on how the gun came into play. If you attack someone with a gun and decide you have to take the gun from him and shoot him, you've escalated the fight to deadly force. Even if you didn't notice the gun, then noticed it and got scared and decided to try to take it, you were still the escalator. ",
                                            "author": "white_soupremacist",
                                            "created_utc": 1372798163.0,
                                            "replies": []
                                        },
                                        {
                                            "name": "t1_cauryqf",
                                            "parent_id": "t1_caupxsz",
                                            "body": "Actually this can vary significantly by state.    \n\nHow it is in Ohio might not be the same as in Texas.      \nHow it is in Californa will almost certainly not be how it is in Florida. ",
                                            "author": "akai_ferret",
                                            "created_utc": 1372802772.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_caupy07",
                            "parent_id": "t1_cauphni",
                            "body": "Not if Zimmerman's story is true and Martin confronted and attacked him while Zimmerman was walking back to his vehicle.  Martin would be the aggressor, and him seeing Zimmerman's firearm during the beating couldn't possibly be considered Zimmerman escalating, since he didn't expose his firearm intentionally and didn't confront or attack Trayvon in the first place.\n\nThat would be like someone jumping you, beating you, during the beating they see you have a pocket knife, they pull it out of your pocket and stab you with it claiming self defense because you escalated the fight they started by unintentionally allowing your pocket knife to become visible.",
                            "author": "LogicalWhiteKnight",
                            "created_utc": 1372797278.0,
                            "replies": [
                                {
                                    "name": "t1_cauqbos",
                                    "parent_id": "t1_caupy07",
                                    "body": "http://thecriminallawyer.tumblr.com/post/24691276257/15-self-defense-it-was-him-or-me\n\nZimmerman's story does indeed justify his actions. It's also almost certainly not true, because it's so perfectly crafted to fit the legal requirements of self-defense it strains belief.",
                                    "author": "BlackHumor",
                                    "created_utc": 1372798271.0,
                                    "replies": [
                                        {
                                            "name": "t1_cauqlq8",
                                            "parent_id": "t1_cauqbos",
                                            "body": "Given that Zimmerman did study criminal justice, and had a concealed carry permit, he probably knew the justification for the use of lethal force.\n\nIt could go one of two ways, either he is using that knowledge to lie and craft a false story that justified his use of lethal force (and he would have had to come up with that story in the 30 seconds before the cops showed up), or he used that knowledge to ensure he was justified before drawing his firearm, so he is telling the truth and his story perfectly fits the justification for self defense because he made sure he was acting in accordance with the law at the time of the shooting.\n\nWe can't assume he is lying because his story perfectly meets the legal justification for the use of lethal force... that is ridiculous, it's just as likely that he was actually justified because he knows the law and didn't want to break it.",
                                            "author": "LogicalWhiteKnight",
                                            "created_utc": 1372798985.0,
                                            "replies": [
                                                {
                                                    "name": "t1_caurgh6",
                                                    "parent_id": "t1_cauqlq8",
                                                    "body": "I find it much more plausible that he thought up a story in 30 seconds (actually quite a bit more than that because he didn't give the whole story at the scene, but whatever) then he thought of it in the 5 seconds between when Martin would've reached for his firearm and when he shot him.\n\nEven people who know the law don't think THAT fast.",
                                                    "author": "BlackHumor",
                                                    "created_utc": 1372801344.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cauxmcv",
                                                            "parent_id": "t1_caurgh6",
                                                            "body": "If he thought up the story in 30 seconds he did an exceptional job at it. Not only did he keep his story straight, but it's supported by eye witnesses and evidence he didn't even know existed at the time. ",
                                                            "author": "WangEnlargement",
                                                            "created_utc": 1372819804.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_cauu7td",
                            "parent_id": "t1_cauphni",
                            "body": "No, lethal force is authorized in nearly every state even if the attacker is \"unarmed\". Especially so when the suspect is beating your head onto the sidewalk. ",
                            "author": "Woods_of_Ypres",
                            "created_utc": 1372809450.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cauwsi8",
                            "parent_id": "t1_cauphni",
                            "body": "[deleted]",
                            "author": "[deleted]",
                            "created_utc": 1372817314.0,
                            "replies": [
                                {
                                    "name": "t1_cav3xqq",
                                    "parent_id": "t1_cauwsi8",
                                    "body": "The murder charge seems fine to me.\n\nThe manslaughter charge seems certain to stick, but the murder charge seems strong enough to be worth charging as well. ",
                                    "author": "BlackHumor",
                                    "created_utc": 1372848685.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_caunky6",
            "parent_id": "t3_1hie6y",
            "body": "&gt;What doesn't seem plausible to me, is that a man who was taking MMA classes three times a week, had no means to defend himself while pinned downed in a ground and pound position, which is stated as being an MMA position.\n\nTaking martial arts classes doesn't automatically make one a cage fighter. Keep in mind that while he may have been taking some classes, his primary motivation was exercise, not training to beat the snot out of the first kid to look at him the wrong way. He may have been taking classes, but he also presumably had little to no actual fight experience.\n\n&gt;What seems even less plausible to me is that Trayvon was all at once suffocating Zimmerman, slamming his head against the ground, and reaching for Zimmerman's gun while telling Zimmerman, \"you're going to die tonight.\" What would compel Trayvon, a kid who had really only ever gotten in trouble for smoking weed, to decide to kill a man he didn't know?\n\nWho knows? I'd rather not speculate on what Trayvon may motivated Travyon Martin to do what he did. There are two witnesses here. One is dead and the other can't be compelled to testify.\n\nWhat I do know though, is that the kind of injuries inflicted upon Mr. Zimmerman could very easily be considered life threatening. A broken nose gushes blood and when face up on the ground that blood is going to go straight down the persons throat and into their lungs which can cause suffocation (Mark O'Mara brought this up on re-re-cross this morning). This is why, in the event of a bloody nose, it's best to pinch the nose at the bridge and lean *forward* rather than *backward*. Blood is affected by gravity after all.\n\nFurthermore, trauma to the back of the skull can cause a concussion which can also prove life threatening. A soccer referee was recently killed as a result of being punched in the head by a disgruntled soccer player.\n\nMr. Zimmerman sustained these injuries and all accounts seem to indicate that they were inflicted by Trayvon Martin.",
            "author": "[deleted]",
            "created_utc": 1372791302.0,
            "replies": []
        },
        {
            "name": "t1_caunxqa",
            "parent_id": "t3_1hie6y",
            "body": "&gt;That doesn't seem plausible to me, is that a man who was taking MMA classes three times a week\n\nHe was a white belt which amounts to jack shit. Zimmerman was also in terrible shape at the time of the encounter. \n\n",
            "author": "Woods_of_Ypres",
            "created_utc": 1372792214.0,
            "replies": [
                {
                    "name": "t1_caupswz",
                    "parent_id": "t1_caunxqa",
                    "body": "I spent 13 years taking self-defense classes. We have a saying \"Black belt means you hit yourself less.\" I'm not saying that the belt system is meaningless, but it is also not the absolute standard of proficiency. I have no doubt that there are some green belts out there that can easily handle black belts. But a white belt really does amount to jack shit.",
                    "author": "[deleted]",
                    "created_utc": 1372796915.0,
                    "replies": [
                        {
                            "name": "t1_caut8b3",
                            "parent_id": "t1_caupswz",
                            "body": "If this is true, Zimmerman should have been reasonable at self-defense.  Belts don't really matter much anyways - there are black belts that suck and white belts/beginners that already have great basics.  Plus MMA doesn't have a belt system.",
                            "author": "Goat_Porker",
                            "created_utc": 1372806443.0,
                            "replies": [
                                {
                                    "name": "t1_cauu6uz",
                                    "parent_id": "t1_caut8b3",
                                    "body": "A white belt with only a couple weeks of training like Zimmerman isn't going to beat a football playing street thug like Trayvon unless he gets really lucky. \n\n&gt; Plus MMA doesn't have a belt system.\n\nI'm 90% sure he studied Brazilian Ju-Jitsu ",
                                    "author": "Woods_of_Ypres",
                                    "created_utc": 1372809366.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_caup3cy",
            "parent_id": "t3_1hie6y",
            "body": "&gt;is that a man who was taking MMA classes three times a week\n\nThe defense is going to call his mma instructor who will testify about zimmermans abilities.\n\n&gt;What seems even less plausible to me is that Trayvon was all at once suffocating Zimmerman\n\nThe medical expert said today that the feeling of suffocation couldve been caused by the blood from his broken nose essentially drowning him.\n\n&gt;a kid who had really only ever gotten in trouble for smoking weed\n\nCharacter evidence about Trayvon is not being allowed in this case. If it were you would be able to read his tweets where he discusses fist fights he has been in, and you would learn that he was caught with tools commonly used in burglaries and women's jewelry in his backpack.",
            "author": "ofimmsl",
            "created_utc": 1372795098.0,
            "replies": [
                {
                    "name": "t1_cauqo1h",
                    "parent_id": "t1_caup3cy",
                    "body": "Why aren't they allowing character evidence? Seems kind of important.",
                    "author": "[deleted]",
                    "created_utc": 1372799155.0,
                    "replies": [
                        {
                            "name": "t1_cauqxex",
                            "parent_id": "t1_cauqo1h",
                            "body": "Apparently it may become usable if the prosecution tries to paint Martin's character in a positive manner. They also mentioned that because the prosecution brought up MMA, the defense may be able to bring up Martin's history with starting (organized) fights.",
                            "author": "Krazy19Karl",
                            "created_utc": 1372799882.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cavjf1d",
                            "parent_id": "t1_cauqo1h",
                            "body": "Because neither the assailant nor the victim in this case knew anything about each other.",
                            "author": "ChiefBigBlockPontiac",
                            "created_utc": 1372897938.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cav5o6t",
                    "parent_id": "t1_caup3cy",
                    "body": "&gt;The defense is going to call his mma instructor who will testify about zimmermans abilities.\n\nIts a smart move for the defense, but that can't be a great feeling to have a martial arts instructor stand in front of the entire nation and testify that you're a wuss.  Better than jail I suppose.",
                    "author": "hooraah",
                    "created_utc": 1372858341.0,
                    "replies": []
                },
                {
                    "name": "t1_cavyw0v",
                    "parent_id": "t1_caup3cy",
                    "body": "please give a link to this information",
                    "author": "chefontheloose",
                    "created_utc": 1372963855.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_caup6pg",
            "parent_id": "t3_1hie6y",
            "body": "&gt;What doesn't seem plausible to me, is that a man who was taking MMA classes three times a week\n\nFirst, he had only just started taking classes.\n\nSecond, classes in any martial art, even at an advanced level, are a poor substitute for real life fighting experience. \n\nThird, he was not (and still isn't) a picture of physical fitness. While he did weigh more than Martin did, it was all fat. Martin was a lean 150 lbs and was almost half a foot taller.\n\n&gt;What seems even less plausible to me is that Trayvon was all at once suffocating Zimmerman, slamming his head against the ground, and reaching for Zimmerman's gun while telling Zimmerman, \"you're going to die tonight.\" \n\nI don't think the claim is that these things all happened at the same time, but rather happened independently over the course of the altercation. \n\n&gt;What would compel Trayvon, a kid who had really only ever gotten in trouble for smoking weed, to decide to kill a man he didn't know?\n\nThe only person that knows that is dead. The claim about Trayvon reaching for Zimmerman's gun while telling Zimmerman, \"you're going to die tonight\" isn't really verifiable. However, it is verifiable that he at least assaulted Zimmerman at some point.\n\nOne hard punch in the right part of the head (the temple especially) or repeated punches to the head can absolutely cause serious brain damage or death. Someone kneeling on top of you punching you in the head is absolutely a threat to your life. And someone that is threatening your life can absolutely be shot in self-defense",
            "author": "Akula765",
            "created_utc": 1372795335.0,
            "replies": [
                {
                    "name": "t1_caus15f",
                    "parent_id": "t1_caup6pg",
                    "body": "&gt;a poor substitute for real life fighting experience.\n\nWhich is something Martin did have *and* tweeted about.  ",
                    "author": "akai_ferret",
                    "created_utc": 1372802966.0,
                    "replies": [
                        {
                            "name": "t1_cauyb6p",
                            "parent_id": "t1_caus15f",
                            "body": "&gt; Which is something Martin did have and tweeted about.\n\nWhich still means jack shit, the law can't say, oh you have some fighting experience, well you're not entitled to the same right as the rest of the population when it comes to self defense.",
                            "author": "insaneHoshi",
                            "created_utc": 1372821872.0,
                            "replies": [
                                {
                                    "name": "t1_cav1ozz",
                                    "parent_id": "t1_cauyb6p",
                                    "body": "There is a reason why \"reasonable\" is not a stated list of bullet points within the law, and that is because it goes by each person. If it could be shown that someone has fighting experience and would have been capable of breaking free of such a situation (pinned on the floor), then it is *not* reasonable for them to use deadly force. \n\nOn the other hand, if someone does not have such experience and does not know how to break free, then it *might* be reasonable for them. ",
                                    "author": "DeadOptimist",
                                    "created_utc": 1372833606.0,
                                    "replies": [
                                        {
                                            "name": "t1_cav1xf3",
                                            "parent_id": "t1_cav1ozz",
                                            "body": "So you agree that it depends on person to person and not what they tweet\n",
                                            "author": "insaneHoshi",
                                            "created_utc": 1372834855.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cav31oj",
                                                    "parent_id": "t1_cav1xf3",
                                                    "body": "&gt; So you agree that it depends on person to person\n\nYes\n\n&gt; and not what they tweet\n\nWhich may effect how you treat a case, person by person. If someone claims to have fighting experience, and if they are enrolled in fighting classes, and if they do other activities which seem to indicate a degree of competence in handling confrontation, then all of this needs to be taken into account to determine what is 'reasonable\" for them.",
                                                    "author": "DeadOptimist",
                                                    "created_utc": 1372841769.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cauzqxx",
                    "parent_id": "t1_caup6pg",
                    "body": "He was 3 inches taller, for the record. ",
                    "author": "Scubetrolis",
                    "created_utc": 1372826291.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cauppc6",
            "parent_id": "t3_1hie6y",
            "body": "The case is currently still in process with evidences still being presented. How exactly can your belief be based on the full facts of the case? ",
            "author": "cosimothecat",
            "created_utc": 1372796666.0,
            "replies": []
        },
        {
            "name": "t1_caupvl3",
            "parent_id": "t3_1hie6y",
            "body": "&gt;Zimmerman states that Trayvon confronted him, after Trayvon's girlfriend had said Trayvon got close to his dad's girlfriends house, and attacked Zimmerman.\n\nOne thing to note here, the confrontation occurred right by the T according to an ear witness, not by Trayvon's house.  It was about 100 yards from Trayvon's house, and closer than that to Zimmerman's car, and right about the same spot where Zimmerman initially lost sight of Trayvon, but a few minutes later.\n\nSo, if Rachel is telling the truth and Trayvon made it to right outside his house, he had to double back about 100 yards to make it to the spot where the confrontation occurred.  That tells us Zimmerman wasn't following him all that time, or the confrontation would have occurred sooner and closer to Trayvon's house.\n\n&gt;What doesn't seem plausible to me, is that a man who was taking MMA classes three times a week, had no means to defend himself while pinned downed in a ground and pound position, which is stated as being an MMA position. \n\nHe isn't required to defend himself.  He was calling for help and trying to escape.  There is no legal requirement that you punch someone before using lethal force in necessary self defense.  Also, his MMA training was for a workout, not for self defense.  He was not skilled in fighting.\n\n&gt;What would compel Trayvon, a kid who had really only ever gotten in trouble for smoking weed, to decide to kill a man he didn't know?\n\nWe don't need a motive for Trayvon, he isn't accused of a crime.  All that matter is whether Zimmerman's story is plausible, and I think it is.  Maybe Trayvon was just mad, and made a terrible decision.  We'll never know.",
            "author": "LogicalWhiteKnight",
            "created_utc": 1372797104.0,
            "replies": [
                {
                    "name": "t1_cayikrk",
                    "parent_id": "t1_caupvl3",
                    "body": "Trayvon's motive for attacking Zimmerman was established by Jeantal:  he was afraid that he was being stalked by a rapist.  ",
                    "author": "418156",
                    "created_utc": 1373322340.0,
                    "replies": [
                        {
                            "name": "t1_cazkdlr",
                            "parent_id": "t1_cayikrk",
                            "body": "That is an awful excuse. Anyone in their right mind who believes they are being followed by a rapist would not walk 100 yards toward the person when they were already at their house. They would get inside with their family as soon as possible and call the police. ",
                            "author": "JanThaMan",
                            "created_utc": 1373440459.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cb0cbge",
                            "parent_id": "t1_cayikrk",
                            "body": "Unless George Zimmerman has a penis the size of a football field I'm pretty sure Trayvon would have been just fine going the fuck inside his house and calling the police. But no, he was on drugs and had to go act like a thug and confront(more than likely attack) someone. His behavior was ridiculous and he earned himself a Darwin Award.",
                            "author": "PF_Inferno",
                            "created_utc": 1373536107.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cauqd8p",
            "parent_id": "t3_1hie6y",
            "body": "&gt;I believe that Zimmerman's belief that his life was in danger was unreasonable. CMV.\n\nI suggest going down to your local MMA gym and jumping in the ring with a 17 year old kid, especially if you are in your 30s or 40s and long out of shape to see for yourself. Even work your way up to it. Then imagine that you aren't in a ring and no one is there to call time or stop the fight. This is the best way to test your view and perhaps change it.\n\nPeople frequently go to the gym, but just do the cardio workout or shadowbox and don't really spar. There is a tremendous difference between going to the gym and fighting.\n\n&gt;What would compel Trayvon, a kid who had really only ever gotten in trouble for smoking weed, to decide to kill a man he didn't know?\n\nFrom what I read some of the recent events in Trayvon's life and texts about the subject were full of trash talking about school fights (MMA style) and he had pics of a gun on his phone. What compels Trayvon and many other youths to pretend they are hardcore gangster mother fuckers who will kill to protect their rep? That culture is very old... It was NWA and movies like Boys in the hood that show how that culture is created when I was a kid... and many others since push that way of thinking and that attitude.\n\nWhat I don't understand is how you don't mention any of treyvon's history in your post when you clearly have followed the story. Did you not know he was staying with his dad because he was getting tossed out of school for fighting?",
            "author": "Gnome_Sane",
            "created_utc": 1372798378.0,
            "replies": [
                {
                    "name": "t1_cauzwto",
                    "parent_id": "t1_cauqd8p",
                    "body": "I will fight any 17 year old who weighs 40 pounds less than me and I will whip any of there asses. Zimmerman was 27...not 40",
                    "author": "Scubetrolis",
                    "created_utc": 1372826808.0,
                    "replies": [
                        {
                            "name": "t1_cav7n9h",
                            "parent_id": "t1_cauzwto",
                            "body": "ok tough guy.",
                            "author": "Gnome_Sane",
                            "created_utc": 1372864760.0,
                            "replies": [
                                {
                                    "name": "t1_caveyje",
                                    "parent_id": "t1_cav7n9h",
                                    "body": "I'm just not an idiot. Zimmerman was active physically, meaning he wasn't in horrible shape. Trayvon was a 17 year old boy with no muscle. ",
                                    "author": "Scubetrolis",
                                    "created_utc": 1372884273.0,
                                    "replies": [
                                        {
                                            "name": "t1_cavf08g",
                                            "parent_id": "t1_caveyje",
                                            "body": "&gt;I'm just not an idiot.\n\nYour words. I called you a tough guy... albeit sarcastically.\n\n&gt;Zimmerman was active physically, meaning he wasn't in horrible shape. Trayvon was a 17 year old boy with no muscle.\n\nYou know how I know you've never gotten into the ring to spar or even been in a street fight, tough guy? ",
                                            "author": "Gnome_Sane",
                                            "created_utc": 1372884398.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cav6fuw",
                    "parent_id": "t1_cauqd8p",
                    "body": "&gt;I suggest going down to your local MMA gym and jumping in the ring with a 17 year old kid, especially if you are in your 30s or 40s and long out of shape to see for yourself. Even work your way up to it. Then imagine that you aren't in a ring and no one is there to call time or stop the fight. This is the best way to test your view and perhaps change it.\n\nWell said.  Of all the people that claim to 'know all about fighting', a very small percentage have actually had any kind of training against a variety of body types.  Of that small percentage that actually train, a small percentage of them get to the level where they can spar with the kid gloves off.\n\nI can count at least 3 instances in the last 3 years in my city where someone has been left dead or a vegetable as a result of getting their head smashed in while fighting. The media's response to those stories?  Too bad, so sad, not news.  ",
                    "author": "hooraah",
                    "created_utc": 1372861086.0,
                    "replies": [
                        {
                            "name": "t1_cav7ncj",
                            "parent_id": "t1_cav6fuw",
                            "body": "cheers.",
                            "author": "Gnome_Sane",
                            "created_utc": 1372864767.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cauqioi",
            "parent_id": "t3_1hie6y",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1372798759.0,
            "replies": [
                {
                    "name": "t1_cav26sc",
                    "parent_id": "t1_cauqioi",
                    "body": "Rule 2\n\n&gt; Don't be rude or hostile to other users. Your comment will be removed even if the rest of it is solid\n\n",
                    "author": "PixelOrange",
                    "created_utc": 1372836284.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_caurwsx",
            "parent_id": "t3_1hie6y",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1372802616.0,
            "replies": [
                {
                    "name": "t1_cav271o",
                    "parent_id": "t1_caurwsx",
                    "body": "Rule 2\n\n&gt; Don't be rude or hostile to other users. Your comment will be removed even if the rest of it is solid.\n\n",
                    "author": "PixelOrange",
                    "created_utc": 1372836321.0,
                    "replies": [
                        {
                            "name": "t1_cavid9s",
                            "parent_id": "t1_cav271o",
                            "body": "&gt; even if the rest of it is solid\n\nit was all solid and you know it. \n\nsir/ma'am.",
                            "author": "Jeff_Smoker",
                            "created_utc": 1372894438.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_causu45",
            "parent_id": "t3_1hie6y",
            "body": "There is some indication that Martin had been in trouble for a little more than weed.  Evidence of this is not being allowed in the trial, not because it isn't  true,  but because it was deemed irrelevant to the case.",
            "author": "LeeHaarvey",
            "created_utc": 1372805286.0,
            "replies": []
        },
        {
            "name": "t1_cauuz06",
            "parent_id": "t3_1hie6y",
            "body": "Have you ever been surprised with a punch to the face that broke your nose? It will leave you stunned and practically helpless.",
            "author": "Veylis",
            "created_utc": 1372811780.0,
            "replies": []
        },
        {
            "name": "t1_cauv5xm",
            "parent_id": "t3_1hie6y",
            "body": "If someone big and strong is on top of you at night in a deserted area, hitting you in the face, you **are** at very real risk of death or grievous bodily injury.  At this point, even if it's a small chance you'll actually die, you're totally justified in defending yourself with whatever means are available to you.  The other option is hoping this guy attacking you, who is clearly in a superior position, is not going to kill you, and that's not a fair situation to put anyone in.\n\nEven if Trayvon was bluffing with his threat, *even if he didn't make the threat*, legally it's unfair to expect Zimmerman to put his life in his attacker's hands in order to not use deadly force to defend himself.  When he's on the ground with someone strong punching him in the face, he has a totally reasonable fear of harm coming to his person that justifies self-defense.\n\nAlso, I don't know if you've ever been hit hard in the face, but you'd be amazed what one good shot to the face will do to your thought process.  You aren't calmly thinking \"Maybe there's some way I can de-escalate this situation so the least harm is done,\" you're thinking \"OH FUCK OH FUCK OH FUCK.\"   And judging by his wounds Zimmerman was hit multiple times.\n\n",
            "author": "Bezant",
            "created_utc": 1372812362.0,
            "replies": []
        },
        {
            "name": "t1_cauvoxy",
            "parent_id": "t3_1hie6y",
            "body": "Trayvon had no injuries except for the cut on his hand. Zimmerman actually had injuries, but with none on his hands. Also, there is eyewitness testimony that puts Trayvon Martin on top of Zimmerman. Furthermore, this eyewitness stated that the person on top was throwing their arms downward like to punch someone. The eyewitness also stated that he thought the person on bottom was screaming for help. \n\nSo, Zimmerman just got sucker punched and now has someone he doesn't know on top of him repeatedly punching him in the head and slamming his head against concrete. Furthermore, he is screaming for help and no one is coming. Then, he sees Trayvon going for his gun. You honestly think it is unreasonable for him at this point to fear that he may be substantially harmed or killed if he doesn't stop what is being done to him by Trayvon. \n\n",
            "author": "CreepyCracka",
            "created_utc": 1372814002.0,
            "replies": [
                {
                    "name": "t1_cavjcvk",
                    "parent_id": "t1_cauvoxy",
                    "body": "*had no injuries except for the cut on his hand and the bullet wound in his chest.",
                    "author": "ChiefBigBlockPontiac",
                    "created_utc": 1372897740.0,
                    "replies": [
                        {
                            "name": "t1_cavk48f",
                            "parent_id": "t1_cavjcvk",
                            "body": "Yes, but that bullet wound was the result of TM continuing to punch a man in the head while that man screamed for help. I can't think of a more textbook example of the proper time you should be allowed to defend yourself.",
                            "author": "CreepyCracka",
                            "created_utc": 1372900356.0,
                            "replies": [
                                {
                                    "name": "t1_cavl3c7",
                                    "parent_id": "t1_cavk48f",
                                    "body": "&gt;Yes, but that bullet wound was the result of TM continuing to punch a man in the head while that man screamed for help\n\nAre you trying to pass this off as fact?",
                                    "author": "ChiefBigBlockPontiac",
                                    "created_utc": 1372903727.0,
                                    "replies": [
                                        {
                                            "name": "t1_cavmx2x",
                                            "parent_id": "t1_cavl3c7",
                                            "body": "Um ya, there is eyewitness testimony coupled with the injuries to Zimmerman and lack of any to Trayvon other than those mentioned above. Pretty clear, TM was on top and punching Zimmerman and it makes no sense for the guy throwing punches to be screaming for his life. ",
                                            "author": "CreepyCracka",
                                            "created_utc": 1372909915.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cavna3e",
                                                    "parent_id": "t1_cavmx2x",
                                                    "body": "There is eyewitness testimony stating the exact opposite.  It's not credible.\n\nZ's face shows ZERO evidence of multiple blows.  Knuckles do a SHITLOAD of superficial damage, and Z didn't look any worse than most dudes who get KTFO with one punch in the nose.\n\nMeanwhile, while his face is apparently getting beat in, and with a broken nose that he probably can't breathe out of, he's continuously screaming for help?  Ever heard a person with a broken nose scream?  I haven't, mostly because they can't due to pain.\n\nSo no, none of that is clear.\n\nYou know what's more likely?  Trayvon decks him and he pulls out a gun yelling shit while Trayvon screams, then shoots him out of frustration.  That's usually how it goes in places that aren't so nice.\n\nIt blows my mind that redditors in mass are so sheltered that they can blindly defend this dude with only speculation.  This motherfucker straight up **cased** a fucking 17 year old kid and ran up on him.  That much *is* known.  I'd say put yourself in Trayvon's shoes, but that clearly wouldn't work.",
                                                    "author": "ChiefBigBlockPontiac",
                                                    "created_utc": 1372911076.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cavof6g",
                                                            "parent_id": "t1_cavna3e",
                                                            "body": "Hahaha, you think he pulled the gun and then let Trayvon scream for help for at least 10 - 15 seconds and then shot TM because he was frustrated?! And he did this after he fucking knew the cops were going to show up since he called them. What the fuck man - this defies common sense. Can't scream due to pain - that's preciously when people do scream! \n\nIf I'm Trayvon, I don't get fucking offended by thinking someone is following me to the point I think it's a good idea to go punch that guy in the nose. Only fucking thug ass punks think that way. Also, I would not be offended AT ALL if anyone thought I was suspicious based off of Trayvon's actions that night. Anyone that is wearing a hoodie, walking around in the rain, cutting through people's yards looks fucking suspicious. Of course they may be doing nothing wrong, but you still look fucking suspicious and you have to be intellectually dishonest to say otherwise.    \n\n",
                                                            "author": "CreepyCracka",
                                                            "created_utc": 1372914990.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cavorrb",
                                                                    "parent_id": "t1_cavof6g",
                                                                    "body": "&gt;Hahaha, you think he pulled the gun and then let Trayvon scream for help for at least 10 - 15 seconds and then shot TM because he was frustrated?!\n\nEver had a gun pulled on you?  That's pretty much how it goes until the coward builds up enough courage to pull the trigger.\n\n&gt;If I'm Trayvon, I don't get fucking offended by thinking someone is following me to the point I think it's a good idea to go punch that guy in the nose.\n\nLol where are you from?  Must be nice to know that when people follow you, they have only honorable intentions in mind.\n\n&gt;Only people that have had a hard upbringing think that way\n\n**FTFY**.\n\n&gt;Anyone that is wearing a hoodie, walking around in the rain, cutting through people's yards looks fucking suspicious.\n\nWhat does this have to do anything?  Does this give you probably cause to chase someone around the neighborhood?  If not, then *what does this have to do with anything*?",
                                                                    "author": "ChiefBigBlockPontiac",
                                                                    "created_utc": 1372916335.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_cavoyit",
                                                                            "parent_id": "t1_cavorrb",
                                                                            "body": "&gt;What does this have to do anything? Does this give you probably cause to chase someone around the neighborhood? If not, then what does this have to do with anything?\n\nIt looks fucking suspicious, especially in a neighborhood with a history of break-ins! Also, there is NO LAW in ANY STATE that says you cannot follow someone in your own damn neighborhood. So, no matter what you would do or what's street justice, it is fucking assault and battery to physical attack someone you think is following you. \n\nAlso, I'm from the South and down here a lot of us have carry permits that allow us to carry our guns almost 24/7. So, word of advice, don't go around fucking attacking people or you might end up dead. \n\n&gt; Ever had a gun pulled on you? That's pretty much how it goes until the coward builds up enough courage to pull the trigger.\n\nAs to this whopper, no I have never had a gun pulled on me. I try to stay aware of my surroundings and avoid those type of situations. You know by NOT fucking confronting people I think may be following me. ",
                                                                            "author": "CreepyCracka",
                                                                            "created_utc": 1372917091.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_cavp8wl",
                                                                                    "parent_id": "t1_cavoyit",
                                                                                    "body": "&gt;As to this whopper, no I have never had a gun pulled on me.\n\nAnd that is my cue to leave you in your safety bubble playing armchair lawyer.",
                                                                                    "author": "ChiefBigBlockPontiac",
                                                                                    "created_utc": 1372918274.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "name": "t1_cavyt7g",
                                                                                    "parent_id": "t1_cavoyit",
                                                                                    "body": "lucky you to never have a gun pulled on you, I am from Miami just like TM and I have had a gun pointed at me over a parking space. Pull your head out of your small town Southern ass, try to see things from that kid's perspective if you have that ability.",
                                                                                    "author": "chefontheloose",
                                                                                    "created_utc": 1372963600.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "name": "t1_cavyr72",
                                                                    "parent_id": "t1_cavof6g",
                                                                    "body": "he wasn't cutting through yards, it was an apartment complex he was staying in you idiot. Seems as though you are another creepy ass cracker...",
                                                                    "author": "chefontheloose",
                                                                    "created_utc": 1372963420.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_caw06ah",
                                                                            "parent_id": "t1_cavyr72",
                                                                            "body": "Let me guess, you haven't actually watched any of the trial? And what the fucking media like MSNBC or HLN show you doesn't count. This was proven like 2nd day you fucking ignorant piece of shit. DO NOT comment on the fucking trial unless you actually know what you are talking about. You are the problem with America. ",
                                                                            "author": "CreepyCracka",
                                                                            "created_utc": 1372968096.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_caw68hi",
                                                                                    "parent_id": "t1_caw06ah",
                                                                                    "body": "hahahahhahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahah. Eat shit",
                                                                                    "author": "chefontheloose",
                                                                                    "created_utc": 1372990763.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "name": "t1_cavypo6",
                                                            "parent_id": "t1_cavna3e",
                                                            "body": "amen, add to the facts please that TM was a kid from Miami. I am from Miami, you have have to see through the bushes, man. A creepy ass cracker following you and not saying shit is menacing.",
                                                            "author": "chefontheloose",
                                                            "created_utc": 1372963280.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "name": "t1_cb1xihc",
                                                            "parent_id": "t1_cavna3e",
                                                            "body": "&gt; Ever heard a person with a broken nose scream? I haven't, mostly because they can't due to pain.\n\nThat is the dumbest fucking thing I have ever read in my life. Congratulations. ",
                                                            "author": "BennyBenasty",
                                                            "created_utc": 1373739525.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cb26x35",
                                                                    "parent_id": "t1_cb1xihc",
                                                                    "body": "&gt;Says the silver spoon to the professional boxer.\n\nOkay.  :)",
                                                                    "author": "ChiefBigBlockPontiac",
                                                                    "created_utc": 1373771867.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cav4hip",
            "parent_id": "t3_1hie6y",
            "body": "&gt; after Trayvon's girlfriend had said Trayvon got close to his dad's girlfriends house,\n\nThe prosecution has admitted that she may have perjured herself.\n\n&gt; What doesn't seem plausible to me, is that a man who was taking MMA classes three times a week, had no means to defend himself while pinned downed in a ground and pound position, which is stated as being an MMA position.\n\n\"taking lessons\" doesn't equate to 100% proficiency. Having your head slammed against the sidewalk isn't an easy position to escape from. Even the pros have problems escaping this...\n\n&gt; What seems even less plausible to me is that Trayvon was all at once suffocating Zimmerman, slamming his head against the ground, and reaching for Zimmerman's gun while telling Zimmerman, \"you're going to die tonight.\" \n\nAll at once? Or did it occur within a short amount of time. placing your full weight on someone's diaphragm over a concrete surface is enough to give the sensation of suffocation. This is the position Martin would've been in if he had immobilized Zimmerman.\n\n&gt; What would compel Trayvon, a kid who had really only ever gotten in trouble for smoking weed, to decide to kill a man he didn't know?\n\nNot all homicide is planned or even intentional. Your assertion betrays an assumption of yours that either party was acting with a full read of all available information. Zimmerman and Martin likely had no idea what the other one would do, but being pinned down with your head banged against concrete *is* a life threatening situation.",
            "author": "[deleted]",
            "created_utc": 1372852584.0,
            "replies": []
        },
        {
            "name": "t1_cavt09m",
            "parent_id": "t3_1hie6y",
            "body": "The extent of the excuses people make for Martin are mind boggling.\n\nIf this isnt a clear cut case of reasonable fear for ones life what is?\n\nId like to ask every mother on that jury, what would you expect your daughter to do if she was mounted by a young athletic teenager, who broke your daughters nose, and was \"mma style ground and pounding her\" into the ground, and slamming her head on the concrete?  \n\nKeep taking it because there is no reason to fear for her life??? \n\nARE YOU PEOPLE OUT OF YOUR FUCKING MINDS????\n\nWhat would a cop do in this scenario???  \n\nGo jump a cop twice your size, mount him, pound his face and see if he shoots you.  Even a cop twice your size would claim reasonable fear for his life and shoot you dead and he would not be remotely challenged on it.  \n\nIf it were my daughter, and she had a gun, I would have told her to shoot the bastard earlier before she took so much damage.\n\nThis is an open and shut case. Only your racist bias is getting in the way.\n\nI would have shot him dead earlier because I had more than enough reason to fear for my life.   Are you people even remotely serious?????\n\n",
            "author": "ak47girl",
            "created_utc": 1372942656.0,
            "replies": [
                {
                    "name": "t1_cazx8w4",
                    "parent_id": "t1_cavt09m",
                    "body": "I had the same thought above and I read your post we think exactly alike on this subject you must be right like me.",
                    "author": "nochains",
                    "created_utc": 1373486813.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_caxx3kk",
            "parent_id": "t3_1hie6y",
            "body": "\"hat doesn't seem plausible to me, is that a man who was taking MMA classes three times a week, had no means to defend himself while pinned downed in a ground and pound position, which is stated as being an MMA position.\"\n\nYes , it's an mma position.  A LOSING mma position. Trained fighters do sometimes escape mount, but if you are being ground and pounded,  you're pretty much fucked. \n",
            "author": "418156",
            "created_utc": 1373246645.0,
            "replies": []
        },
        {
            "name": "t1_cazx82e",
            "parent_id": "t3_1hie6y",
            "body": "I think it is pretty reasonable to think you are in danger when your head is being bashed into the ground.  Just because someone takes a class on mma doesn't mean they can defend themselves.  It also doesn't make the back of their head any harder when being beat against the ground.  If you don't think it is justified go out and grab a cop and get him on the ground and start beating his head into the ground and see if he don't shoot your ass and leave you bleeding.  This trial is a fiasco just like the rest of America today.  ",
            "author": "nochains",
            "created_utc": 1373486760.0,
            "replies": []
        },
        {
            "name": "t1_cb049v1",
            "parent_id": "t3_1hie6y",
            "body": "Facts that pro-Zimmerman people love to ignore:\n\n1 Trayvon Martin's father and his father's fiance were in that gated community. He had every right to be walking around at night and nobody in this thread has ever stated Trayvon committed ANY crime whatsoever.\n\nOn the day Martin was fatally shot, he and his father were visiting his father's fiance and her son at her townhome in The Retreat at Twin Lakes in Sanford, a multi-ethnic gated community, where the shooting occurred.[42][43] Martin had visited his father's fiance at Twin Lakes several times.[44][45]\nhttp://en.wikipedia.org/wiki/Shooting_of_Trayvon_Martin\n\nImagine if your loved one, a teenager perhaps, was walking in your neighborhood, and a guy like Zimmerman shoots him or her in the chest???\n\n2 The dispatcher told Zimmerman that he SHOULD NOT follow Martin:\n\nDispatcher\n\nAre you following him?\n\nZimmerman\n\nYeah.\n\nDispatcher\n\n**Ok, we don't need you to do that.**\n\nZimmerman\n\nOk.\n\nhttp://bizsecurity.about.com/od/creatingpolicies/a/A-Transcript-Of-The-George-Zimmerman-Police-Call.htm\n\nIf someone, any pro-Zimmerman person could please address the transcript above, that would be great. Was there any reason, after Zimmerman actually acknowledges with an \"OK\" that he hears the dispatcher tell him \"We don't need you to do that,\" that HE STILL FOLLOWS MARTIN. I'd love to hear the reasoning behind this, if anyone is brave enough to come up with something logical, since following someone after the 9/11 person says not to isn't exactly the smartest thing to do. \n\n3 Martin was actually running AWAY from Zimmerman before he decids to follow the kid:\n\nDispatcher\n\n**He's running? Which way is he running?**\n\nAmbient sounds are heard which may be Zimmerman unbuckling his seat belt and his vehicle's \"open door\" chime sounding. The change in his voice and the sound of wind against his cell phone mic indicate that he has left his vehicle and is now walking. The dispatcher seems to pick up on these changes and sounds concerned when he later asks Zimmerman if he is following Martin.\nZimmerman\n\nDown towards the other entrance to the neighborhood.\n\nDispatcher\n\nWhich entrance is that that he's heading towards?\n\nZimmerman\n\nThe back entrance(expletive)(unclear)\n\nThis section of the recording has been the subject of much speculation. Some suggest that Zimmerman has just made a racial slur, but the audio is not clear.\n\n4 I assume many in this thread have weapons or know how to shoot a gun. Can some of you please explain how if you are getting the snot beat out of you, that you can still take the gun out and shoot?? If the force from Martin was that ferocious, how was Zimmerman still able to get the gun out? \n\n5 Finally, the \"this was a poor man getting pummeled\" defense of a wannabe security guard turned murdered, I'd love to know why:\n\nExpert witness: Zimmermans head wounds not life-threatening... To me, the word slam implies great force, Dr. Valerie Rao said in court. And this, the resultant injuries, are not great force. \nhttp://www.nbcnews.com/video/nightly-news/52379085#52379085\n\nSO WHICH ONE IS IT? Were his injuries not life threatening like the expert above states? \n\nOr was poor George getting so beaten up, that he also had one arm free to pull out the weapon.\n\nZimmerman murdered that young, unarmed man because he was a hyped up, neighborhood watch guy, who could very well killed you or me if he viewed us walking in his neighborhood late at night as a threat. \n\nAnd please, deal with the points I've made above, if you can muster up some level of rationality, or logic. I've even numbered them, so go ahead, I love a good debate. But stick with the points I've made. Thanks. \n",
            "author": "HAGOODMANAUTHOR",
            "created_utc": 1373505952.0,
            "replies": [
                {
                    "name": "t1_cb0vzj6",
                    "parent_id": "t1_cb049v1",
                    "body": "&gt; and nobody in this thread has ever stated Trayvon committed ANY crime whatsoever.\n\nhe assaulted zimmerman.  assault is a crime, yeah?",
                    "author": "SoApatheticItHurts",
                    "created_utc": 1373593823.0,
                    "replies": [
                        {
                            "name": "t1_cb1amc8",
                            "parent_id": "t1_cb0vzj6",
                            "body": "Sorry, how do you know this for sure?\n\nIt was Zimmerman who admittedly followed Travon, AFTER Trayvon was running away... you mean to tell me you're fine with someone following YOU at night??? For no reason.\n\nThe police on the phone told Zimmerman \"we don't need you to do that\" pertaining to following the kid, but he still followed him.\n\nSo I'm not entirely sure if perhaps the kid was scared out of his mind, or at least threatened like you or I would, if someone, a complete stranger, followed after we ran away from the guy. And sorry, \"neighborhood watch\" man doesn't have the authority or right to tell anyone to stay put.",
                            "author": "HAGOODMANAUTHOR",
                            "created_utc": 1373650842.0,
                            "replies": [
                                {
                                    "name": "t1_cb1godh",
                                    "parent_id": "t1_cb1amc8",
                                    "body": "&gt; It was Zimmerman who admittedly followed Travon, AFTER Trayvon was running away... \n\nthis is not a crime.\n\n&gt;you mean to tell me you're fine with someone following YOU at night??? For no reason.\n\nno, but following me is not a crime.  my first inclination what not be to assault someone for doing it.  i'd likely turn to ask what was going on if i were concerned, but i wouldn't initiate a fight.\n\n&gt; The police on the phone told Zimmerman \"we don't need you to do that\" \npertaining to following the kid, but he still followed him.\n\nthis is not a crime.\n\n&gt; So I'm not entirely sure if perhaps the kid was scared out of his mind, or at least threatened like you or I would, if someone, a complete stranger, followed after we ran away from the guy. \n\nyou don't know he was scared out of his mind.  you are assuming that to fit a narrative.  he may have run away to set the pursuer up for an attack.  and i don't know that.  \n\n&gt; And sorry, \"neighborhood watch\" man doesn't have the authority or right to tell anyone to stay put.\n\nagreed.",
                                    "author": "SoApatheticItHurts",
                                    "created_utc": 1373666388.0,
                                    "replies": [
                                        {
                                            "name": "t1_cb1j4c4",
                                            "parent_id": "t1_cb1godh",
                                            "body": "Fair enough, and although we disagree, that's why you and I would never be in Zimmerman's shoes now, because we have common sense.\n\nConversely, something not being a crime doesn't mean that it might not cause someone to fear for his life. Certainly, walking around at night in the neighborhood where you're family lives is not a crime either, but Zimmerman thought Tryavon was a threat. I'm sorry, when someone is following me at night, for no reason, I'm fearing my safety, and I will defend myself. \n\nZimmerman will get at least manslaughter for creating a situation that caused anyone to fear for his life, not creating a narrative, just stating how most people would feel under the circumstances. Neighborhood watch people around the country will think it's alright to initiate confrontations, then claim self defense after murdering innocent people if Zimmerman walks. ",
                                            "author": "HAGOODMANAUTHOR",
                                            "created_utc": 1373674202.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cb1jo2k",
                                                    "parent_id": "t1_cb1j4c4",
                                                    "body": "&gt; I'm sorry, when someone is following me at night, for no reason, I'm fearing my safety, and I will defend myself.\n\nno need to apologize.  i get where you are coming from.  you might be afraid, but you're in a floridian gated community, not east l.a.  what would you defend yourself from?  to defend yourself, there must be an act of aggression, and in this particular case, from what we know, there wasn't one on the part of the survivor.  initiating verbal contact is not an act of aggression you need to physically defend yourself from.\n\nyou seem to be suggesting the dead person was in fear for his life but it was not possible that the survivor was in fear for his.  if they were both in fear for their lives, and the dead person may well have been, idk, they both have the right to defend themselves.  and one guy came out better than the other.  ",
                                                    "author": "SoApatheticItHurts",
                                                    "created_utc": 1373676085.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cb1kpaq",
                                                            "parent_id": "t1_cb1jo2k",
                                                            "body": "Alright, but one was following the other, not a crime, but nonetheless an aggressive action. \n\nI don't feel Zimmerman is a monster, I just think he was paranoid, out to get someone apprehended, which caused his judgement to lapse, and caused him to think Martin was a threat, which in turn caused  him to follow the kid after Martin actually ran away. Then, the scuffle took place, but have you seen Zimmerman's face after the \"pummeling\"? No damage to his eyes, cheeks, fine a broken nose, but getting beaten to death? Nope, Zimmerman's lying about that. \n\nAlso, why should we simply believe that Zimmerman didn't START the fight? I love how people just simply assume Zimmerman's version was right, without questioning whether he shoved the teen (a violent act, but not one that would show in the autopsy). \n\nAlso, if he's getting beaten to death, he shoots a perfect shot to the chest, WITH someone on top of him waling on him with deadly punches??\n\nAs for the following, there's a conservative, a respected one who agrees with me.\n\nConservative intellectual George will echoed the same sentiment:\n\n\"Mr. Zimmerman says he was acting under this self-defense law, but he is said to have been recorded saying he pursued the person. You cannot be in pursuit and acting in self-defense.\nhttp://www.mediaite.com/tv/george-will-on-trayvon-martin-stand-your-ground-law-is-a-bad-idea/\n\nFinally, if I'm armed, and this is just me, but I'm going to make sure that I'm a distance from a potential threat, so that I can draw the weapon. I'm not getting inches away from someone who could hurt me, or prevent me from grabbing the gun. But then again, that's me, obviously Zimmerman \"somehow\" knew, without warning the kid that he was armed, that he'd be able to both confront the potential \"perp\" in close proximity, possibly get into a fight, but also miraculously pull his gun out without a problem. \n",
                                                            "author": "HAGOODMANAUTHOR",
                                                            "created_utc": 1373679754.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cb3qgr4",
            "parent_id": "t3_1hie6y",
            "body": "Let's see. Zimmerman saw a hoodie wearing black guy and got suspicious, only to have his suspicions validated by almost being beaten to death by the hoodie wearing black guy. Following the acquittal, thousands of hoodie wearing black guys take to social media and threaten to kill Zimmerman. What exactly did Zimmerman do wrong again?",
            "author": "cylon56",
            "created_utc": 1373981941.0,
            "replies": []
        }
    ]
}