{
    "name": "t3_19yu4r",
    "title": "I feel that you can't become world renowned for something through talent alone - you have to be extremely lucky. CMV.",
    "body": "Of course you'd need to have *some* talent. i.e, you won't get there through luck alone. But I feel you can't get there through *talent* alone - you need to be in the right place at the right time.",
    "author": "Toby-OrNotToby",
    "num_comments": 2,
    "created_utc": 1362829659.0,
    "url": "http://www.reddit.com/r/changemyview/comments/19yu4r/i_feel_that_you_cant_become_world_renowned_for/",
    "comments": [
        {
            "name": "t1_c8sl4p4",
            "parent_id": "t3_19yu4r",
            "body": "But does anything function alone with no other built in factors? For example, in high school debate there are two key factors that are used- How you say it (speech) and what you are saying (facts, arguments). But the majority of it for debate is how you say it so I'll take it instead that the majority of success will have to be because of luck or who you know instead of being able to do something or talent. \n\nLucky is defined by having good luck, luck being the force that seems to operate for good or ill in a person's life, as in shaping circumstances, events, or opportunities. I'll give 2 examples: one with a lot of luck but no talent and another one with a lot of talent but no luck. 1. Jim lands a job interview that he recently found in the paper the second he opens it. He goes to the job interview with all of his charm and best clothes. He finds that this attractive redhead is doing the interviews, seemingly her first time to be doing this so she is relatively laid back. Jim goes in her interview and does perfectly! He already knows all of the questions and talks in a smooth voice.  Now there is a portion to show coding.  After about 5 minutes she realizes that he doesn't know anything and tells him sorry. Now Bob walks in to another room that has a grumpy old man sitting there.  He asks the most difficult questions possible! Luckily as Bob is an experienced person with interviews and a talented coder, he answered the questions to the best of his ability and later blew the interviewers mind with his coding abilities. \n\nBob gets the job because of his experienced talent of interviews and amazing coding abilities that gets him through. Jim does not although he did perfectly with the easy questions but proved terribly in coding on the computer. ",
            "author": "[deleted]",
            "created_utc": 1362843034.0,
            "replies": []
        },
        {
            "name": "t1_c8t6pyq",
            "parent_id": "t3_19yu4r",
            "body": "I think there is a lot of truth in what you say, but I think the key factor with world renowned people is that they *take advantage of* their luck where others do not. There are lots of people that come across good opportunities, but many of them are either unprepared for them or do not pounce on them when they appear so the luck is squandered.\n\nThe extremely successful position themselves to take advantage of every lucky break that comes along.\n\nSo this isn't exactly a refutation of exactly what you said. But perhaps it might change how you view luck in a more general way. A lot of times the more successful didn't have more luck than others, but they were able to better take advantage of the luck they had.",
            "author": "harry_heymann",
            "created_utc": 1362943383.0,
            "replies": []
        }
    ]
}