{
    "name": "t3_1le1ll",
    "title": "I remain unconvinced that an airplane actually crashed into the Pentagon on 9/11. CMV",
    "body": "How is there absolutely no evidence of ANYTHING hitting the Pentagon, at all? How were there no eyewitnesses? How come most of the rubble was made up of small pieces, without any pieces of an airplane actually found near the explosion site? How come the path of the trajectory of a potential airplane doesn't match how it physically *should* have happened? How is there not a single security camera shot of an actual airplane? How come any potential video footage hasn't been released to the public? And, most important of all, if this actually was something much larger than a terrorist attack, how is our government that *stupid* to try and cover up a fake airplane crash in arguably the country's most popular and prestigious building, whose sole purpose is being the US's military and defense headquarters? I don't want to believe in this conspiracy because I feel that is extremely disrespectful for those who died that day, which is why I'm looking for ANY compelling argument that there actually was an airplane that day in Washington DC. Please CMV.",
    "author": "grimskrotum",
    "num_comments": 3,
    "created_utc": 1377852715.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1le1ll/i_remain_unconvinced_that_an_airplane_actually/",
    "comments": [
        {
            "name": "t1_cbyal23",
            "parent_id": "t3_1le1ll",
            "body": "http://www.youtube.com/watch?v=YTNRkb7AaQk\n\nI know this is just a youtube video, but the fact that hundreds of these videos exist, as well as there being no bloody reason for someone to just up and make that up...\n\nWhat did they just kill all the passengers of that airplane in silence that day, then make the plane disappear, as well as murder two pilots and a bunch of people at the pentagon?\n\nSeriously wat?",
            "author": "[deleted]",
            "created_utc": 1377853308.0,
            "replies": []
        },
        {
            "name": "t1_cbykqwv",
            "parent_id": "t3_1le1ll",
            "body": "[Here](http://www.youtube.com/watch?v=vwzT0QnwtTE) is a video of the plane hitting the Pentagon taken from a security check point. At 1:26 you can see the front of the plane for 1 frame. I remember seeing a special on Discovery or NOVA, or something which analyzed the video in more depth.",
            "author": "TurdFurgis0n",
            "created_utc": 1377890794.0,
            "replies": []
        }
    ]
}