{
    "name": "t3_1qm5d4",
    "title": "I thought Alien 3 was a good sequel. CMV",
    "body": "I'll try and justify it with these reasons (which also stop many of the arguments I usually hear against it)\n\n* The soundtrack was just amazing, the slow paces for moving scenes and the impending crescendo for when Weyland Yutani arrives was some of the best I've ever heard (Eg, [this](http://www.youtube.com/watch?v=6ckg2RaCpTI#t=158))\n\n* The death of Newt and Hicks... boy oh boy is this a tough one to defend. Although it makes Aliens seem pointless, an earlier draft of the script shed some good light on it: Newt was going to be a host to an alien, and would have died in either agony of her chest exploding or her surroundings exploding - instead her last memories and feelings were safety and security in the Sulaco, and she would've died in peace. The same can be said for Hicks. From a practical standpoint, it also helped move the script along - if they had both survived, how many other ways could a potential sequel 'end' without Ripley saving Newt? It also fits the Alien franchise rather well - the Xenomorphs being without conscience or remorse, taking away everything. \n\n* It was the most original of the Alien movies. Out of the 4 sequels, how many ended with Ripley blasting the last Alien out of a spaceship? The first, second, and fourth (If you'd call that a xeno) Rather than copy the first two films, it went down a different direction with a dark prison-y environment. A bald Ripley certainly made for a different change (Her hair is almost a metaphor, long for innocence in Alien, short for anxiety and confidence in Aliens and no more for Alien^3 , showing she had lost it all and accepted it), this one brought closure for Ripley. \n\n* She was finishing off the Xeno's by killing herself and spiting the company that made her lose everything trying to get it, the most sensible and plausible ending in a universe like this\n\n* The cast was great. From everyday truckers to cocky marines, a British cast of prisoners was a great idea for the next installment. ~~Tywin Lanister~~ Charles Dance made an excellent addition to cast as well as Charles Dutton, along with other heavyweights like Pete Postlethwaite in the mix. The funeral scene was the most poignant moment in the whole series IMO.\n\n* The sets and backgrounds looked great, despite the actual alien. Yes I will admit the Alien looked very CGI (although it was a puppet added over the film), the brooding planet and almost goth-like prison halls were a nice theme and very fitting for a murky alien.\n\n* The alien itself made for a smart change too. From a general soldier to a Queen, the 'runner' or dog/ox-alien was an interesting take on it. (And would also become cannon regarding aliens taking on their hosts form for the expanded universe)\n\n* One of the most important things I noted about it was the genuine reactions people have to it. When watching Alien people would exclaim \"Man I'd *shit* my pants in that situation\" or in Aliens they would cry \"WHOO GAME OVER MAN BREAK OUT THE BIG GUNS\" but would react exactly as intended to Alien^3 like they were in the movie. \n\n&gt; \"I'm so upset Newt and Hicks died!!\" \n\n&gt; \"Why did Clemens die so early, he was the only good guy!\"\n\n&gt; \"Wait these tunnels are confusing me\"\n\n&gt; \"Is that another Bishop droid or the real dude?\"\n\n* As for the plothole about the eggs on the Sulaco, I think the Queen in extenuating circumstances would lay a few eggs as an emergency safeguard for the population. One would certainly be a Queen with a few others to guard it. These eggs did not have time to mature like the ones in the Queen Sack (ick) So after a while in the landing gear on the dropship, these eggs may be wired to actively search nearby hosts due to the urgency. *OR* they may have been moved by an automated system on the Sulaco to move organic material, even the possibility the company intended this from long distance.\n\n* Although the first two movies are fantastic, they could be a little bit limited at times - if you step back to look at it, the ending of Aliens with Ripley fighting off a Queen with a free tail and arms should be impossible, but was overlooked cause she was being a hero. In this movie she was a lot more human.\n\n* Not necessarily horror or action, I think this is almost borderline Sci-Fi Drama\n\nAll in all I thought it was a worthy sequel to the first two and concluded the series nicely. Alien Resurrection was a bit meh, no where near the same par.",
    "author": "lukeyflukey",
    "num_comments": 8,
    "created_utc": 1384439172.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1qm5d4/i_thought_alien_3_was_a_good_sequel_cmv/",
    "comments": [
        {
            "name": "t1_cde608f",
            "parent_id": "t3_1qm5d4",
            "body": "Admittedly it has been a while since I've seen it (maybe I'll give it another go). But here goes:\n\nNothing done in Alien 3 wasn't already done better in Alien. I don't even think the ending was *all* that different. Weyland-Utani is still pretty evil and terrible and wants a xenomorph, *yawn*.\n\nI personally found the setting to be really boring and nonsensical.\n\n&gt;  I think the Queen in extenuating circumstances would lay a few eggs as an emergency safeguard for the population.\n\nThe intelligence of the xenomorphs is not really established (*what do you mean they cut the power?*), but I don't know that the queen has this kind of foresight. Nothing we see about her says as much - she has the hive (which is near the reactor of LV-426) and is otherwise fairly immobile - she has to painfully rip herself off of the egg sac.\n\n&gt; Although the first two movies are fantastic, they could be a little bit limited at times - if you step back to look at it, the ending of Aliens with Ripley fighting off a Queen with a free tail and arms should be impossible, but was overlooked cause she was being a hero. In this movie she was a lot more human.\n\nShe was in a heavy loader! It was well-established that after losing her pilot's licence she became a dock worker, then helps out on the Sulaco with it, and finally uses it to be on par with the queen. I don't think the queen xenomorph really had any idea what it was dealing with. Ripley might have gotten lucky that the tail missed her - but otherwise she was able to keep the queen at bay pretty successfully.\n\n&gt; \"Is that another Bishop droid or the real dude?\"\n\nIt is clearly another Bishop droid just pretending to be real.",
            "author": "BenIncognito",
            "created_utc": 1384439792.0,
            "replies": [
                {
                    "name": "t1_cde64or",
                    "parent_id": "t1_cde608f",
                    "body": "It's not exactly intelligence more instinct that being ripped from your nest and nearly dying due to surrounding fires would lead to some adrenaline rush, but it's not exactly a solid theory on my part in the first place.\n\nYes a slow moving heavy loader with little to protect the upper torso of an exposed person - hardly something an alien would worry about, one whip of the tail in the right spot and bingo bango Ripley on crackers for dinner. Also the Queen holding onto her foot should've have either immediately torn her foot off or slid off, not hang on. I'm imagining a 12 foot tall Queen would be a bit heavy.\n\nAnd how is it clear? Why would a droid scream when it's lost, all it did was fail a program. My phone doesn't cry when it can't send a message. In Alien when Ash loses, he doesn't scream, he acts like a robot. That said, Bishop 2 could just be impersonating human reactions, emotions and even having red blood.\n\nNo deltas, sorry",
                    "author": "lukeyflukey",
                    "created_utc": 1384440205.0,
                    "replies": [
                        {
                            "name": "t1_cde6c50",
                            "parent_id": "t1_cde64or",
                            "body": "&gt; Yes a slow moving heavy loader with little to protect the upper torso of an exposed person - hardly something an alien would worry about, one whip of the tail in the right spot and bingo bango Ripley on crackers for dinner. Also the Queen holding onto her foot should've have either immediately torn her foot off or slid off, not hang on. I'm imagining a 12 foot tall Queen would be a bit heavy.\n\nI mean if we're going to quibble about movie physics I don't think we're going to get anywhere. If you watch Aliens, you can see the queen tries to whip her tail around and hit Ripley a number of times. Ripley just dodges them (with her physical body, not the loader).\n\n&gt; And how is it clear? Why would a droid scream when it's lost, all it did was fail a program.\n\nBishop from Aliens is shown to be a pretty convincing android. He even has a *preference* for what he likes to be called (Artificial Person). He doesn't wish to die, but because he's the only one who can remotely pilot the drop ship he volunteers to go out. Ash was so human-like that he could convincingly pass as one in close quarters (he even hypersleeps!). It doesn't seem so odd to me that the Bishop robot would scream. Doesn't Bishop scream when the Alien Queen punctures his chest in Aliens?\n\nThe red blood is a good point. Maybe they wanted to try and convince Ripley it was the real Weyland, so he could have cut his finger and \"proved\" it with red blood. Since the synthetic was already trying to be a convincing human - it could be doing everything in its power to be as human as possible.\n\nAnyway in Alien vs. Predator we actually see Charles 'Bishop' Weyland (the man) die. And as far as I know that's cannon. So if the Bishop at the end of Alien3 isn't a synthetic and isn't the real Charles Weyland - it could be a clone (but we see from Alien: Resurrection that cloning by Alien3 is imperfect). Synthetic is the only explanation that fits.",
                            "author": "BenIncognito",
                            "created_utc": 1384440837.0,
                            "replies": [
                                {
                                    "name": "t1_cde6ivh",
                                    "parent_id": "t1_cde6c50",
                                    "body": "True I just don't think she had much wiggle room, most tails on animals are fairly accurate and within their control.\n\nI think the AvP series are no longer cannon since Prometheus came out, and he could be a clone. The AvP Charles seemed sympathetic and had a curious mind, whereas this potential clone was obsessed. Also, you're right about Ash sleeping and Bishop I having human qualities, this was expanded on in Prometheus with the droids aimed to be as human like as possible to help others around them to adjust to it. But, this 'droid' was sent just to con Ripley - what's the point of screaming once she started to jump? It wouldn't help even if she changed her mind, and the surrounding company men would either be in on it or used to droids by then so it wouldn't really be needed for them. But either way, it was sort of meant to be ambiguous.",
                                    "author": "lukeyflukey",
                                    "created_utc": 1384441392.0,
                                    "replies": [
                                        {
                                            "name": "t1_cde6meq",
                                            "parent_id": "t1_cde6ivh",
                                            "body": "&gt; True I just don't think she had much wiggle room, most tails on animals are fairly accurate and within their control.\n\nShe has a bit of wiggle room in there, nothing crazy. But the queen is facing Ripley and trying to maneuver its tail from the back to the front from the side, which is not something many tailed creatures try to do.\n\n&gt; I think the AvP series are no longer cannon since Prometheus came out\n\nHowso? The Weyland in Prometheus is Peter Weyland, as as far as I can tell it takes place far after AvP. Charles Weyland could be his father or grandfather.\n\nEdit: It could still no longer be cannon, but seeing as how AvP came out well after Alien3, it seemed like they were making a clear connection. Fun fact: Lance Henrikson is one of only two actors to be killed by a Predator, Xenomorph, and Terminator. The other is Bill Paxton.\n\n&gt; But, this 'droid' was sent just to con Ripley - what's the point of screaming once she started to jump?\n\nPeople do stuff all the time without a point, perhaps the robot was just going for *that* level of realism. It might not of even known it was synthetic.",
                                            "author": "BenIncognito",
                                            "created_utc": 1384441683.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cde6orn",
                                                    "parent_id": "t1_cde6meq",
                                                    "body": "I think it would know, let's not get into some deep Terminator Salvation shit here haha",
                                                    "author": "lukeyflukey",
                                                    "created_utc": 1384441873.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cdeaz71",
            "parent_id": "t3_1qm5d4",
            "body": "Here are my biggest issues with Alien 3. First, I agree with you that the cast, music, and ending are awesome. The tension of a female prisoner on a world of celibate men is also great.\n\nHowever, the following things are really annoying:\n\n- In the first movie, there was one alien. In Aliens, there were a ton of aliens, making the adversary even more terrifying. However, in the third movie, they are back to one alien. So, how do they up the terror factor in a world with one alien? See next point.\n\n- No weapons. The only way to create tension with only one alien is to have a world with no weapons. Are you kidding me? Now, Alien and Aliens are still great horror/sci-fi movies without the action, but the whole \"don't shoot them, they bleed acid\" and \"you need a flamethrower\" themes have completely been thrown out. They are completely defenseless, and the lack of any firearm action really takes away from the movie.\n\n- The fact that the alien they are fighting used a dog as a host. Thus, it takes on traits of the dog, looks like a dog, etc. Apparently, this is why the aliens in the first two movies look like they do; they used humans as hosts. Apparently, this is a mythology point with the alien franchise. BUT IT IS NEVER EXPLAINED. The alien also looks very different from what we expect, but they never explain why.\n\n- The fucking 1st person camera angles. Oh my God. Because they can't have multiple alien kills or any kind of firearm violence, they attempt to up the scares with first person shots of the alien chasing people. We know you are going to die, just die already!",
            "author": "zallen1868",
            "created_utc": 1384452191.0,
            "replies": []
        },
        {
            "name": "t1_cdekndg",
            "parent_id": "t3_1qm5d4",
            "body": "The thing I never understood about Alien 3...where did the egg even come from? The ship never landed on the planet. The only time the queen or any alien for the matter came in contact with it, the queen had detached from her (birthing sack?).\n\nDid the queen palm the egg somehow the whole time and baseball throw it into the ship when she got jetted out?",
            "author": "St1cks",
            "created_utc": 1384474045.0,
            "replies": []
        }
    ]
}