{
    "name": "t3_1efqpu",
    "title": "I believe US doctors &amp; hospitals are typically a waste of time, and modern medicine isn't as evolved as we perceive it to be. CMV",
    "body": "Admittedly, I'm posting this in part as a rant, although for years I've become more and more jaded with the ineptness of doctors, specialists, and hospitals in my area. \n\nI'm jaded because of what I've perceived is an industry full of salary-chasing doctors that struggle to correctly diagnose medical issues, and who seem to hate their job (because they act like complete assholes as if they can't be bugged by our medical need to visit them in the first place - except for the pediatricians - but a kid-friendly personality kind of a job requirement for them).\n\nWith a wife who, over the past 5 years, has been sent out of about a dozen doctor/specialist offices without even a simple diagnosis for persisting issues, and a child about to be released from the ER, again, without a diagnosis, I've lost all confidence in medical progress - 80 years ago, an on-call doctor with a black bag would probably be of more assistance. The worst part is, we have to pay FULL PRICE, whether they were able to help, or not (and usually, it's the latter). For years now, I feel like every trip to a doctor or hospital is just a waste of time and money, because I have come to expect very little in terms of assistance or medical benefit, other than treating symptoms at most.\n\nOn a side note, I believe this issue is to blame for the entire chiropractic/naturopathic industry that is able to greet people who are jaded by the incompetence of modern medicine, claiming through their teeth: \"Oh, of COURSE the medical system can't fix you, but I can!\" Having previously worked at an ad agency that specializes in marketing for chiropractors, you wouldn't believe the smoke and mirrors game they're able to pull off - total snake-oil, all of it. But I digress.\n\n**Edit** My original CMV is too much of a blanket statement.\n\nThere is no question in my mind that medicine on a whole has progressed - cancer treatment, modern surgery techniques, and vaccine developments are amazing. Maybe, in the pursuit of larger, more exciting goals, medicine has left family/personal health behind?\n\nIt doesn't seem like family medicine (there is probably a better term than that), or care for common personal health issues have progressed a whole lot - there isn't much more that a doctor can do today than the old-school doc with a black medicine bag, it seems (which is send you away with some pain killers and not much of a clue what the issue is).",
    "author": "accountrevoked",
    "num_comments": 3,
    "created_utc": 1368685243.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1efqpu/i_believe_us_doctors_hospitals_are_typically_a/",
    "comments": [
        {
            "name": "t1_c9ztcxl",
            "parent_id": "t3_1efqpu",
            "body": "Both my parents are doctors, and I must disagree. What you see is probably the capitalistic system in USA, in which doctors are paid by their performance, and not by the government. So, it is natural for some to administer some false treatments/get you to go to the hospital many more times.\n\nAlso, I am sorry about your wife, but there is a chance that she might have some issue which is not common/ easily solvable by the medicinal science today. This doesn't mean that 80 years ago it would have been better. Probably 80 years ago it would have been worse, but I have no idea about the medicine of 1950s. For example, Penicillin was first chemically synthesized in 1957 in a lab, so it would mean at least few years before it got into widespread and affordable use. And, since then many of the bacterial sicknesses were solved (Although some bacteria evolved to be resistant, but that does not necessarily mean that it would have been better without penicillin).\n\nRegarding chiropractic, I am not familiar with that exact thing, but it is common knowledge that placebo can have a very solid affect on patients. Although, it is quite hard to draw the line between just taking your money or administering psychological treatment. However, I had moles as a child, and they got healed with prayers (after visiting a dermatologist with failure). And even back than I was on the way of becoming an atheist.",
            "author": "Palamut",
            "created_utc": 1368693711.0,
            "replies": []
        },
        {
            "name": "t1_c9zukmv",
            "parent_id": "t3_1efqpu",
            "body": "As someone living in a different first world country, I disagree with the second part (I have no opinion on the first, though US health care doesn't have a great reputation). Modern medicine is the reason why I'm still alive today several times over, it is pretty damn evolved. ",
            "author": "workinglol",
            "created_utc": 1368703429.0,
            "replies": [
                {
                    "name": "t1_c9zy33o",
                    "parent_id": "t1_c9zukmv",
                    "body": "You make a good point, so I'll make an edit above to clarify.",
                    "author": "accountrevoked",
                    "created_utc": 1368717814.0,
                    "replies": []
                }
            ]
        }
    ]
}