{
    "name": "t3_1haww9",
    "title": "I think, from the evidence released, that George Zimmerman is not guilty of murder. CMV",
    "body": "BY THE WAY: I'm not saying whether or not I think he did it... I don't know, you don't know. There's a trial for a reason, so please don't bring that shit in here. \n\nBUT: I've read several articles that say Zimmerman had gashes on his head, and a witness said that Trayvon Martin was on top of him in an MMA type position and that Zimmerman looked real beat up when witnesses first got there. If that's an eyewitness account then what else can they really go off of? There are other reports like that are similar from witnesses, so wouldn't a guilty verdict be really difficult to prove, or am I missing something.",
    "author": "jonhull22",
    "num_comments": 161,
    "created_utc": 1372495580.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1haww9/i_think_from_the_evidence_released_that_george/",
    "comments": [
        {
            "name": "t1_casle0z",
            "parent_id": "t3_1haww9",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1372509251.0,
            "replies": [
                {
                    "name": "t1_casm5v9",
                    "parent_id": "t1_casle0z",
                    "body": "I support Martin because George need to learn to take an ass whooping like a man...\n\nHe wanted to go all gun-ho and approach someone he didn't know cause \"fuck it, right?\" And ends up butt hurt when said someone tore his ass up. Run away, pick up a rock, call the cops, don't pull a gun on somebody without one and shoot cause you embarrassed. \n\n",
                    "author": "shayne1987",
                    "created_utc": 1372514000.0,
                    "replies": [
                        {
                            "name": "t1_casny83",
                            "parent_id": "t1_casm5v9",
                            "body": "While I agree with you that zimmerman was a bit overzealous, and therefore maybe guilty of manslaughter, saying you support martin because \"George need to learn to take an ass whooping like a man\" is ridiculous. ",
                            "author": "Octavian-",
                            "created_utc": 1372521857.0,
                            "replies": [
                                {
                                    "name": "t1_casrrdy",
                                    "parent_id": "t1_casny83",
                                    "body": "Not at all. \n\nIf Good's story holds,and Zimmerman was on his back, \"yelping\" and \"screaming for help\", how did he in fact have enough time to regain composure and have enough time to successfully unholster a weapon, aim, and fire a fatal shot? \n\nYou're getting your head \"slammed on the concrete\", this after essentially having your ass handed to you by an individual younger and considerably larger than you, in a \"ground and pound\" position. Unless you have a live weapon on your person (VERY irresponsible for a neighborhood watch captain), the situation would have to pacify for a substantial amount of time for you to obtain the weapon, unlock it, load a bullet into the chamber, aim, and fire. If the situation had pacified to ANY extent, what reason did Zimmerman have to fear for his life?\n\nAll this beside the fact the police told him DO NOT APPROACH Martin. So what's he do? He went looking for a fight, got one, and got angry when the incident didn't go his way.",
                                    "author": "shayne1987",
                                    "created_utc": 1372535504.0,
                                    "replies": [
                                        {
                                            "name": "t1_cass27j",
                                            "parent_id": "t1_casrrdy",
                                            "body": "Might want to get your facts strait. This is from Zimmermans account of the struggle: \"during the struggle while Martin was on top of Zimmerman, Martin saw the gun his son was carrying and said something to the effect of \"You're gonna die now\" or \"You're gonna die tonight\" and continued to beat Zimmerman.[183] Zimmerman and Martin struggled over the gun, and Zimmerman shot Martin once in the chest at close range, in self-defense.\"\n",
                                            "author": "Octavian-",
                                            "created_utc": 1372536590.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cassmh8",
                                                    "parent_id": "t1_cass27j",
                                                    "body": "*From Zimmermans account*\n\nEverybody was conveniently calling the police when it happened.\n",
                                                    "author": "shayne1987",
                                                    "created_utc": 1372538652.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_casspb9",
                                                            "parent_id": "t1_cassmh8",
                                                            "body": "Is there some reason why I should trust your baseless fictional account over Zimmerman's? ",
                                                            "author": "Octavian-",
                                                            "created_utc": 1372538936.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_casuq4a",
                                                                    "parent_id": "t1_casspb9",
                                                                    "body": "There's absolutely no reason for this guy to lie? \n\nEight witnesses, no one sees Zimmermans head \"pounded on the concrete\". All they see is what amounts to a wrestling match, with a few \"maybe\" punches. Eight people on the phone with police, nine if you count Zimmermans call. How was anyone's life in danger?\n\nRemove Zimmermans loaded gun from the equation, he walks away with a few pain killers and trayvon a month's worth of doctor bills. ",
                                                                    "author": "shayne1987",
                                                                    "created_utc": 1372546434.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_casvbvi",
                                                                            "parent_id": "t1_casuq4a",
                                                                            "body": "I'm not saying Zimmerman didn't lie or exaggerate the story. You're constructing a straw man argument. All I'm saying is that your version of the story, was clearly baseless bullshit that doesn't line up with the any of the accounts. For your convenience, here are portions the witness accounts pulled from wikipedia.\n\n\"A witness to the confrontation just prior to the shooting stated that Martin was on top of Zimmerman and punching him, while Zimmerman was yelling for help.\"\n\n\"A 13-year-old boy walking his dog saw a man on the ground shortly before the shooting and identified him as wearing red.[151][152][153] His mother later disputed the testimony and claimed that the police pressured him into choosing the color that the man was wearing and that her son could not see any details in the dark. She also stated that the police waited five days before requesting to even question her son and said that the lead homicide investigator told her that he did not believe the shooting was self defense\"\n\n\"Mary Cutcher and her roommate, Selma Mora Lamilla, appeared on AC 360, and Cutcher stated that she believes that \"there was no punching, no hitting going on at the time, no wrestling\" just prior to the shooting but admitted that she neither saw the shooting nor the preceding altercation.\"\n\n\"On March 29, 2012, an eyewitness referred to as a male said that he saw two men on the ground scuffling, then heard the shooting, and saw Zimmerman walk away with no blood on him.[160][161] The witness later appeared on CNN AC360 referred to as a female, giving more details on her account. She pointed out that she heard an argument between a younger and an older voice. During the time that she witnessed the incident, the scuffling happened on the grass. She said that the larger man, who walked away after the gunshot, was on top and that it was too dark to see blood on his face.\"\n\n\"A witness who arrived shortly after the shooting revealed photos that he took that night that showed \"blood trickling down the back of Zimmerman's head from two cuts. It also shows a possible contusion forming on the crown of his head\". In revealing the photo to ABC News in mid-April, he noted that he had heard but had not seen the scuffle, had been the first to arrive, and had been the first to talk to Zimmerman after the shooting.\"\n\n\"One eye-witness statement given the night of the shooting describes \"a black male, wearing a dark colored 'hoodie' on top of a white or Hispanic male who was yelling for help.\" The witness said that the black male was throwing punches \"MMA [mixed martial arts] style.\" After hearing a \"pop,\" he saw the black male \"laid out on the grass.\"\"\n\nSo, according to everyone who actually saw the altercation, the shooting happened in the heat of the moment. Zimmerman was also clearly bloodied, and had gashes on the back of his head as police testified. I'm not saying Zimmerman wasn't in the wrong, but it clearly wasn't the story you made up. It's clear what you want to believe, but lets stick to the facts first.",
                                                                            "author": "Octavian-",
                                                                            "created_utc": 1372548722.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_caszh62",
                                                                                    "parent_id": "t1_casvbvi",
                                                                                    "body": "&gt; according to everyone who actually saw the altercation, the shooting happened in the heat of the moment. \n\nDuring a \"scuffle\". Good couldn't definitively say Martin was punching Zimmerman at the time\n\n&gt;That may be the case for a person identified as Witness 5, who injects opinion into a statement to Sanford police. \"It just sounded like someone was struggling or in trouble or hurting or something,\" the person said. The person later added, \"I feel that he (Zimmerman) intended for this kid to die because there was no struggling going on at that point (when gunshot was heard).\"\n\n&gt;In her version, Trayvon, scared and out of breath from running, unsuccessfully tries to lose Zimmerman. \"I hear this old man say, 'What are you doing around here?,' \" the girl said in an interview with an assistant state attorney. \"Then I could hear the grass.\"\n\n&gt;Two eyewitnesses, meanwhile, said they thought Trayvon cried out for help during a struggle on the sidewalk.\n\n&gt;“I felt like it was the boy’s voice,” Jayne Surdyka told jurors about the deadly scene that unfolded\n\n&gt;Manalo said she thought Zimmerman was astride Trayvon during a violent struggle. But she also said it was too dark to see exactly what was going on, and she made the judgment about who was the aggressor by looking at photos of Zimmerman and Trayvon afterward. She said she still believed she saw Zimmerman “hitting down” on a prone Trayvon.\n\n&gt;De La Rionda also used water bottles to help demonstrate the position of Zimmerman and Martin and even got Good to concede that he did not actually see punches thrown and that he \"only saw downward movement\" of arms.\n\n&gt;Zimmerman was also clearly bloodied, and had gashes on the back of his head as police testified.\n\n&gt;Zimmerman was diagnosed with a closed fracture of his nose, two black eyes, lacerations to the back of his head, a minor back injury, and bruising in his upper lip and cheek.\n\nSo, he had gotten beat up. The bleeding was actually described as \"minor\" by the paramedic on scene, so by medical standards, he was ok.\n\nAlso\n\n&gt;Gilbreath, however, questioned Zimmerman's statement that Martin was slamming his head against the sidewalk just before he shot the teenager, saying it was \"not consistent with the evidence we found.\"\n\n",
                                                                                    "author": "shayne1987",
                                                                                    "created_utc": 1372564337.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_casojeo",
                            "parent_id": "t1_casm5v9",
                            "body": "[deleted]",
                            "author": "[deleted]",
                            "created_utc": 1372524074.0,
                            "replies": [
                                {
                                    "name": "t1_casrdfm",
                                    "parent_id": "t1_casojeo",
                                    "body": "Probably, I've got more than enough reason to be though. \n\nFor all intents and purposes, Zimmerman was the catalyst for the entire situation. Black guy, in a hoodie, in the rain.... eating skittles. \n\n*real suspicious*",
                                    "author": "shayne1987",
                                    "created_utc": 1372534114.0,
                                    "replies": [
                                        {
                                            "name": "t1_casru6y",
                                            "parent_id": "t1_casrdfm",
                                            "body": "[deleted]",
                                            "author": "[deleted]",
                                            "created_utc": 1372535785.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cass045",
                                                    "parent_id": "t1_casru6y",
                                                    "body": "&gt;If you suspect someone is following you, it is not a good reason to start attacking that person.\n\nWhere I'm from, it is.\n\nAside from that, getting beat up isn't a good reason to shoot someone. \n\nBy all accounts Trayvon was just... walking. He wanted some Skittles, got some, and went back home. \n\nZimmerman doesn't look like an upstanding citizen himself, I see a guy like that following me, I'm not going to be nice when I ask him what the fuck his problem is.",
                                                    "author": "shayne1987",
                                                    "created_utc": 1372536381.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cassahj",
                                                            "parent_id": "t1_cass045",
                                                            "body": "[deleted]",
                                                            "author": "[deleted]",
                                                            "created_utc": 1372537424.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cassluf",
                                                                    "parent_id": "t1_cassahj",
                                                                    "body": "&gt;According to Zimmerman's recreation account (which so far has lined up perfectly with witness testimonies), Zimmerman was returning to his car after the police phonecall\n\n&gt;*While in his vehicle* on a personal errand, Zimmerman noticed Martin walking inside the community. Zimmerman called the Sanford Police Department to report Martin's behavior as suspicious, stating \"This guy looks like he's up to no good, or he's on drugs or something. It's raining and he's just walking around, looking about\" and \"looking at all the houses\"\n\nHe was in his car when he called. \n\nAnd the suspicious behavior was \"walking around, looking about\". You've never been caught in the rain. Once it starts and you have no chance of escaping it, you just kind of start \"walking around, looking about\"\n\n&gt;Zimmerman stalked Trayvon with the intent to kill\n\nNo, he stalked him because he's ignorant, he killed him because he weak.\n",
                                                                    "author": "shayne1987",
                                                                    "created_utc": 1372538588.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_casspni",
                                                                            "parent_id": "t1_cassluf",
                                                                            "body": "[deleted]",
                                                                            "author": "[deleted]",
                                                                            "created_utc": 1372538973.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_casulzn",
                                                                                    "parent_id": "t1_casspni",
                                                                                    "body": "&gt;And he was still on the phone when he left his car.\n\nSounds like he was intent on approaching Trayvon, even while on the phone with the police. Doesn't sound like he had the intention of reporting suspicious behavior, sounds like he wanted to let the cops know he was going to try and stop someone he expected to be \"up to no good\".\n\n&gt;he followed Trayvon because he was part of the neighbourhood watch\n\nWhy follow him? Why not approach him, tell him the situation, ask him if he knows anything, you know, engage him in a conversation. \n\nInstead, he chose to combat suspicious behavior with suspicious behavior, and wants to act confused as to how the situation escalated. \n\n&gt;You absolutely refuse to look at the situation objectively\n\nBy every account, two people were fighting, the guy in the \"red or white\" shirt appeared to be losing, *everyone* ran to call the police, and by the time they got to the phone, Trayvon was dead.\n\nIf he didn't want a confrontation, he should not have followed him, should not have exited his vehicle, and should have ran when supposedly approached by Trayvon. End of story.\n\nOn a side note though, who the fuck carries a 9mm to go to the grocery store. *come on*\n\nYes, I get followed. A lot. Doesn't mean these people are right for what they did if I lose my temper and punch one of them in the mouth. \n\n\n",
                                                                                    "author": "shayne1987",
                                                                                    "created_utc": 1372546003.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "name": "t1_cast31g",
                                                            "parent_id": "t1_cass045",
                                                            "body": "getting you head slammed against a sidewalk is a damn good reason to shoot someone. ",
                                                            "author": "xPlasma",
                                                            "created_utc": 1372540354.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_castzen",
                                                                    "parent_id": "t1_cast31g",
                                                                    "body": "Don't know if it happened like that. He could have very easily hit his head on the sidewalk as Trayvon was punching him in the face. \n\nBut quite frankly, if you're getting your head slammed into the sidewalk, it's going to take a miracle for you to keep control of the firearm long enough to get a good shot off.",
                                                                    "author": "shayne1987",
                                                                    "created_utc": 1372543680.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "name": "t1_cat7r28",
                                                            "parent_id": "t1_cass045",
                                                            "body": "People must die young where you're from. ",
                                                            "author": "masturbatin_ninja",
                                                            "created_utc": 1372609543.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_cat7qql",
                            "parent_id": "t1_casm5v9",
                            "body": "1) It's *gung*-ho, not gun-ho. \n\n2) Zimmerman didn't approach Martin. Martin ran from George while George was in his truck. The 911 operator asked George which direction Martin went, George got out of his truck and walked about 3-5 yards to look around the corner to see. Martin was about 100 yards at his dad's house. Martin's friend on the phone confirmed this. Martin then doubled back and sucker punched George as George was returning to his truck. ",
                            "author": "masturbatin_ninja",
                            "created_utc": 1372609513.0,
                            "replies": [
                                {
                                    "name": "t1_catelpi",
                                    "parent_id": "t1_cat7qql",
                                    "body": "&gt;Martin ran from George while George was in his truck.\n\nHe noticed some \"creepy ass cracker\" following him and tried to lose him. Completely understandable.\n\n&gt;George got out of his truck and walked about 3-5 yards to look around the corner to see\n\nGeorge attempted to chase Trayvon when he noticed him running. Direction, distance traveled, and duration of the chase are all debatable.\n\nIt's more likely Zimmerman circled the block, which led to him cutting off Martin in the alley between the townhouses where his body was found. \n\n&gt;Martin was about 100 yards at his dad's house.\n\nMartin was found about 100 yards *from* where he was staying. Rachel *told* him to run to his father's townhouse.  \n\n&gt;Martin then doubled back and sucker punched George as George was returning to his truck.\n\nHe runs from Zimmerman, all while on the phone describing the guy as \"creepy\". That would seem to suggest he was running in an attempt to lose Zimmerman, not precipitate a confrontation. \n\n\n",
                                    "author": "shayne1987",
                                    "created_utc": 1372631693.0,
                                    "replies": [
                                        {
                                            "name": "t1_catjm2h",
                                            "parent_id": "t1_catelpi",
                                            "body": "That simply doesn't fit the timeline established by any witnesses or phone records. ",
                                            "author": "masturbatin_ninja",
                                            "created_utc": 1372647599.0,
                                            "replies": [
                                                {
                                                    "name": "t1_catjx82",
                                                    "parent_id": "t1_catjm2h",
                                                    "body": "What doesn't?\n",
                                                    "author": "shayne1987",
                                                    "created_utc": 1372648519.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_catknzl",
                                                            "parent_id": "t1_catjx82",
                                                            "body": "&gt;It's more likely Zimmerman circled the block, which led to him cutting off Martin in the alley between the townhouses where his body was found. He runs from Zimmerman, all while on the phone describing the guy as \"creepy\". That would seem to suggest he was running in an attempt to lose Zimmerman, not precipitate a confrontation. \n\nNone of this fits with where the body is located, with where the Martin house is, where the witnesses heard sneakers running, where the witnesses first heard conversation etc. Martin told his friend he had made it back to his house right after she called him back. The time stamp of that correlates to the time stamp of Zimmerman on the phone to 911 saying \"OK\" and returning to his truck. \n\nTo fit your scenario the fight would have had to take place near Martin's dad's house or Martin would have had to leave his dad's and circle back around to Zimmerman. Or all the witnesses are lying. ",
                                                            "author": "masturbatin_ninja",
                                                            "created_utc": 1372650768.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_catm70s",
                                                                    "parent_id": "t1_catknzl",
                                                                    "body": "&gt;Martin told his friend he had made it back to his house right after she called him back. \n\nNo, he didn't. The prosecution *suggested* Trayvon lied about his vicinity to his father's house in order to conceal the fact he was about to attack Zimmerman, a point Jeantel vehemently disputed.\n\n&gt;The time stamp of that correlates to the time stamp of Zimmerman on the phone to 911 saying \"OK\" and returning to his truck.\n\nhttp://en.wikipedia.org/wiki/Timeline_of_the_shooting_of_Trayvon_Martin\n\nThere's a five minute timeline between Zimmerman saying OK and Martin's call going dead. If Zimmerman did indeed resume chasing Martin, that gives him more than enough time to head south down Twin Lakes, cut the corner to the alley, where he would have met Martin in the general area where his body was found. \n\n",
                                                                    "author": "shayne1987",
                                                                    "created_utc": 1372655917.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_catm9z5",
                                                                            "parent_id": "t1_catm70s",
                                                                            "body": "It was h er testimony, have  you been watching the trial? She said when she started running the phone cut off, it had been cutting off all day. The two were on the phone since 12pm or so and had lost numerous calls for no apparent reason. He took off running and the call was dropped. She testified she called him right back and he said he was at his dad's. His dad's girlfriend's place is on the entirely opposite side of the sidewalk from where his body was found. ",
                                                                            "author": "masturbatin_ninja",
                                                                            "created_utc": 1372656238.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_catmvnu",
                                                                                    "parent_id": "t1_catm9z5",
                                                                                    "body": "&gt;12:20 p.m. ET: \"If he was going to confront the man he would of told me I am about to confront the man and see what he wants. He did not tell me that, sir. He just told me he tried to get home, sir. But the man was still following him, sir,\" said Jeantel.\n\nHe told her he was *still* trying to get home, and George kept following him. \n\nHis body was found in the alley behind his father's townhouse, if the fight had started in the street, it's safe to assume it would have ended there, especially if the injuries incurred by Zimmerman were a result of it. \n\nIt's safer to assume Zimmerman was following Maritn, lost sight of him between the gate and the first turn into the community, exited his vehicle, sprinted down Twin Trees, and upon seeing Martinn walking between the townhouses, cut between them himself.\n\n",
                                                                                    "author": "shayne1987",
                                                                                    "created_utc": 1372658617.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_casolkw",
                    "parent_id": "t1_casle0z",
                    "body": "Rule one man",
                    "author": "keenan123",
                    "created_utc": 1372524289.0,
                    "replies": []
                },
                {
                    "name": "t1_caunano",
                    "parent_id": "t1_casle0z",
                    "body": "Trayvon was 3\" taller and 40 pounds lighter.",
                    "author": "Scubetrolis",
                    "created_utc": 1372790580.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_caslh9c",
            "parent_id": "t3_1haww9",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1372509910.0,
            "replies": [
                {
                    "name": "t1_caso8ih",
                    "parent_id": "t1_caslh9c",
                    "body": "Rule 1",
                    "author": "ThePantsParty",
                    "created_utc": 1372522938.0,
                    "replies": [
                        {
                            "name": "t1_casoidy",
                            "parent_id": "t1_caso8ih",
                            "body": "Oh. Well. I'm not sure how I got here. Didn't know this was a sub. ",
                            "author": "I_AM_BARACKOBAMA",
                            "created_utc": 1372523967.0,
                            "replies": [
                                {
                                    "name": "t1_casol6x",
                                    "parent_id": "t1_casoidy",
                                    "body": "No worries, a lot of new people don't see it so we just point it out.  It's one of the best subreddits right now, so check it out more. ",
                                    "author": "ThePantsParty",
                                    "created_utc": 1372524248.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_casp0f8",
                    "parent_id": "t1_caslh9c",
                    "body": "Rule 1\n\n&gt; Direct responses to a CMV post must challenge at least one aspect of OP’s current view \n\n",
                    "author": "Amablue",
                    "created_utc": 1372525793.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_caslpxs",
            "parent_id": "t3_1haww9",
            "body": "It's going to be a question of negligence now. Was Zimmerman negligent for approaching Trayvon. Murder 2 is out the door with Good's testimony, but manslaughter could be possible. Just my opinion.",
            "author": "denimdays",
            "created_utc": 1372511498.0,
            "replies": [
                {
                    "name": "t1_casp3ui",
                    "parent_id": "t1_caslpxs",
                    "body": "According to testimony from the star witness. Trayvon lost Zimmerman and then was at his Daddy Fiancé House. \n\nIn order for Trayvon to get into a confrontation with Zimmerman, Trayvon would have had to double back and go looking for Zimmerman. \n\nZimmerman never approached Trayvon. All he did was follow from a distance in order to relay information to dispatch. ",
                    "author": "I_AM_BARACKOBAMA",
                    "created_utc": 1372526124.0,
                    "replies": [
                        {
                            "name": "t1_casqgem",
                            "parent_id": "t1_casp3ui",
                            "body": "Zimmerman lost Martin at 7:13:10 and killed him at 7:16:55. I think it's far more likely that treyvon was heading back to his house and ran into zimmerman than martin got back and then left to double back in four minutes, thats not even including the altercation that occured, most likely lasting at least a minute",
                            "author": "keenan123",
                            "created_utc": 1372530894.0,
                            "replies": [
                                {
                                    "name": "t1_casqo9d",
                                    "parent_id": "t1_casqgem",
                                    "body": "What you find more likely and what the evidence shows are two very different things. I'll believe the evidence. ",
                                    "author": "I_AM_BARACKOBAMA",
                                    "created_utc": 1372531648.0,
                                    "replies": [
                                        {
                                            "name": "t1_casqt3t",
                                            "parent_id": "t1_casqo9d",
                                            "body": "That's not true, Those two dates are evidence. Ok so I worded it wrong. It is literally impossible for Martin to have run back to his house, then double back, lie in wait for zimmerman, and then ambush, talk to, fight with and get shot by him in the span of less than four minutes. How's that for evidence?\nhttp://marinadedave.com/storage/New%20Trayvon%20Map.jpg?__SQUARESPACE_CACHEVERSION=1333760270016",
                                            "author": "keenan123",
                                            "created_utc": 1372532110.0,
                                            "replies": [
                                                {
                                                    "name": "t1_casqy2u",
                                                    "parent_id": "t1_casqt3t",
                                                    "body": "So you're calling Trayvon a liar?\n\nI agree with you. ",
                                                    "author": "I_AM_BARACKOBAMA",
                                                    "created_utc": 1372532601.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_casr2xj",
                                                            "parent_id": "t1_casqy2u",
                                                            "body": "yeah I have no doubt that he or she lied or misunderstood, but that doesn't mean he deserves to die... Yeah I have no doubt that he said someone was chasing me but its fine I got back to my house when in actuality he was about to get to the street leading to the house, the very same street Zimmerman was on looking for him. leading to the altercation. If Zimmerman didn't identify himself then that's all that really matters. You can't legally chase someone through the dark and then act aggressive when you are face to face with them and then claim you were defending yourself. It's not how the law applies",
                                                            "author": "keenan123",
                                                            "created_utc": 1372533073.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cast4vh",
                                                                    "parent_id": "t1_casr2xj",
                                                                    "body": "No, you can run behind someone at night. That is not illegal in the slightest. ",
                                                                    "author": "xPlasma",
                                                                    "created_utc": 1372540547.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_cast96c",
                                                                            "parent_id": "t1_cast4vh",
                                                                            "body": "That wasn't his behavior was it. His behavior would have made the average person fear for their physical safety. You can't stare at a person and then leave your car and begin to approach them and then follow them while maintaining a full sprint. That's illegal. Its called harassment and is often used as to develop a self defense argument",
                                                                            "author": "keenan123",
                                                                            "created_utc": 1372541003.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "name": "t1_casuk7p",
                                                    "parent_id": "t1_casqt3t",
                                                    "body": "Zimmerman was heard running in the 911 tape from the wind in the receiver. This lasts long enough for him to reach the t-intersection (a logical spot to be, 1. because Martin said he was going to the back of his house, 2. because it's the fastest paved route to there, 3. because Zimmerman is following Martin and doesn't know which direction he is going  so he wouldn't know which way to go to cut him off, 4. The long straight-line view would give enable him to watch Martin's movements and report them to the 911 operator). If he did reach this intersection, he spent 4 minutes moving approximately 30 feet to the South, which is where they were found to be engaged in a fight when the neighbors' 911 calls started up.\n\nZimmerman wouldn't have known which direction Martin was turning in the dark and behind the Lauer house, so it doesn't make sense for him to go South. But even if he did, he wasn't running long enough to cut him off, when Martin was also running and had a head start. We know they didn't encounter one another for the minute and a half Zimmerman was still on the phone with 911...both parties said they lost the other. For Martin to not have made it South of the Lauer/Good townhouse building, he would have had to be going slower than 2mph on average in his run (270'/90sec), which is the speed of casual inside-the-house walking. A brisk walk is 4 mph.\n\nAlso, the map is wrong in at least one way. Martin did not enter through the main gate, he cut through a lawn off the map to the left and went down Retreat View Cir. It seems to have been written up when the case was new and the 'facts' were whatever the media wished them to be.",
                                                    "author": "Krazy19Karl",
                                                    "created_utc": 1372545815.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_casur7p",
                                                            "parent_id": "t1_casuk7p",
                                                            "body": "Okay but that assumes that he A) knew exactly where he was. The head of the damn neighborhood watch gets lost but trayvon martin keeps his bearings in pitch black and can navigate back to a house that he doesn't even live in. B) He intended to go directly back to his house, I'm not sure about you but every time someone makes the same turn as me three times in a row near my house I at least circle the block first. C) was moving at all. It was pitch black in the area where Trayvon was, It seems incredibly likely that he choose that spot to sit and wait. Then when he heard Zimmerman go by he made his call and began moving back towards the house (Point B) at which point he \"Pops out of the bushes\" right next to zimmerman as he is doubling back to get to his car. \n\nThis is all conjecture but then again all of this is conjecture, except for the testimony of an 18 year old and lets face it, if I called my girlfriend after being chased into a bush by some man I wouldn't tell her I was still in danger either",
                                                            "author": "keenan123",
                                                            "created_utc": 1372546544.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_casv9z7",
                                                                    "parent_id": "t1_casur7p",
                                                                    "body": "A) I'm not aware of any claims that Zimmerman was lost. He couldn't recall the name of the street he was on. Martin told Rachel he was going to the rear of his house...it seems he was going in the right direction.\n\nB) Circling the block while on foot will increase your exposure by a great deal.\n\nC) If Martin were hiding behind a bush, it would explain quite a bit, but both people said they had lost sight of the other. If Martin were behind a bush, he should have been able to see Zimmerman pass. In this scenario, Zimmerman is not pursuing Martin as many Martin supporters would have you believe.\n\nIf all our theories are conjecture, why is a trial needed in the first place. The state has already admitted that they can't say who started the fight, and I've only heard one witness statement that conflicts with Zimmerman's story (the ear witness who thought she heard left to right motion, but did not include this in her account until the day of the trial and signed a petition implying her sympathies lay with the Martin family).",
                                                                    "author": "Krazy19Karl",
                                                                    "created_utc": 1372548536.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_casvg82",
                                                                            "parent_id": "t1_casv9z7",
                                                                            "body": "&amp;#8710; It's my opinion that Zimmerman did in fact chase Martin down and the time period does seem to indicate it. I also feel that Martin was justified in his fear of Zimmerman and that because of that he has a legal right to attack him. Finally I believe that you haven't heard a conflicting story because no one really saw anything. But the prosecution needs to prove beyond reasonable doubt and I have to agree based on all of the information given that they won't be able to do that unless they can prove that Zimmerman was chasing Martin to begin with. So I guess you have changed my view since this thread was about whether he will be found guilty not whether he is guilty",
                                                                            "author": "keenan123",
                                                                            "created_utc": 1372549164.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_casvodw",
                                                                                    "parent_id": "t1_casvg82",
                                                                                    "body": "Confirmed: 1 delta awarded to /u/Krazy19Karl",
                                                                                    "author": "DeltaBot",
                                                                                    "created_utc": 1372550003.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "name": "t1_casuxac",
                                                    "parent_id": "t1_casqt3t",
                                                    "body": "That image is wrong. The shooting happened just a yard or two from the T.\n\nZimmerman did not circle around or move down the T at any time according to testimony and his story.",
                                                    "author": "SecretChristian",
                                                    "created_utc": 1372547202.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_casuw6d",
                                    "parent_id": "t1_casqgem",
                                    "body": "Except that Martin went south to his house, then came back to the place where zimmerman was. Zimmerman didn't move from the point (the T) where he lost martin. But, according to witnesses (including Martin's ex-gf, the one who he was talking to on the phone prior to his death) and Zimmerman's story, Martin went down the T towards or to his house, then came back up the T to confront Zimmerman.",
                                    "author": "SecretChristian",
                                    "created_utc": 1372547079.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_caslsxi",
            "parent_id": "t3_1haww9",
            "body": "It's going to be very different to change your view when;\n\n1) All of the evidence so far suggests you're right \n\nand\n\n2) The Defense hasn't even started making its case yet",
            "author": "Habbledeedash",
            "created_utc": 1372512008.0,
            "replies": [
                {
                    "name": "t1_casoqzt",
                    "parent_id": "t1_caslsxi",
                    "body": "Are you kidding about #2. The defense has been hanging itself with all of its witnesses.",
                    "author": "ignig",
                    "created_utc": 1372524856.0,
                    "replies": [
                        {
                            "name": "t1_casovb6",
                            "parent_id": "t1_casoqzt",
                            "body": "In US courts, the procedure is to start with opening statements, then the prosecution makes its case, then the defense makes its case, then closing arguments, and finally the jury makes it verdict.  The State of Florida v George Zimmerman is currently on the prosecution's case.",
                            "author": "Nachthymnen",
                            "created_utc": 1372525287.0,
                            "replies": [
                                {
                                    "name": "t1_casoyvc",
                                    "parent_id": "t1_casovb6",
                                    "body": "Shit I read it \"the prosecution hasn't began to make their case\"",
                                    "author": "ignig",
                                    "created_utc": 1372525640.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_caslzl7",
            "parent_id": "t3_1haww9",
            "body": "&gt;witness said that Trayvon Martin was on top of him in an MMA type position and that Zimmerman looked real beat up when witnesses first got there.\n\nNo witness could identify exactly who it was on top of who.\n\nAside from from that, all we know is there was a fight, and it seems the guy that lost shot the guy that won. If they can't prove Martin was the aggressor, Zimmerman gets charged.",
            "author": "shayne1987",
            "created_utc": 1372513059.0,
            "replies": [
                {
                    "name": "t1_casp4cj",
                    "parent_id": "t1_caslzl7",
                    "body": "[deleted]",
                    "author": "[deleted]",
                    "created_utc": 1372526174.0,
                    "replies": [
                        {
                            "name": "t1_casqwgm",
                            "parent_id": "t1_casp4cj",
                            "body": "&gt;He said he couldn't say with 100 percent certainty who it was calling out for help — though he thought it was Zimmerman. And he also acknowledged that he didn't see the punches connect, he just saw \"arm movement going downward.\"\n\n&gt;\"I couldn't tell 100 percent that there was actually fists hitting faces,\" he said.\n\nIf you've ever seen a fight first hand, you know when someone gets hit. It's a sickening sound. Sounds like the guy on top was trying to restrain the guy on the bottom.\n\nAside from that.\n\n&gt;Zimmerman had written on a form reciting his medical history that he was exercising three times a week by doing mixed martial arts, a statement that prosecutor Bernie de la Rionda asked her to repeat.\n\nIt's more than possible the majority of the injuries witnessed that night were from an earlier incident while \"exercising\". \n",
                            "author": "shayne1987",
                            "created_utc": 1372532438.0,
                            "replies": [
                                {
                                    "name": "t1_casryec",
                                    "parent_id": "t1_casqwgm",
                                    "body": "[deleted]",
                                    "author": "[deleted]",
                                    "created_utc": 1372536209.0,
                                    "replies": [
                                        {
                                            "name": "t1_cassbtr",
                                            "parent_id": "t1_casryec",
                                            "body": "&gt;According to Zimmerman, at some point Trayvon was slamming Zimmerman's head into the concrete, then trying to cover his mouth as he was screaming for help\n\n*According to Zimmerman*\n\nNot a single person saw this happen, and multiple people actually heard \"someone\" screaming for help. \n\n&gt;told Zimmerman he was going to die that night after seeing the gun, and tried to reach for the gun before Zimmerman reached for it.\n\nSo Zimmerman was armed when the physical confrontation commenced,  Yet assumed he could reasonably expect a person capable of physically overpowering him wouldn't try to take it?\n\nWas he properly trained in handling a firearm, as someone patrolling the streets of a residential neighborhood, armed, should be? \n\nAside from all of that, *IF* Zimmerman was being substantially overpowered, when did the opportunity arise for him to get control of the firearm and fire the fatal shot?\n\n&gt;Are you honestly trying to tell me that if you were in that situation, having your head pounded against the ground, you wouldn't try to defend yourself by any means possible?\n\nI'm telling you if I'm on neighborhood watch, I'm not riding around with a loaded gun in a residential neighborhood following every young dude in a hoodie just... walking. Seems like making yourself a tad more approachable would actually be more effective.",
                                            "author": "shayne1987",
                                            "created_utc": 1372537561.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_casuynv",
                                    "parent_id": "t1_casqwgm",
                                    "body": "He had wasn't doing MMA at the time of the shooting -- that was some time in the past with regard to the shooting.",
                                    "author": "SecretChristian",
                                    "created_utc": 1372547351.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_casmkvg",
            "parent_id": "t3_1haww9",
            "body": "No one is saying zimmermen didn't kill that kid. Not even him. What he's saying is that he had to defend himself. Now he defended himself from a 17 year old kid by killing him. Now I disagree with his side of the story but for the sake of the argument let's say it went down like that. The fact still remains that he was following this kid in his car, called the police, was instructed not to approach the kid and then did approach the kid. Now if I was a kid being followed by some man with no authority over me and then he got out of his car and approached me, I would probably fear for my personal safety a great deal and, based on the exact same Florida law Zimmerman is currently using, I would defend myself with any force I deemed neccesary. Zimmerman followed martin, and approached him against police recommendation and there for holds the responsibility for treyvons death ",
            "author": "keenan123",
            "created_utc": 1372516106.0,
            "replies": [
                {
                    "name": "t1_casoa5k",
                    "parent_id": "t1_casmkvg",
                    "body": "&gt; Zimmerman followed martin, and approached him against police recommendation and there for holds the responsibility for treyvons death \n\nNow that they ruled that all the previous 911 calls Zimmerman made are admissible (over 50 of them?!), his status as neighborhood busybody/harasser is going to be even more solidified.  If he's convicted, I think it'll be largely because of what you said here in conjunction with his past actions.",
                    "author": "ThePantsParty",
                    "created_utc": 1372523114.0,
                    "replies": [
                        {
                            "name": "t1_cau6pbu",
                            "parent_id": "t1_casoa5k",
                            "body": "Well, that doesn't make a whole lot of sense.  He's made over 50 other calls to the police about other possible issues?  That establishes:\n\n1. He is taking the proper course of action (calling the police) every time he sees something out of the ordinary.. Goodbye racist \"vigilante\" motive.\n\n2. It actually paints him in a somewhat passive light to jurors.  A cold blooded killer, or hell, a guy that is looking to pick a fight would never call the police first and now you've got clear records that he's done this on all occasions.\n\n3. MOST IMPORTANTLY:  He's handled every single one of those issues or potential issues without firing a shot or attacking anyone.  This establishes that Zimmerman has a great track record of dealing with neighborhood problems.\n\nNone of this is in any way painting Zimmerman in a bad light.",
                            "author": "master_of_swagnetism",
                            "created_utc": 1372729562.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_casp72w",
                    "parent_id": "t1_casmkvg",
                    "body": "[deleted]",
                    "author": "[deleted]",
                    "created_utc": 1372526444.0,
                    "replies": [
                        {
                            "name": "t1_casq3fm",
                            "parent_id": "t1_casp72w",
                            "body": "http://marinadedave.com/storage/New%20Trayvon%20Map.jpg?__SQUARESPACE_CACHEVERSION=1333760270016\n\nBased on this map, Zimmerman followed Martin either to the point of the shooting or went around the block in an attempt to head him off, either way the evidence seems to support the idea that, even if unintentionally, Zimmerman Sprinted at full speed after Martin through the neighborhood. In response Martin ducked into the bushes to gain the element of surprise or was in fact confronted by Zimmerman as hey circled around the block. Furthermore it's clear that Zimmerman wasn't \"looking for a street sign\" based on the fact that he passed two or three intersections on his way to the shooting sight and couldn't have been realistically \"returning to his car\" based on the route he would have had to take\n\nEdit: If you're being chased and fear for your life and see no way of outrunning your attacker, you have a legal right to hide and attack him a form of self defense\n\nEdit 2: It's Statute 776.041 section (2) the aggressor can claim self defense if \"In good faith, the person withdraws from physical contact with the assailant and indicates clearly to the assailant that he or she desires to withdraw and terminate the use of force, but the assailant continues or resumes the use of force\". ",
                            "author": "keenan123",
                            "created_utc": 1372529628.0,
                            "replies": [
                                {
                                    "name": "t1_castd6d",
                                    "parent_id": "t1_casq3fm",
                                    "body": "Your map is wrong, and your analysis is way off. Zimmerman walked  from his truck straight across the T to Retreat View Circle to get an address because he didn't know the name of the street he was on. The altercation happened when he was walking back and the shooting was right behind the northernmost house, not as far south as your map shows.",
                                    "author": "Max_Heiliger",
                                    "created_utc": 1372541421.0,
                                    "replies": [
                                        {
                                            "name": "t1_castiji",
                                            "parent_id": "t1_castd6d",
                                            "body": "So What you're claiming then is that george Zimmerman lost sight of trayvon running down a straight line, then decided to spend three minutes walking what couldn't have been more than a few hundred feet. Meanwhile, trayvon martin what, circles around the house looking for zimmerman and instead of waiting to ambush him at his car he chooses some arbitrary spot in some bushes around the corner, makes a phone call and is still able to ambush zimmerman in that time period?\n\nAlso the map shows the shooting happening directly behind the northernmost house\n",
                                            "author": "keenan123",
                                            "created_utc": 1372541965.0,
                                            "replies": [
                                                {
                                                    "name": "t1_castx8f",
                                                    "parent_id": "t1_castiji",
                                                    "body": "That's what George Zimmerman is claiming, and thus far there is zero evidence to refute it. I'm much more inclined to believe his account than your completely fictional one. He didn't loose sight of him down a straight line. He lost sight of him when Trayvon turned down the sidewalk into the greenway behind the houses. When Zimmerman approached the turn he could not see Trayvon because there are no lights behind the houses, so he continued straight to get an address for the police officer. There was at the very most 2:30 between Zimmerman getting off the phone and the fight starting, and that is assuming that the first 911 call came in right when the fight started, which is a huge stretch. The distance he walked is about 370 feet and he had to find an address in the dark on the other side. So no, I don't find two minutes to be an odd amount of time for that to take place. The spot where the fight happened was pitch black. There were street lights by Zimmerman's car. If you were planning to ambush someone doing so in the place where the fight happened makes infinitely more sense than doing it on the street.",
                                                    "author": "Max_Heiliger",
                                                    "created_utc": 1372543456.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_casu3g1",
                                                            "parent_id": "t1_castx8f",
                                                            "body": "That would also be a pretty good place to hide right? Zimmerman's account of trayvon's whereabouts are all conjecture. First of all we know that he already lied in testimony about whether or not he was chasing trayvon to begin with. I don't really think it would take you two minutes to make the distance without at least continuing to look for him, plus anyone would continue to look for someone they were chasing. So he never took himself our of the position of aggressor. I find it much more likely conjecture that treyvon ran around the corner and hid in the bushes. Then when Zimmerman came back toward him he decided to use the element of surprise to defend himself. Not enough time had passed for Zimmerman to have really actively taken himself out of the aggressor role and his reactions in the altercation definitely did nothing to improve it. Being that Zimmerman's accounts are half truths at best ( he readily admits he lost treyvon so he can't really know where he was) I think my conjecture is hardly ficticious. In still using the facts that Zimmerman gave so really its about as likely as his",
                                                            "author": "keenan123",
                                                            "created_utc": 1372544089.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_casuai2",
                                                                    "parent_id": "t1_casu3g1",
                                                                    "body": "How are they conjecture? He said he saw him turn down the sidewalk. That is a direct observation, not a conjecture. He did not claim to know his whereabouts after that point until he says Trayvon approached him. When did he lie in testimony and what evidence shows that he did? I don't see any testimony where he claims not to have followed him. \n\n&gt;So he never took himself our of the position of aggressor.\n\nThis statement makes absolutely no sense. Following someone is not an aggressive action. Especially when you are doing so to report his postion to the police.\n\n&gt;Then when Zimmerman came back toward him he decided to use the element of surprise to defend himself.\n\nUsing to element of surprise to \"defend\" yourself is not only a complete oxymoron but doesn't agree with any of the witness testimony. Even Rachel Jeantel said that it was Trayvon who yelled out \"why are you following me?\" right before the fight.\n\n\n",
                                                                    "author": "Max_Heiliger",
                                                                    "created_utc": 1372544800.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_casujhc",
                                                                            "parent_id": "t1_casuai2",
                                                                            "body": "I have no doubt that he saw him turn down the sidewalk. I'm not really sure how that refutes my statements. Yes, chasing someone down is an act of aggression that does make you the aggressor. Even Zimmerman's own defense recognizes that, they claim that after he lost sight of Trayvon he suddenly lost the role of aggressor. Finally, I'm not sure how your last point goes against mine either. How is it hard to believe that Trayvon ran around the corner, hid in the bushes, then called when Zimmerman ran past him. As he was leaving the bushes he ran into Zimmerman doubling back. And yeah you can use the element of surprise to defend yourself. If someone just chased you down at night and then you came face to face with him and he didn't identify himself or give any explanation for his actions, you can defend yourself to prevent bodily harm.\n\nAnd in response to his claims. His initial testimony to Police was that he was merely running in the same direction as Martin to try and get the street information, but he later admitted that he was in fact chasing him.",
                                                                            "author": "keenan123",
                                                                            "created_utc": 1372545734.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_casur9o",
                                                                                    "parent_id": "t1_casujhc",
                                                                                    "body": "I guess I misunderstood your position because the events as you are describing them do not describe a defensive action by Trayon. If it happened that way then Zimmerman is completely innocent. Preemptively attacking someone is not self defense. I don't know where you got that idea, but it has no basis in law unless that person has made an explicit threat of violence. Merely following someone does not constitute such a threat, not in the courtroom nor in life. It could very well be that Trayvon was scared and thought he was justified in attacking. But he wasn't and it certainly doesn't justify slamming Zimmerman's head into the cement, which could have easily killed him. It most definitely doesn't make Zimmerman guilty of anything.",
                                                                                    "author": "Max_Heiliger",
                                                                                    "created_utc": 1372546549.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "name": "t1_caxueen",
                                                            "parent_id": "t1_castx8f",
                                                            "body": "x",
                                                            "author": "chefontheloose",
                                                            "created_utc": 1373238035.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_catr9j9",
                    "parent_id": "t1_casmkvg",
                    "body": "Too bad recent court transcripts show thats not what happened.\n\nZimmerman stopped following him, and lost him completely.\n\nMartin came back, found Zimmerman and beat the shit out of him.   \nZimmerman will walk for proper self defense.\n\nAll those women jurors are going to think to themselves, would I shoot a man, on top of me in an MMA mount position, raining down strikes, in MMA ground and pound style?  (the way a witness described it).\n\nThey are going to think... you bet your sweet ass I would.   100% self defense against a violent thug.\n\n",
                    "author": "ak47girl",
                    "created_utc": 1372686470.0,
                    "replies": [
                        {
                            "name": "t1_catuq7i",
                            "parent_id": "t1_catr9j9",
                            "body": "&gt;Zimmerman stopped following him, and lost him completely.\n\nThe end of his 911 call pretty well proves he never stopped following Trayvon. \n\nWhy would he ask police to call him once they arrived so he could give them his location? Not because he didn't know where he was, but because he didn't know where he would be, suggesting he was still pursuing Martin.\n\n&gt;All those women jurors are going to think to themselves, would I shoot a man, on top of me in an MMA mount position, raining down strikes, in MMA ground and pound style? (the way a witness described it). \n\nOr they're going to think, \"Why the hell would this dude get out of the car with a loaded gun while trying to avoid a confrontation?\" ",
                            "author": "shayne1987",
                            "created_utc": 1372697531.0,
                            "replies": [
                                {
                                    "name": "t1_catuta7",
                                    "parent_id": "t1_catuq7i",
                                    "body": "&gt;The end of his 911 call pretty well proves he never stopped following Trayvon.\n\nIn court it was made clear that zimmerman lost sight of him and didnt know where he was, and was going back to his truck when the encounter occurred.\nSorry you are so out of date on the facts of the case.\n\n&gt;Or they're going to think, \"Why the hell would this dude get out of the car with a loaded gun while trying to avoid a confrontation?\"\n\nWhich is idiotic, because there is no law in following someone and he was legally carrying a firearm.    So that has jack shit to do with anyone.\n\nI can openly holster my firearm, walk out of my house and start following someone on the sidewalk, that does not give them the legal right to smash my face in, mount me, and slam my head into the ground. I could legally then use lethal force.\n\nSo far, its clear zimmerman is going to walk, he did nothing illegal.  He defended himself from a violent attack from a thug that texted about drugs and fighting.\n",
                                    "author": "ak47girl",
                                    "created_utc": 1372697761.0,
                                    "replies": [
                                        {
                                            "name": "t1_catv41c",
                                            "parent_id": "t1_catuta7",
                                            "body": "&gt;In court it was made clear that zimmerman lost sight of him and didnt know where he was, and was going back to his truck when the encounter occurred.\n\nBecause he had lost sight means he stopped pursuing him? He knew the general direction in which he traveled, that was made clear when he said \"he's running\", it's more than safe to assume Zimmerman continued in that direction. \n\n*No one saw the start of the fight*. Eyewitness testimony starts with Zimmerman on his back, Trayvon making downward arm motions, *someone* screaming for help, and a shot ringing out. That's as far as it goes. A few of the witnesses actually stated there was no struggle at the time if the shooting, one going as far to say as Zimmerman \"meant for the kid to die\".\n\nSo, sorry you're cherry picking facts, but everything points to Zimmerman writing a check his ass couldn't cash without a pistol. \n\n&gt;I can openly holster my firearm, walk out of my house and start following someone on the sidewalk\n\nNo, that's called *menacing*. It's a crime in Ohio at least.\n\n&gt;So far, its clear zimmerman is going to walk, he did nothing illegal. He defended himself from a violent attack from a thug that texted about drugs and fighting.\n\nHe was what's called *negligent*. You can't just do shit like that without identifying yourself. Period.\n\n",
                                            "author": "shayne1987",
                                            "created_utc": 1372698586.0,
                                            "replies": [
                                                {
                                                    "name": "t1_catvoqn",
                                                    "parent_id": "t1_catv41c",
                                                    "body": "&gt; it's more than safe to assume Zimmerman continued in that direction.\n\nLMFAO.  You are not free to just MAKE SHIT UP.  There is NO evidence he continued to follow him.   You cant follow someone who you lost track of.  He was heading back to his truck, and there is evidence of this.  Stop making shit up.\n\n&gt;No one saw the start of the fight.\n\nRight... so you cannot assert in any way that Zimmerman started it. That goes in his favor.  We can only rule on the evidence, and the evidence shows a thug on top of zimmerman beating the shit out of him.  Any reasonable person would respond with force in this scenario.  Remember you have to prove he is guilty. He doesnt have to prove his innocence, that is the default.\n\n&gt;No, that's called menacing. It's a crime in Ohio at least.\nLOL no its not.  You need to look up the legal definition.   \n\n&gt;He was what's called negligent. \n\nFor fucks sake you cant just make up the definition of shit moron.  Its not negligent to shoot someone beating the shit out of you.   \n\nIts amazing how you have to pathetically make shit up and twist the definitions of everything to try and prove zimmerman is guilty. \n\nZimmerman was in the middle of a fight where he got his nose broken and head smashed into the concrete by a larger athletic younger man who had him in a mounted position raining strikes down at him.\n\nWhat would a cop do in this scenario?   Oh yeah... fucking shoot you.  Which is exactly what a citizen should do to defend themselves too.   Doesnt even matter who started the fight.   You are required by law to stop attacking someone the moment you can.   Clearly thug Martin didnt stop attacking and get off of zimmerman from a mounted position while he screamed for help, so he got his ass shit.   He got shot due to his own poor thug decisions.\n\n",
                                                    "author": "ak47girl",
                                                    "created_utc": 1372700141.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_catwy9u",
                                                            "parent_id": "t1_catvoqn",
                                                            "body": "&gt;There is NO evidence he continued to follow him. \n\nThe end of the his 911 call, where he tells police to call him once they arrive so he can give them his location, is PROOF he moved past the first intersection past the North Gate. Why else would he need police to call and ascertain his location if he was not mobile? He didn't know where he would be when police arrived but didn't want to make that clear to police, is *a lot* more believable than Martin running from Zimmerman, then doubling back in an attempt to confront him. \n\n&gt;We can only rule on the evidence, and the evidence shows a thug on top of zimmerman beating the shit out of him.\n\nThe evidence shows Zimmerman git beat up at some point, the eyewitness testimony, ALL OF IT, suggests the situation had pacified into a *struggle*, there were no clear punches thrown, only \"downward arm motions\" by the person on top. \n\nAlso, no one knows who it was screaming for help. If you had listened to the 911 calls, the calls for help were audible until the gunshot, the last call for help actually ceasing *the instant the gunshot is heard*, suggesting it was Trayvon calling for help, not Zimmerman.\n\nIf it was Zimmerman, it's reasonable to assume he would have called for help at least one last time, as he said himself he was not sure the shot had hit Martin. \n\n&gt;LOL no its not. You need to look up the legal definition.\n\nMenacing... aka *stalking*, is a crime. You cannot just follow someone everywhere they go for no discernable reason, and without identifying yourself. You'd be stalking them.\n\n&gt;Its not negligent to shoot someone beating the shit out of you.\n\nIt's negligent to precipitate a confrontation that leads to you getting beat up. \n\nThe behavior Zimmerman took note of was \"walking in the rain, looking about\". That was the suspicious behavior that caused Zimmerman to take note of the kid. Martin was not involved in any criminal behavior at the time, nor did he have the tools to suggest he was intent on breaking and entering. The worst he did was run from someone unknown to him who had been following him, which is a perfectly reasonable thing to do in that situation. \n\n&gt;Zimmerman was in the middle of a fight where he got his nose broken and head smashed into the concrete by a larger athletic younger man who had him in a mounted position raining strikes down at him.\n\nAll eyewitness testimony says it was a \"scuffle, struggle, wrestling\". No one witnessed him being beaten, no one witnessed his head being smashed on the concrete, no one witnessed the catalyst, what we know is these two were struggling over something, and Trayvon ended up dead. PERIOD.\n\n&gt;You are required by law to stop attacking someone the moment you can. \n\nEven under Florida's Stand your ground law, self defense claims are nulled if it is found you had a reasonable avenue of safe retreat. If Zimmerman would have stayed in his car, presumably the situation never escalates to a physical confrontation, which never leads to Martin's death. \n\nThere's also the \"Goldilocks\" standard, which means you can only use force proportional to the threat in an attempt to defend yourself. \n\nIf all eye witness accounts are accurate, and the situation had pacified into Maritn attempting to subdue Zimmerman, then the force used by Zimmerman, I.E. the gun, was disproportionate to the force used by Martin, I.E. brute strength. \n\nKeep in mind *no one saw Zimmermans head being smashed into the sidewalk*. This claim rests completely on the reliability of the statement from  a man who couldn't even remember his own fucking address. \n",
                                                            "author": "shayne1987",
                                                            "created_utc": 1372703528.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_catx9hg",
                                                                    "parent_id": "t1_catwy9u",
                                                                    "body": "&gt;the eyewitness testimony, ALL OF IT, suggests the situation had pacified into a struggle, there were no clear punches thrown, only \"downward arm motions\" by the person on top.\n\nLMFAAOOOOO..... we can stop right here at how fucking ridiculous you sound. OMFG!!!!!!!!!!!!!!!!!!\n\n\nYeah, martin was mounted on zimmerman, throwing punch like downward motions with his arms.... and the broken nose, bloodied face and torn up rear head ALL MAGICALLY FUCKING HAPPENED BY THEMSELVES!!!! NO CORRELATION I SWEAR YOUR HONOR!!!!!!!!!! \n\n\nLOLOLOLOLOLOLOLOLOLOOLOLOLOLOLOLOLOLOL\nYOU ARE THE BIGGEST LAUGHING STOCK ON REDDIT RIGHT NOW!!! LMFAOOOOOOOO!!!!!!!!\n\n\nThanks for the laughs.... cant wait to tell all my friends this and watch them spit up their drinks.\n\nDim wits like you are exactly why this country is so fucked.\n\n",
                                                                    "author": "ak47girl",
                                                                    "created_utc": 1372704361.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_catxk2l",
                                                                            "parent_id": "t1_catx9hg",
                                                                            "body": "&gt;Yeah, martin was mounted on zimmerman, throwing punch like downward motions with his arms.... and the broken nose, bloodied face and torn up rear head ALL MAGICALLY FUCKING HAPPENED BY THEMSELVES!!!!\n\nLet me slow this down for....\n\n The moment... Zimmerman shot... Martin... His life was not.... in danger... all eye witness... accounts... said they were.... \"scuffling, struggling, wrestling\"... No one heard punches... No one saw his head being smashed on the ground.... No one heard... Martin say.... You're gonna die.... No one can definitively say who was screaming for help...\n\nRegardless of... the injuries.... at the moment.... Zimmerman pulled.... the trigger.... what reason.... did he.... have to.... believe he.... was in danger.... of losing his life..... a side from the gun..... he introduced.... into the situation.....?",
                                                                            "author": "shayne1987",
                                                                            "created_utc": 1372705135.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "name": "t1_catxnxu",
                                                                            "parent_id": "t1_catx9hg",
                                                                            "body": "&gt;Dim wits like you are exactly why this country is so fucked.\n\nExactly... because every black guy in a nice neighborhood needs followed smgdh... take a seat little girl, you outta your league.",
                                                                            "author": "shayne1987",
                                                                            "created_utc": 1372705425.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_caty2hj",
                                                                                    "parent_id": "t1_catxnxu",
                                                                                    "body": "&gt; Yeah, martin was mounted on zimmerman, throwing punch like downward motions with his arms.... and the broken nose, bloodied face and torn up rear head ALL MAGICALLY FUCKING HAPPENED BY THEMSELVES!!!! NO CORRELATION I SWEAR YOUR HONOR!!!!!!!!!!\n&gt; LOLOLOLOLOLOLOLOLOLOOLOLOLOLOLOLOLOLOL YOU ARE THE BIGGEST LAUGHING STOCK ON REDDIT RIGHT NOW!!! LMFAOOOOOOOO!!!!!!!!\n\n\n\nCANT STOP LAUGHING!!!!!!!!!!!!!!!!!!!! LOLOLOLOLOLOLOL!!!!\n",
                                                                                    "author": "ak47girl",
                                                                                    "created_utc": 1372706509.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "name": "t1_cav2nyk",
                                                            "parent_id": "t1_catvoqn",
                                                            "body": "His nose wasn't broken. ",
                                                            "author": "418156",
                                                            "created_utc": 1372839172.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cavgsj7",
                                                                    "parent_id": "t1_cav2nyk",
                                                                    "body": "ABC NEWS REPORT:  \"A medical report compiled by the family physician of Trayvon Martin shooter George Zimmerman and obtained exclusively by ABC News found that Zimmerman was diagnosed with a \"closed fracture\" of his nose, a pair of black eyes, two lacerations to the back of his head and a minor back injury the day after he fatally shot Martin during an alleged altercation.\"\n\nYES HE DID\n\n",
                                                                    "author": "ak47girl",
                                                                    "created_utc": 1372889543.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_caw8joe",
                                                                            "parent_id": "t1_cavgsj7",
                                                                            "body": "If he did,  then the prosecutor lied in his opening statement. ",
                                                                            "author": "418156",
                                                                            "created_utc": 1372999781.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_caw99t4",
                                                                                    "parent_id": "t1_caw8joe",
                                                                                    "body": "They didn't lie, I watched opening statements and I know the part you are talking about.  They said a physicians assistant examined him the next day.  She said it could possible be broken, but that she also said everything was in line. \n\nThey never said it wasn't broken, it was basically left open to interpretation and that's what they wanted to do.  A nose can be broken and it still be in line.  Ultimately, Zimmerman never had an xray done and the prosecutors used that to their advantage.  They didn't lie though.",
                                                                                    "author": "wesleyt89",
                                                                                    "created_utc": 1373002649.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_caxrz4k",
                            "parent_id": "t1_catr9j9",
                            "body": "Or being women, they may feel TM had every right to confront a creepy man(GZ who most likely put his hands on TM evidence in Racheal Jentals testimony where she heard TM say \"get off get off\" because GZ didnt want to let this fucking punk get away)  that was following him in his car then gets out of that car to either follow him or look for him **without ever identifying who he was.** in the rain are we supposed to believe he got out of his car in the rain to look for an address. ",
                            "author": "frankgrimes1",
                            "created_utc": 1373230588.0,
                            "replies": [
                                {
                                    "name": "t1_cay71op",
                                    "parent_id": "t1_caxrz4k",
                                    "body": "&gt;Or being women, they may feel TM had every right to confront a creepy man\n\nYou dont have a right to physically assault a person randomly watching you. Period.  Stalking laws only apply if they have done it numerous times, so that doesnt apply here.\n\nWhy didnt Trayvon call the police???  The proper response.\n\nNaaawww... better hunt him down, break his nose, and smash his head into the ground without knowing his intentions.  \n\nIf I was a neighborhood watch person and witnessed a stranger snooping around my neighborhood, I would follow them too, call the police and try to keep following them so I could point them out when the police arrived.  Thats perfectly reasonable.  If the person then turns around a violently attacks me, yeah, Ill shoot them dead.   Do idiots really believe Zimmerman had an intention to shoot him? You dont call the police if you intent on killing someone in the next few minutes, DERP.\n\n\n\nTwo of them women on the jury have had CCW permits.  They are going to put themselves in Zimmermans position, and easily conclude they would do the same thing after taking DAMAGE\n\nThe kid is a violent thug, that decided to teach whitey a lesson just because he followed him.  He beat up the wrong person.  A COP WOULD HAVE DONE THE SAME THING, SHOOT HIM DEAD.\n",
                                    "author": "ak47girl",
                                    "created_utc": 1373291120.0,
                                    "replies": [
                                        {
                                            "name": "t1_cay7wcz",
                                            "parent_id": "t1_cay71op",
                                            "body": "&gt;You dont have a right to physically assault a person randomly watching you. Period. Stalking laws only apply if they have done it numerous times, so that doesnt apply here.\n\nActually you do if you feel threatened, just because GZ didn't touch TM does not mean he didnt feel like this \"creepy ass cracka\" was going to do any harm to him. This is the way the law is written, combine that with the stand your ground TM was well within his rights. \n I think a woman is going to be able to identify with TM more, in that he was the one who really felt threatened. \n\n&gt;without knowing his intentions.\n\nMaybe if this incompetent buffoon GZ had taken 60 seconds to actually announce that he was neighborhood watch or just roll down his window during one of the time his car was circled and ask this kid if everything was ok. Is that too much to ask from a guy that supposedly mentored young black kids. \n\n&gt;Do idiots really believe Zimmerman had an intention to shoot him? \n\nI know some believe this I don't. GZ being the **adult** and as the trained neighborhood watchman mishandled the situation and should be held responsible for the death of this kid that was defending himself from what he perceived to be a threat.\n\n&gt;A COP WOULD HAVE DONE THE SAME THING, SHOOT HIM DEAD.\n\na cop would have identified who he was. \n\n",
                                            "author": "frankgrimes1",
                                            "created_utc": 1373294185.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cayarf5",
                                                    "parent_id": "t1_cay7wcz",
                                                    "body": "&gt; Actually you do if you feel threatened, just because GZ didn't touch TM does not mean he didnt feel like this \"creepy ass cracka\" was going to do any harm to him\n\nBullshit.....  you cant double back and go after someone following you and beat the shit out of them, no matter how threatened you feel.  You are supposed to flee if possible and certainly not close the distance.  You clearly have no idea what you are talking about.\n\nIf there was video of the incident that showed Trayvon going after zimmerman and initiating contact \"because he felt threated\", this would have never remotely made it to court.  You would be laughed at.  No attorney could repeat that nonsense with a straight face.\n\nWell your honor... you see.... this guy was 50 yards from me... and I felt sooooo threatened by the white ass cracker waaaaaaaaay over there.... that I immediately closed the distance to defend myself and beat him up!\n\nARE YOU EVEN FUCKING SERIOUS!??!?!  Do realize how idiotic this sounds? \nYour position is absurd, has no legal standing and is based on a racist emotional response from the initial media hype.\n\nZimmerman is going to rightly walk and I called this well before it went to trial.\nSO OBVIOUS.  The media decided to write a story based on their narrative, but the facts are 100% reversed. Trayvon is the only person in this case that made any kind of highly racist comment.\n\n1) Trayvon was the racist\n\n2) Trayvon was the thug\n\n3) Trayvon was the drug user and possible small time dealer\n\n4) Trayvon was the street fighter\n\n5) Trayvon attacked and did damage\n\n6) Trayvon got himself shot because he's an idiot\n\n\n\n\n\n\n\n\n\n\n\n\n",
                                                    "author": "ak47girl",
                                                    "created_utc": 1373302316.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_caybyz3",
                                                            "parent_id": "t1_cayarf5",
                                                            "body": " According to the stand your ground laws you don't have to retreat, TM had every right to be in that neighborhood. \nI guess if it was a woman being followed by a creepy ass cracker, she should just wait until she is attacked, no if she is fearful enough she could use whatever means available to protect herself. In fact GZs friend (Taffy) that is on CNN every night used this same argument. In addition its the similar to what GZ defense is using in that he felt the beating he was taking was life threatening. We know now that his injuries were nowhere close to being life threatening. But what we do know that GZ knew is that police were on their way and people were around, I will admit that is unfair for me to say that as I wasn't the one that got punched, hindsight is 20/20. \n\nFor me it comes down to George Zimmerman is an **adult and trained neighborhood watchman**. GZ knew TM was a kid. At some point he should have identified who he was as he had plenty of opportunity. He should have never left his car, IMO he left his car to catch TM, there was no other reason for him to leave his car in the rain. He needs to be punished for his incompetence. \nPlease don't assume you know what I base my position on, I very mixed emotions on the entire thing and have gone back and forth on my position. And how the media spun it had really no affect on me. One guy is dead and the other guy life is probably ruined. Both could have and should have made better decisions, however one was an adult, the other was a kid. \n\nYou should really refrain from calling TM a thug, racist, street fighter, drug dealer etc..  Ultimately with the facts on your side it those things should not matter one bit, it could have been the Pope and it would have been justified. \nGZ has a history of his own. \n",
                                                            "author": "frankgrimes1",
                                                            "created_utc": 1373305441.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_caygidg",
                                                                    "parent_id": "t1_caybyz3",
                                                                    "body": "&gt; I guess if it was a woman being followed by a creepy ass cracker, she should just wait until she is attacked, no if she is fearful enough she could use whatever means available to protect herself. \n\n\nWe can stop right here. You clearly dont have a clue about the law.\n\nYou wont find a court anywhere that wouldnt outright laugh you right out of the door, trying to explain how someone who is being followed is allowed to turn around, and close substantial distance and beat the shit out of someone because they felt threatened.  Please... stop with this outright nonsense already.\n\nYoure are biased beyond belief and have no sense of the law. Period.\n\nWhat you describe is legal assault.  Blatant, premeditated assault.  You are making Zimmermans case for him.\n\n\n\n",
                                                                    "author": "ak47girl",
                                                                    "created_utc": 1373316870.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_cayhdr7",
                                                                            "parent_id": "t1_caygidg",
                                                                            "body": "You have no clue about what I know. You are pretending to know what was going through the mind of the kid that was killed. I am astounded that you need to make up things when you have facts on your side.  Double back, substantial distance, you don't know if any of this is true. Even if he did go back home he has every right to go back out if he wanted to.  \nYou call me biased, with a and you choose a screen name of AK47GIRL. \nLike I said we have an adult and a kid that mishandled a situation, that resulted in the kids death. George Zimmerman knew he was dealing with a kid, and she should be punished. He probably wont be found guilty but he ruined his own life by being incompetent and I don't feel sorry for him.  \n",
                                                                            "author": "frankgrimes1",
                                                                            "created_utc": 1373319138.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_caywd53",
                                                                                    "parent_id": "t1_cayhdr7",
                                                                                    "body": "You clearly havent been following the case then.   George was nearly back to his truck when attacked.  It was clearly Trayvon that decided to FOLLOW HIM.\n\nThen we have witnesses stating Trayvon was on top beating him.\n\nHis knuckles showed damage.  Zimmermans none. Zimmerman has damage on his face and back of his head.\n\nThis was an open and shut case of a thug getting mad that he was being watched and then decided to become an attacker and got shot.\n\nSoon we will find there were drugs in his system. MJ for sure.\n\nThe police let Zimmerman off almost immediately because it was the right thing to do. A trial was a complete waste of time and money in an obvious case of self defense stock full of evidence.  \n\nThe ONLY reason this went to trial is because the media lied and hyped it up for profits.\n\nZimmerman is going to walk, because he is clearly innocent.  Trayvon is dead because he has a track record of violence, drug use, racism, acting like a thug street fighting, gold teeth, texting about drugs, striking bus drivers, getting caught at school with stolen property and thieves tools, etc.  He was a thug that attacked an innocent armed civilian and got himself killed. CASE OVER.\n\n\n",
                                                                                    "author": "ak47girl",
                                                                                    "created_utc": 1373373965.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_casps8a",
            "parent_id": "t3_1haww9",
            "body": "The only reason this is even in question is Florida's cowboy laws. A grown man followed a teenager, there was a fight, and the teenager was killed. I don't care if the teenager was winning the fight or if he \"started\" the fight. The fact is Zimmerman used crazy excessive force. If a cop was getting beat up would that be grounds for him to pull out his gun and kill a kid? Or would he be expected to non-leathaly handle the situation? Is Zimmerman held to a lower standard because he doesn't have police training? Then why was he following someone? Again, if this had happened in a state without stand your ground, Zimmerman would be guilty of murder. Whether or not he is guilty in Florida is not what matters. Had he not shot Martin, nobody would have died. Martin was 17, he wasn't about to beat a man to death.",
            "author": "flopgroge",
            "created_utc": 1372528523.0,
            "replies": [
                {
                    "name": "t1_casqjde",
                    "parent_id": "t1_casps8a",
                    "body": "&gt; Martin was 17, he wasn't about to beat a man to death.\n\nRegardless of whether or not Zimmerman is guilty, you have no way of knowing how the fight would have ended. Simply because he was 17 does not mean he was incapable of beating a man to death. In an alternate scenario, if it is true that Martin was bashing Zimmerman's head into the sidewalk, then Martin's actions (if he continued what he was doing) could very well have resulted in Zimmerman's death. \n\n",
                    "author": "[deleted]",
                    "created_utc": 1372531177.0,
                    "replies": [
                        {
                            "name": "t1_casqr12",
                            "parent_id": "t1_casqjde",
                            "body": "It doesn't matter, once martin learned zimmerman was armed he had a legal right to beat him to death based on the same exact laws zimmerman is using \nExcept zimmerman doesn't get to use those laws because he took first aggresion",
                            "author": "keenan123",
                            "created_utc": 1372531909.0,
                            "replies": [
                                {
                                    "name": "t1_casr12u",
                                    "parent_id": "t1_casqr12",
                                    "body": "I never said it mattered, I never said anything about who aggressed first, and I never said anything about who has the law on their side in this situation. I only pointed out that it is impossible to determine how the fight would have ended if Zimmerman had not shot Martin.",
                                    "author": "[deleted]",
                                    "created_utc": 1372532888.0,
                                    "replies": [
                                        {
                                            "name": "t1_casr457",
                                            "parent_id": "t1_casr12u",
                                            "body": "well yes that's true I agree with you on that sense. I was merely extending the thread into the hypothetical situation you brought up where treyvon sees the gun and never stops smashing zimmerman's head into the ground ",
                                            "author": "keenan123",
                                            "created_utc": 1372533194.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_cast7t5",
                                    "parent_id": "t1_casqr12",
                                    "body": "someone's possession of a gun IS NOT a reason for you to expect them to kill you. Someone bashing your head in to the sidewalk is. ",
                                    "author": "xPlasma",
                                    "created_utc": 1372540857.0,
                                    "replies": [
                                        {
                                            "name": "t1_castbcs",
                                            "parent_id": "t1_cast7t5",
                                            "body": "That's not what I said. If you fear bodily harm and then see a gun it legally raises it to fear of death and allows for deadly force to be used for self defense",
                                            "author": "keenan123",
                                            "created_utc": 1372541234.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_casrm3r",
                            "parent_id": "t1_casqjde",
                            "body": "That is true, I suppose I got a bit swept up. Without any proof of that happening though its flimsy at best. And to me the fact that Zimmerman has a history of violence only solidifies the possibility that he is at fault. This is not to say people don't change, but following a random teenager is not the sort of thing a changed man would do. ",
                            "author": "flopgroge",
                            "created_utc": 1372534978.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_casqn2s",
            "parent_id": "t3_1haww9",
            "body": "Well there is no question Zimmerman was following Martin by vehicle then by foot.  Imagine you were Martin and some dude is following you at night.  He was in fear of his safety.  He didnt know if zimmerman was  rapist, a gang member thinking Trayvon was in his territory.  So you can say he was acting in self defense by punching him.  Zimmerman is a failure of a human being playing Bruce Willis.  Then when he finds out he is not as tough as he thinks he is decides to shoot the kid.  He needs to be charged with at least man slaughter.  ",
            "author": "jakedidit",
            "created_utc": 1372531530.0,
            "replies": [
                {
                    "name": "t1_casqqh4",
                    "parent_id": "t1_casqn2s",
                    "body": "I think the prosecution would get further arguing martin's self defense. A concerned citizen has a duty to identify themselves much like a police officer. If someone chases you at full sprint and then you turn a corner when you thought you lost him and suddenly he's there and won't identify himself then that's a pretty strong argument for the use of non-deadly force to defend yourself",
                    "author": "keenan123",
                    "created_utc": 1372531855.0,
                    "replies": [
                        {
                            "name": "t1_cat5nkf",
                            "parent_id": "t1_casqqh4",
                            "body": "Good thing that's not what happened. ",
                            "author": "I_AM_BARACKOBAMA",
                            "created_utc": 1372601066.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_catr84x",
                    "parent_id": "t1_casqn2s",
                    "body": "Only a complete fucking idiot thinks there is any chance in hell you could argue in a court of law that its OK to punch someone in the face simply because they are following you.  People who dont know jack shit about the law really should keep their stupid pie holes shut.\n\nI could start following any random stranger I want on the sidewalk... even making them nervous.  As long as I dont physically assault them, they cant fucking touch me.   That would be assault.\n\n",
                    "author": "ak47girl",
                    "created_utc": 1372686307.0,
                    "replies": []
                },
                {
                    "name": "t1_cau6wz7",
                    "parent_id": "t1_casqn2s",
                    "body": "&gt;Zimmerman is a failure of a human being playing Bruce Willis.\n\nThese types of assertions are so stupid.  You're assuming his motivation for watching over his neighborhood stems from watching Die Hard when there are plenty of reasons (and good ones) to care about your neighbors.\n\nThen there's the whole \"you're not MAN enough to do it without a gun are you?\" bullshit and implying penis compensation which I'm sure most of you understand the silliness so I won't elaborate.\n\nAnd thirdly, you're contradicting yourself.  Would John McClane call the cops in a scary situation?  Are you trying to claim he's acting big and bad or claiming he's acting like a pussy? ",
                    "author": "master_of_swagnetism",
                    "created_utc": 1372730133.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_casw1gv",
            "parent_id": "t3_1haww9",
            "body": "[69]",
            "author": "solovus",
            "created_utc": 1372551376.0,
            "replies": [
                {
                    "name": "t1_catnpwf",
                    "parent_id": "t1_casw1gv",
                    "body": "&gt; The problem here is that Zimmerman pursued Martin with a gun.\n\nExcept not after reviewing the trial.",
                    "author": "reddit--hivemind",
                    "created_utc": 1372662546.0,
                    "replies": [
                        {
                            "name": "t1_caug0id",
                            "parent_id": "t1_catnpwf",
                            "body": "[21]",
                            "author": "solovus",
                            "created_utc": 1372769487.0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}