{
    "name": "t3_1aenyc",
    "title": "I have been forced by my job to go into counseling where they have classed me as aspergic and having an anger problem but I don't want to conceived as some kind of spastic that cant look after himself! CMV",
    "body": "this comes from a long line of issues of bullying from colleagues where i work as an apprentice electrical engineer\n they have made life difficult from day one and always used when ive complained the power of numbers (i.e three people with this story one with the other)\nIve never been a people person but i can deal with people and I have got lots of friends, just in different bubbles to where i work.\nwhen they push me too far and i get angry but Ive never thrown a punch Ive only ever yelled.\nPart of my job is going to a college in Wiltshire England the opposite end of the UK to where I am from Benbecula Scotland so i dont know anyone and i have spent an awful lot of the last two years lonely.\n\nbut now they've labeled me as having a fucking type of Autism and everyone around me sees completely fine with this and ive got to just be treat like a child that cant look after himself I havent lived at home for TWO YEARS! i am completely independant from my parents but my work still have the fucking CHEEK to tell them whats happening to me before telling me. \n\nI am not autistic, i have not got an anger problem, I work my ass off I pay my own way like an adult, I do all the shite parts of growing up but for some reason I am not entitled to any of the basic respect!\n\nim sorry for wasting your time",
    "author": "snippersmith",
    "num_comments": 4,
    "created_utc": 1363438892.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1aenyc/i_have_been_forced_by_my_job_to_go_into/",
    "comments": [
        {
            "name": "t1_c8wpqjn",
            "parent_id": "t3_1aenyc",
            "body": "Due to the recent # of OPs abandoning threads and never returning, I'll submit a CMV when you reply to this comment.",
            "author": "theorymeltfool",
            "created_utc": 1363442878.0,
            "replies": [
                {
                    "name": "t1_c8wrovj",
                    "parent_id": "t1_c8wpqjn",
                    "body": "hi theorymeltfool whats your opinion on the matter\n",
                    "author": "snippersmith",
                    "created_utc": 1363451223.0,
                    "replies": [
                        {
                            "name": "t1_c8wtt0z",
                            "parent_id": "t1_c8wrovj",
                            "body": "I think there's a few ways that this type of situation can be looked at, so I'll try to cover a few.\n\n&gt; when they push me too far and i get angry but Ive never thrown a punch Ive only ever yelled\n\nSometimes, it's difficult to perceive how we're coming across to colleagues. I understand that their may be some bullying involved, but it may not hurt to sit with a counselor, especially if you explain your side of the situation and how you can handle it. As long as it doesn't affect your job (which it shouldn't; that should be private information not available to co-workers), then you should look into it. Perhaps you took the hazing too far, and your yelling was enough for them to think you may get violent in the future (even though you know you won't).\n\nRemember, from their perspective, they're just giving you a hard time, something they've done to likely lots of other apprentice electrical engineers.\n\n&gt; Part of my job is going to a college in Wiltshire England the opposite end of the UK to where I am from Benbecula Scotland so i dont know anyone and i have spent an awful lot of the last two years lonely.\n\nNot sure what's it's like in Scotland/UK with people from different areas, but here in the US I can tell you that it is difficult to meet friends from the area you move to. I moved from the west coast to the east coast, and I've had a difficult time finding friends outside of people that *also* moved from the west coast. I'd try going on www.meetup.com to find groups of people to hang out with that have common interests. It took me about 3 years, but over time I found a good group of friends to hang out with, and I've also made more friends from this area (as the WC people introduced me to their EC friends, etc.)\n\n&gt; but now they've labeled me as having a fucking type of Autism and everyone around me sees completely fine with this and ive got to just be treat like a child\n\nI'd just explain that you went to a counselor, and there wasn't a problem (even if there was). After all, it should be none of their business what actually happened. Say something like, \"Leave the diagnosis up to the professionals.\" Don't get angry, just try to do your work and move on. If they bring it up, joke about it, but don't let it get to you. They're likely just trying to bust on you as a type of hazing of the 'new guy,' which I agree is bullshit, but it's difficult to get rid of due to people thinking that \"I went through with it, [now he/she has to go through with it too.\"](http://www.babson.edu/undergraduate/student-life/community-standards/hazing/Pages/hazing-facts-and-myths.aspx)\n\n&gt; I do all the shite parts of growing up but for some reason I am not entitled to any of the basic respect!\n\nThis is a tough one, but unfortunately, and this happens in all types of 'professional circles' (from Medicine, Finance, Pharmacy, Lawyers, Plumbing, Construction Unions, etc, etc,.) and the only way to 'earn their respect' is to not only to the job, but to put up with their bullshit [while *also* giving them the respect they think they deserve.](http://www.ehow.com/how_2108801_earn-respect-work.html) \n\nHere's a few more articles that may help as well:\n\nhttp://www.wisegeek.com/how-can-i-earn-respect-from-my-employees.htm\nhttp://www.askmen.com/money/successful_100/139_success.html\nhttp://www.creditworthy.com/3jm/articles/cw81706.html\nhttp://www.cracked.com/blog/6-harsh-truths-that-will-make-you-better-person/\n\nAnd if nothing else works, I'd look for a different area to work/learn. Either that or put up with until you're done with school, and get the hell out of their, as they may never change their ways regardless of what you do.\n",
                            "author": "theorymeltfool",
                            "created_utc": 1363458956.0,
                            "replies": [
                                {
                                    "name": "t1_c8wuxh2",
                                    "parent_id": "t1_c8wtt0z",
                                    "body": "Thank you for breaking it down i appreciate that, the problem for the most part lies with people that are other apprentices who are older but on the same level in the company as i am (third year apprentices) the only real difference being a 2 year age gap, I managed to get the job at a very early age leaving school as soon as is legally possible in Scotland ( i was two weeks below a threshold that would have stopped me going for the job) I suppose ive always had the fact my colleagues all have at least two years more schooling on me held on me but i have always worked on a par with them\n\nthe reason i got put into the counselling is because i made a complaint, when management confronted them i was penalised because the fact there was 3 of the main protagonists and 1 of me\n\n",
                                    "author": "snippersmith",
                                    "created_utc": 1363463090.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}