{
    "name": "t3_1hgzdt",
    "title": "I believe that the officers responsible for the Hawthorne dog killing were justified in doing so (up to a point), and that the reaction so far has been overblown. CMV",
    "body": "Full disclosure: I've had a bit of a fear of large dogs for most of my life, so that may color my viewpoint a bit. At least large dogs that I haven't gotten to know.\n\nI saw the video, and at [3:22 \\(the moment right before the first shot is fired, so TRIGGER WARNING. Seriously, it does get pretty fucked up afterwards\\)](http://www.youtube.com/watch?feature=player_detailpage&amp;v=WDBZr4ie2AE#t=202s), you can definitely see the dog jump very close to the cop, easily within a foot, and it looks like its paws made contact with the officer's body. And that dog looks like a Doberman or a rottweiler or something, and a cursory Google search tells me that [they're ranked 7th and 2nd among dog breeds for bite fatalities.](http://www.curiosityaroused.com/nature/top-10-most-dangerous-dog-breeds-based-on-bite-fatalities/) I'm not saying that they're necessarily inherently dangerous, just that the numbers show that they're a serious threat to human life. More cursory research suggests the reason behind the numbers is because of the popularity of these breeds for dog fighting If Hawthorne is an area known for dog fights, then *not* shooting the dog had a very real potential for human fatalities. If any of those cops weren't wearing a protective layer (and I see no reason why they would have, if they're the low-level neighborhood patrol types), they could have easily gotten a huge gaping bite hole in their torsos. \n\nThings the officers did right IMO:\n\n1. Shooting the dog, because it established itself as a threat once it tried to jump the cop. Plus, if it's a breed that's well known for being lethally violent, what should they have done otherwise? I can't think of a way they could have safely neutralized the threat at that juncture, barring a tranq gun or other equipment that the cops probably didn't have. Batons and tasers would be less lethal but (educated guess), there would be a lot more suffering involved. \n\nThings that they did wrong IMO:\n\n1. Letting it suffer like that. Clean shot to the head to put him out of his misery would have made the whole thing not so bad. I'm fine with human euthanasia, too, but only under certain conditions. Seeing the dog suffer was horrible.  \n2. Taking that guy into custody for no apparent reason, other than filming shit on his phone. WTF? Of course the dog is going to try and defend the guy, and the cops should have isolated the threat before making the arrest. Bad police work, and bad legislation too, but that's a different matter.\n\nSo I believe the cops should get in some legal trouble for letting it suffer, and that their incompetence at police work should result in a lengthy unpaid suspension, but the decision to kill the dog became the right one as soon as it tried to jump on that one cop. Judging by the uproar, you'd think the dog was tied to a tree and barking at them harmlessly when they pulled the trigger. Hell no, that motherfucker's behavior was unmistakably threatening. \n\nThe biggest plot hole here is ***what other options were available once the dog started attacking?*** This is the big question, I think, the one most likely to result in a ∆. If someone can present a reasonable alternative to shooting a dog that's right at the cusp of actively trying to kill you, I'm all ears. \n\nTasers and batons were a possibility, but were the cops carrying those things? Do they require special training to be used against dogs? Plus, tasers and batons might be *worse* options than a clean shot to the head, because lots of suffering would be involved, survival or not. I'd imagine mace would just piss the dog off even more. ",
    "author": "MindNarrative",
    "num_comments": 62,
    "created_utc": 1372733274.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1hgzdt/i_believe_that_the_officers_responsible_for_the/",
    "comments": [
        {
            "name": "t1_cau88hc",
            "parent_id": "t3_1hgzdt",
            "body": "Can you answer something?  What justification did the police have to take the man into custody?  What statute did he violate?  Because if they were just pissed off that he was filming and taunting them, then clearly they created the situation in which they had to kill the dog, much the same as George Zimmerman created the situation in which he \"had\" to kill Trayvon Martin.  But I'm open to another interpretation.",
            "author": "buscoamigos",
            "created_utc": 1372733645.0,
            "replies": [
                {
                    "name": "t1_cau8bw6",
                    "parent_id": "t1_cau88hc",
                    "body": "[deleted]",
                    "author": "[deleted]",
                    "created_utc": 1372733904.0,
                    "replies": [
                        {
                            "name": "t1_cau8k0t",
                            "parent_id": "t1_cau8bw6",
                            "body": "My question remains.  Did the police officers create the situation in which they had to kill the dog? \n\nSo, Rule 2",
                            "author": "buscoamigos",
                            "created_utc": 1372734519.0,
                            "replies": [
                                {
                                    "name": "t1_cau8ovv",
                                    "parent_id": "t1_cau8k0t",
                                    "body": "/u/looksgoodgirl's point was that OP fully understands that the police officers created the situation in which they had to kill the dog, and that they should be held accountable for that. ",
                                    "author": "thesupremebeing",
                                    "created_utc": 1372734884.0,
                                    "replies": [
                                        {
                                            "name": "t1_cau8u7t",
                                            "parent_id": "t1_cau8ovv",
                                            "body": "The OP vacillates  too much.  The second part of the title is what gets to me...the reaction has been overblown.  I don't believe you can create a situation in which you put your own life in danger, and then kill the threat and call it good.  The owner of the dog clearly put him/her in the car to avoid the confrontation.  If the owner did anything illegal that justifies being detained, I put the responsibility on him.  If he did not, then clearly it should never have happened and the dog would not have been shot.",
                                            "author": "buscoamigos",
                                            "created_utc": 1372735292.0,
                                            "replies": [
                                                {
                                                    "name": "t1_caua37p",
                                                    "parent_id": "t1_cau8u7t",
                                                    "body": "Well, I understand what you mean when you said I vacillate a bit, but that's because I'm breaking the one event down into four separate issues. \n\n1. Legislation that says it's OK to arrest people for filming police: **BAD**, but practically no one's focusing on this\n2. The shoddy police work that contributed to the dog attacking: **BAD**, but practically no one's focusing on this\n3. The actual act of killing a dog: **NOT NECESSARILY BAD**, because I believe it posed a serious threat to the officer when it began attacking, but everyone's mad at this part instead of all the other parts\n4. Letting the dog suffer instead of putting it out of its misery: **VERY BAD**, but not enough people are focusing on this\n\nBecause cause and effect is complex, you have to break an event down to properly assess it. You can't get a remotely complete picture of an event if you just look at one factor and ignore the rest. Of course I'm going to vacillate, some parts are worse than others.",
                                                    "author": "MindNarrative",
                                                    "created_utc": 1372738881.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_cau8rg8",
                                    "parent_id": "t1_cau8k0t",
                                    "body": "[deleted]",
                                    "author": "[deleted]",
                                    "created_utc": 1372735079.0,
                                    "replies": [
                                        {
                                            "name": "t1_cau8wku",
                                            "parent_id": "t1_cau8rg8",
                                            "body": "Read the second part of the subject line: this is being blown out of proportion.  I don't believe it is.  ",
                                            "author": "buscoamigos",
                                            "created_utc": 1372735476.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cau90q7",
                                                    "parent_id": "t1_cau8wku",
                                                    "body": "It seems that people are most outraged at the killing of the dog, not the suffering, and *definitely* not the legislation. The killing of the dog part is being blown out of proportion, while the bad legislation and the bad policing are getting almost no attention in comparison. \n\nMy main message is that I believe that we should focus on the animal torture, the bad police work, and the bad legislation, not the killing of a large dog that very well could have killed a human if they let it keep attacking. ",
                                                    "author": "MindNarrative",
                                                    "created_utc": 1372735791.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_cau8svw",
                                    "parent_id": "t1_cau8k0t",
                                    "body": "I clearly stated my point on this in the OP:\n\n&gt;Taking that guy into custody for no apparent reason, other than filming shit on his phone. WTF? Of course the dog is going to try and defend the guy, and the cops should have isolated the threat before making the arrest. Bad police work, and bad legislation too, but that's a different matter.\n\nand\n\n&gt;So I believe the cops should get in some legal trouble for letting it suffer, and that their incompetence at police work should result in a lengthy unpaid suspension, but the decision to kill the dog became the right one as soon as it tried to jump on that one cop. \n\nThere were mistakes made before the dog attacked, but the cops should be prosecuted for those (and for letting the dog suffer), not for the actual killing. The big question is here:\n\n&gt;What other options were available once the dog started attacking? \n\nI'm actually going to edit the OP to highlight this part.",
                                    "author": "MindNarrative",
                                    "created_utc": 1372735185.0,
                                    "replies": [
                                        {
                                            "name": "t1_cau93fd",
                                            "parent_id": "t1_cau8svw",
                                            "body": "Then why do you believe the reaction has been overblown?  Because that is the part of your argument that stuck with me. If we don't call out the police (the overwhelming majority who are terrific and are above board) who violate the public trust, then how do we bring attention to this kind of behavior which is unacceptable?  Neither cops nor private citizens should be allowed to create a situation in which they are required to kill to save themselves.  I grant you that they *may* have had no other choice in shooting the dog, but they certainly did have a choice in creating the situation and to call it overblown is to say it is alright to allow them to get by with it.",
                                            "author": "buscoamigos",
                                            "created_utc": 1372736000.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cau9axf",
                                                    "parent_id": "t1_cau93fd",
                                                    "body": "[deleted]",
                                                    "author": "[deleted]",
                                                    "created_utc": 1372736584.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cauh2ue",
                                                            "parent_id": "t1_cau9axf",
                                                            "body": "Actually, the criminal act is what created the situation in your example.",
                                                            "author": "buscoamigos",
                                                            "created_utc": 1372773700.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "name": "t1_cau9jjt",
                                                    "parent_id": "t1_cau93fd",
                                                    "body": "What other options were available once the dog started attacking?\n\nAnd when did I say we should ignore the bad legislation and bad police work?\n\nI'm going to keep asking until you answer, and I'm *definitely* going to stop explaining that I believe bad police work and bad legislation should be punished, but killing a dog that's *actively trying to kill you is not bad*. I made that VERY clear in the OP and several times in the comments that I believe that the dog's death is way overblown, but the bad police work and legislation and animal torture are way underblown. \n\nPeople aren't looking at this and saying \"we need to reflect on the role of police in society and review the legislation that indirectly started this.\" They're saying \"DOG DIED = BAD THING,\" and no one gives half a shit about the bad legislation. It seems like you also believe we should focus on the legislation and the bad police work. So I don't see where the disagreement is.\n\nOK, *now* I'm gonna stop explaining that repeatedly.\n\n",
                                                    "author": "MindNarrative",
                                                    "created_utc": 1372737270.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cau8emg",
                    "parent_id": "t1_cau88hc",
                    "body": "All I can think of is that maybe the people sitting on the sidewalk that the police had already arrested were minors, in which case, the filming/photographing of them would be frowned upon, and the release of said photos to the press would be illegal. That, or he was making homicidal threats, but I seriously doubt that.\n\nMy best guess is that the cops were just worried he would interfere with their operation, and figured the easiest thing to do would be to lock him in a car rather than have to watch him. ",
                    "author": "thesupremebeing",
                    "created_utc": 1372734106.0,
                    "replies": []
                },
                {
                    "name": "t1_cau8th0",
                    "parent_id": "t1_cau88hc",
                    "body": "This.\n\nThe arrest itself was unwarranted. The man was legally in the right to record the police while on duty. The arrest was unwarranted which meant they escalated the situation which led to the animal's murder.\n\nHad the arrest been warranted (the man being a suspect for some reason) then the situation would be in the cop's favor.\n\nThe fact they were just looking to ruin the guy's day shows that they instigated a situation which resulted in the \"attack\". \n\nWhich I personally don't believe the animal was going to attack the officer. \n\nbeyond that point all police officers are issued tazers which work just as well on animals as they do on humans.\n\nThe force used was unwarranted.",
                    "author": "Buddhafy",
                    "created_utc": 1372735233.0,
                    "replies": [
                        {
                            "name": "t1_cau9bgr",
                            "parent_id": "t1_cau8th0",
                            "body": "Well, if you watch the video, the dog already started attacking at 3:22, jumping at the officer. It even looks like its paws may have made contact with the guy, but it's hard to tell from this angle and quality. But it was definitely starting to attack.\n\nUnless you have good reason to believe it wasn't attacking. Hit me. After all this is CMV. \n\nAlso, regarding tasers, if it was a human adult taser, that may have likely killed the dog as well. I'm admittedly limited in knowledge on tasers and their use in law enforcement, but if TASER Int'l themselves can no longer legally advertise their products as \"non-lethal,\" then I'd hesitate to say they should have gone that route. I'm pretty sure that animal control is equipped with tasers of smaller voltages for smaller animals. But again, I suck at tasers, so if anyone wants to correct me then I'm up for it.\n\nAlso yeah the arrest was unwarranted and legislation to prevent recording of the police is stupid. That's not the issue at hand though. It *should* be the issue at hand, but everyone's all up in arms over the fact that the dog died, not over bad legislation or bad police work. Everyone's mad at the wrong shit. They're calling the police department, not the state Congress.",
                            "author": "MindNarrative",
                            "created_utc": 1372736625.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cauamra",
                    "parent_id": "t1_cau88hc",
                    "body": "I'm currently being downvoted in another thread for suggesting Zimmerman escalated the situation.  Good answer. ",
                    "author": "rob2060",
                    "created_utc": 1372740549.0,
                    "replies": []
                },
                {
                    "name": "t1_caub47z",
                    "parent_id": "t1_cau88hc",
                    "body": "What both OP and you aren't seeing is the bigger context. In the video that keeps getting posted on Reddit, we only see 2 cops for the 4 cars we see on the street. This guy wasn't just wandering around filming two cops standing on a street corner, he's blasting music and filming with his dog in the middle of the street as a SWAT team is moving into a house. They're not arresting him, they're simply detaining him to keep him out of the way as a highly intense police activity is in progress, since he's clearly harassing them as the situation unfolds.",
                    "author": "Harmonsky",
                    "created_utc": 1372742157.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cau9452",
            "parent_id": "t3_1hgzdt",
            "body": "My dog is 140 pounds. He could easily intimidate you, as he is a Rottweiler/lab. But guess what? When he jumps up? Its to lick your face. \n\nYou dont know what that dog could do. It could be violent, it could be a kisser. Just because its a big dog doesnt mean it has more of a right to die for its actions. Should i, as a 240 pound male, be judged to be more violent than a 100 pound woman just from appearance? Just looking at us you would say i am more of a threat, but if after 3 minutes conversation you realize she is a serial killer and i am a teddy bear you will feel ridiculous for your earlier assumption. It is fine to make this assumption, it is not fine to act on it without information. If you saw me and said woman in a fight you would immediately target me, not realizing she is the dangerous one. It is a cops job to not fuck up like this.",
            "author": "shiav",
            "created_utc": 1372736051.0,
            "replies": [
                {
                    "name": "t1_cauatj3",
                    "parent_id": "t1_cau9452",
                    "body": "When the dog that got shot jumped, it snapped at the air where the cop's arm had just been. Watch the video frame by frame or slowed down. You can see its bared teeth.\n\nI've grown up with large dogs. German Shepherds, to be precise. This dog's demeanor was not friendly. It was not obviously aggressive, as some dogs are, but it could easily have been the unsettling quiet aggression that goes from 0 to 60 in a heartbeat. I'd have to be in the officer's shoes to know for sure.",
                    "author": "apologeticCultist",
                    "created_utc": 1372741166.0,
                    "replies": [
                        {
                            "name": "t1_cauci5j",
                            "parent_id": "t1_cauatj3",
                            "body": "http://imgur.com/7BfuJ49\n\nSnapshot of what you are talking about. ",
                            "author": "Txmedic",
                            "created_utc": 1372747439.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cau955t",
            "parent_id": "t3_1hgzdt",
            "body": "When arresting the man, they should have ensured that the dog was secure in the car.\n\nIf the are going to take away the man's ability to secure his dog, they should secure the dog the themselves.\n\nPutting aside the legitimacy of the arrest, the cops created the situation by not making sure the dog was secure and then took the most heavy handed approach out of it.",
            "author": "boomerbower",
            "created_utc": 1372736129.0,
            "replies": [
                {
                    "name": "t1_cau9cv0",
                    "parent_id": "t1_cau955t",
                    "body": "[deleted]",
                    "author": "[deleted]",
                    "created_utc": 1372736736.0,
                    "replies": [
                        {
                            "name": "t1_cau9nhu",
                            "parent_id": "t1_cau9cv0",
                            "body": "Their reaction was extremely heavy handed. They could have let the guy calm his dog down, despite the fact he was in cuffs. The dog was showing only very mild annoyance, and this was because the cops were threatening his owner. \n\nIf we look at the situation from the time the dog jumps out the window of the car, I still think the cops have done poorly here.\n\nIf the dog did not approach the cops, what were they going to do? Just let it wander the neighbourhood? \n\nOnce the dog was loose, they should have helped the guy sort his dog out, and then taken him away. The guy was giving no resistance.\n\nBut no, the dog was shot instead. In a residential neighbourhood. Where the situation was already very calm.\n",
                            "author": "boomerbower",
                            "created_utc": 1372737586.0,
                            "replies": [
                                {
                                    "name": "t1_cau9rsg",
                                    "parent_id": "t1_cau9nhu",
                                    "body": "I understand that they fucked up by not isolating the dog, but that isn't what people are getting angry about. The outrage seems to be solely in response to the act of killing a dog. But what alternative do you have once it starts attacking? Tasers and batons on an animal smaller than a human seem even more cruel than shooting it, and if you don't do *something* then you're just letting yourself get mauled by large dog. \n\nAnother angle you could CMV from is arguing looksgoodgirl's point:\n\n&gt;The question is, by making this error are they then not justified in killing the dog? To what extent should police errors remove their ability to defend themselves and justify that defense?\n\nBut that opens up yet another line of discussion. Example: if a judge was too slow in signing a search warrant, and the people in that house ended up killing someone, should the judge be charged with aiding and abetting homicide? I believe the judge should get in trouble, but for screwing up the search warrant and not for homicide. Admittedly not a 1:1 case, though.",
                                    "author": "MindNarrative",
                                    "created_utc": 1372737934.0,
                                    "replies": [
                                        {
                                            "name": "t1_caua34b",
                                            "parent_id": "t1_cau9rsg",
                                            "body": "My argument is that, even if they failed to secure the dog, there were many things they could have done better once the dog was loose. Sure, they have right to defend themselves. Taser the damned thing. Let the owner handle the dog. Anything but shooting it. \n\nI think most of the outcry stems from the poor handling of the situation by the cops leading to the shooting, rather than the act of killing the dog.",
                                            "author": "boomerbower",
                                            "created_utc": 1372738873.0,
                                            "replies": [
                                                {
                                                    "name": "t1_caub0s8",
                                                    "parent_id": "t1_caua34b",
                                                    "body": "It seemed to me (on just one viewing.... one is enough) that they tried to let the owner handle it, but at that point with his hands cuffed, the dog would not be pacified (and understandably so) - and there obviously would not have been time to uncuff the guy before the dog was on them.",
                                                    "author": "StarManta",
                                                    "created_utc": 1372741830.0,
                                                    "replies": []
                                                },
                                                {
                                                    "name": "t1_cauc3fd",
                                                    "parent_id": "t1_caua34b",
                                                    "body": "&gt;I think most of the outcry stems from the poor handling of the situation by the cops leading to the shooting, rather than the act of killing the dog.\n\nYeah, as more time passes, people seem to be taking a step back and critiquing other parts more. I think I might have jumped a gun a bit when posting this. Oh well.\n\n&gt;Taser the damned thing.\n\nYou can't use human tasers on a dog without a high chance of killing it. Admittedly, not a higher chance than a bullet, but electrocuting a dog to death would be animal torture. The company that makes them isn't even legally allowed to use the word \"non-lethal\" anymore when talking about *human adults*. Plus, that's assuming that the officer that got attacked even had a taser. I haven't seen a source that definitively says tasers are standard issue for Hawthorne police. Lots of police stations don't issue tasers to everyone on their payroll for various reasons, be it public safety or lawsuits or lack of funds.\n\n&gt;Let the owner handle the dog. \n\nThe owner was antagonizing and baiting police in the minutes leading up to that incident while they were trying to execute a police raid. If I'm a cop in that situation, my *life* is at stake here. Rottweilers and Dobermans (Dobermen?) are often bred as attack dogs, and this guy is yelling about how much he hates cops. Shit, maybe he's a friend of the guy whose house is getting raided, and he's seeking revenge for all I know. All cops wear a perpetual target on their backs, and it's very easy to use a dog as a weapon. ",
                                                    "author": "MindNarrative",
                                                    "created_utc": 1372745703.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "name": "t1_cauejfn",
                                            "parent_id": "t1_cau9rsg",
                                            "body": "&gt; that isn't what people are getting angry about\n\nYeah, people are angry for a number of reasons. American police seem to be extremely callous in the manner in which they deal with pets. Every time this comes up it seems like some innocent party has had the police come at them, and rather than allow the owner to deal with the animal they just shoot it. \n\nApart from anything it just seems really lazy and unprofessional. We have dogs in the UK, but the police officers are unarmed. Unsurprisingly, our police seem able to contain and control these animals. Why can't americans? Is it callousness, procedure, stupidity, or a mixture of all three?\n\nThis particular situation is bad because:\n\n1. The crowd, man, that was like a laughtrack. Everyone knows what's coming yet it still happens, how?\n\n1. The dog's owner is wrongfully arrested.  He's within his rights to speak to the police in the manner he did, and record them.\n \n1. The officers act with unnecessary roughness on a fully compliant man, in full view of the man's mature rottweiler. What did they think would happen? They knew the dog was there.\n\n1. Above all this is done in front of a whooping crowd. Rather than remaining calm and handling the situation with professionalism the whole thing is a performance. The crowd upsets the police so they have to respond, and they do so with the restraint of kindergarteners. See points 1-3.\n\n",
                                            "author": "TubbyandthePoo-Bah",
                                            "created_utc": 1372760102.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_cauc45m",
                            "parent_id": "t1_cau9cv0",
                            "body": "Yeah, this is an interesting part of the discussion that's kind of being pushed aside. How can you determine culpability if there were many factors that were out of people's control? You sometimes have to punish people for indirectly causing bad shit to happen, but how close does the link have to be and how bad does the bad shit have to be? And how do you determine the severity of the punishment? Lots of questions, lots of shades of gray.",
                            "author": "MindNarrative",
                            "created_utc": 1372745786.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cauc7tb",
                    "parent_id": "t1_cau955t",
                    "body": "This exactly. I usually try not to overreact, but if given the chance, and with no consequences for me, I would end that officer's life.; He doesn't deserve to live and is just a liability.",
                    "author": "UlyssesSKrunk",
                    "created_utc": 1372746212.0,
                    "replies": [
                        {
                            "name": "t1_caue0g0",
                            "parent_id": "t1_cauc7tb",
                            "body": "Wow... that's messed up. I mean, I understand considering that he did a bad thing, but really, by your standards, how many of the people you know/have heard of should be killed?",
                            "author": "sarcasticpriest",
                            "created_utc": 1372756070.0,
                            "replies": [
                                {
                                    "name": "t1_caue431",
                                    "parent_id": "t1_caue0g0",
                                    "body": "About 70.",
                                    "author": "UlyssesSKrunk",
                                    "created_utc": 1372756828.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_caubp6y",
            "parent_id": "t3_1hgzdt",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1372744182.0,
            "replies": [
                {
                    "name": "t1_caubzza",
                    "parent_id": "t1_caubp6y",
                    "body": "Explain.",
                    "author": "MindNarrative",
                    "created_utc": 1372745313.0,
                    "replies": []
                },
                {
                    "name": "t1_cauchlr",
                    "parent_id": "t1_caubp6y",
                    "body": "Rule 2",
                    "author": "Txmedic",
                    "created_utc": 1372747369.0,
                    "replies": []
                },
                {
                    "name": "t1_caueou3",
                    "parent_id": "t1_caubp6y",
                    "body": "Not sure if stupid remark or brilliant pun.\n\nI'll give you the benefit of the doubt.",
                    "author": "maybe_I_am_a_bot",
                    "created_utc": 1372761269.0,
                    "replies": [
                        {
                            "name": "t1_cav1ppl",
                            "parent_id": "t1_caueou3",
                            "body": "&gt; brilliant pun.\n\nlove how I got downvoted 6 times because those people are not smart enough to realize it lol\n\n",
                            "author": "Vaqxination",
                            "created_utc": 1372833711.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_caucne5",
            "parent_id": "t3_1hgzdt",
            "body": "on not finishing the dog of:\n\nthe use of lethal force is justified to stop a threat that can cause extreme bodily harm or death. This wording is very important, \"to stop a threat\". in example, if someone walks up to me and tries to stab me with a knife lethal force is justified to stop that threat. say i shoot him and he drops the knife and lies on the ground. the threat has been stopped and i am no longer able to use lethal force. in the video after the dog has been shot it retreats, the threat has stopped. \n\nnow that the legal part is done. although the generally accepted thing to do is to put an animal in pain out of its misery, this situation occurred in a residential area with many bystanders around. the initial shots were justified because the officer feared for their life. after the dog has stopped and the officers are no longer in danger the next immediate concern is for the bystanders. shooting a gun in a well populated area can be dangerous since bullets can travel for a very long distance before coming to a stop. this is also true of ricochets. if the officer had attempted to put the dog out of its misery the bullet could have easily fragmented or ricochet and injured a bystander or the officer themselves. while the most humane thing to do would be to put the dog down, attempting to do so could put others in danger. ",
            "author": "Txmedic",
            "created_utc": 1372748094.0,
            "replies": [
                {
                    "name": "t1_cauly4j",
                    "parent_id": "t1_caucne5",
                    "body": "This guy gets a golden star for being rational.",
                    "author": "Chratzs",
                    "created_utc": 1372787184.0,
                    "replies": [
                        {
                            "name": "t1_cauo55g",
                            "parent_id": "t1_cauly4j",
                            "body": "Thanks! I try to most of the time. And as a paramedic I kinda get a better glimpse of the blue side than most people. ",
                            "author": "Txmedic",
                            "created_utc": 1372792739.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_caudelt",
            "parent_id": "t3_1hgzdt",
            "body": "If someone is restraining and threatening to kidnap you for no justifiable reason... they are the criminal.  And we all saw on this tape what happened.  A bystander was filming the police, from a distance, and they didn't like it.  So... they handcuffed him and were in the process of taking him away somewhere.  Their behavior was illegal, immoral, and unjustified.  The dog, upon seeing all this, was behaving in a way which was intended to stop criminal behavior.  And it had accurately identified who the real criminals were in this particular situation.  Because of its righteous indignation and its attempts to right a wrong... it was put down.  ",
            "author": "NihiloZero",
            "created_utc": 1372752031.0,
            "replies": []
        },
        {
            "name": "t1_caudgrz",
            "parent_id": "t3_1hgzdt",
            "body": "Perhaps we should examine a more extreme scenario: You are a thief, and you break into what you *believe* is an unoccupied house to steal a few things, like copper piping. However, unbeknownst to you, there is a homeowner present! They hear you, they are scared you've broken in to hurt their family, and they pull a gun on you. \n\nYour life is now in danger; you can either cross your fingers and hope they don't kill you, or you can kill them instead before they get a chance to shoot.\n\nSo what do you do? Well, you probably shoot them to save yourself. It may not even be a reasoned response. Suddenly there's a gun in your face, and you react instinctively to protect yourself.\n\nSo are you a murderer in this scenario? You clearly did not intend to hurt anyone, and you did so only to save yourself. However, you created a scenario where an innocent person died at your hands. Is that murder, manslaughter, reckless endangerment, etc., or should the whole things be dismissed as a case of self-defense (in which case you get charged for breaking and entering, but not for the homeowner's death)?\n\nIt's a very tricky case but, frankly, I would be very surprised if more than a few people think that a thief in this scenario should not be charged for the death of the homeowner. Likewise, I would be very surprised if more than a few people think the cops in the above scenario should not be charged for the death of the dog.",
            "author": "Nausved",
            "created_utc": 1372752399.0,
            "replies": [
                {
                    "name": "t1_cauhm6v",
                    "parent_id": "t1_caudgrz",
                    "body": "However the thief in your scenario made a conscious decision to break into a home. An animal only reacts on instinct with no thought at all so this analogy doesn't hold true. Should a big dog attack you, there are very few things you can do to stop it without getting injured yourself.",
                    "author": "Veloqu",
                    "created_utc": 1372775479.0,
                    "replies": [
                        {
                            "name": "t1_cauxek7",
                            "parent_id": "t1_cauhm6v",
                            "body": "I don't understand the point you're trying to make here. Like the thief, the cops *did* make a conscious decision to arrest this man, and they did so uncautiously, which led to the death of a dog who otherwise would not be dead. The cops *created* a scenario where a dog died. Likewise, the thief created a scenario where the homeowner died. In both cases, no death was intended, but it happened because the cops/thief recklessly created a dangerous situation.\n\nBy the way, if someone has a gun pointed at you, you have to react quickly; they can kill you in under a second. Real life is not like movies; you don't have showdowns where two people point guns at each other, unless both of those people are idiots. The *first* person to shoot will kill the other *and* avoid being shot themselves, so there is no reason to wait unless you want to die.\n\nThe homeowner would be a nut to not shoot the thief as soon as he sees he has a gun, and the thief would be a nut to not shoot the homeowner as soon as he sees he has a gun. Like in the case of a dog attack, there are few things either of them could do to stop the other without getting killed or seriously injured.",
                            "author": "Nausved",
                            "created_utc": 1372819150.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_caudxsn",
            "parent_id": "t3_1hgzdt",
            "body": "It all boils down to in my opinion,  poor judgement calls. As you already stated in everything that was done wrong. However, I firmly believe that if the officers would've let the guy calm his dog down, all off that could've been avoided. Just a compilation of bad calls leading to an unnecessary end.",
            "author": "TryAnotter",
            "created_utc": 1372755543.0,
            "replies": []
        },
        {
            "name": "t1_caue9y7",
            "parent_id": "t3_1hgzdt",
            "body": "You sound very uneducated and admittedly are afraid of dogs, at least bug ones. Fear leads to irrational actions and therefore anyone who is afraid of a situation like this should never be in a line of work that can put them in it, especially when they are given deadly force by the state. That dig was not attacking and to not know the difference turned out to be criminally negligent, whether the cops gets what he lawfully deserves or not. That dog should have never been in that situation because the owner should have never been detained because filming a police officer (especially when they are failing at their job) is COMPLETELY LEGAL.  Unfortunately it is legal for a shmuck with a badge to make a a lethal mistake and there are usually no repercussions.  ",
            "author": "BestaNesta99",
            "created_utc": 1372758033.0,
            "replies": []
        },
        {
            "name": "t1_caueftd",
            "parent_id": "t3_1hgzdt",
            "body": "I think this [video](http://link.brightcove.com/services/player/bcpid1466773308001?bckey=AQ~~,AAAAAGBdRAo~,t2cIYZUexJ2HLdBYSBIAhhF2g1dnagVO&amp;bctid=2520804003001) says it all. ",
            "author": "VMikeL",
            "created_utc": 1372759306.0,
            "replies": []
        },
        {
            "name": "t1_caufbw2",
            "parent_id": "t3_1hgzdt",
            "body": "&gt;The biggest plot hole here is what other options were available once the dog started attacking?\n\nWhich for me seems incredibly obvious, but maybe because I have owned dogs and have some modicum of understanding about them. The simplest option is to push the owner into the dog. Even releasing him or undoing his handcuffs, but most importantly *get him physically between the dog and the police*. Dogs are all about space, and the dog only jumps the officer when it moves *into* his space.\n\n&gt; Hell no, that motherfucker's behavior was unmistakably threatening.\n\nHonestly, this is what I find odd, is so many people feeling the dog was being so threatening. When the dog approaches initially and the officers react, the dog *backs off*. It is clearly confused and concerned for its owner. What is the first thing the officers do? Pull the owner farther away (stupid) and move between the dog and the owner (really fucking stupid). Hell, the dog **smells the fucking ground**, such a clear non-aggressive action to almost be silly.\n\nThe simple act of putting the owner in between the officers and the dog fixes everything.\n\nAlso, one quick correction:\n\n&gt;If Hawthorne is an area known for dog fights, then not shooting the dog had a very real potential for human fatalities.\n\nThis is a bad argument because fighting dogs are typically selected specifically *against* human aggression, for the very reason that no-one (not even dog fighting pieces of shit) want to deal with a human violent 160 lb dog. \n\n",
            "author": "Homericus",
            "created_utc": 1372765817.0,
            "replies": []
        },
        {
            "name": "t1_cauhuox",
            "parent_id": "t3_1hgzdt",
            "body": "If you watch the video the officer doesn't shoot the dog in self defense.  Twice he reaches for the dogs leash and the dog tries to bite or lunge at him.  Shortly after the second time, when the dog is just standing there, he shoots it.  You can see that the dog is standing on the sidewalk at least 5 or 6 feet away from the officer when he fires.  I'd understand if he shot it while the dog was in the act of trying to bite him but he clearly wasn't.  The dog was only threatening the officer when the officer threatened him.  But despite the threat not being imminent he shot the dog because he's incompetent.  \n\nAfter he realized it was a bad idea to try and grab the dog's leash, he should have stopped to think for a second and figured something better out.  The best solution would have been to uncuff the owner for a little second to secure the dog.  The owner wasn't violent and not a threat to the police, you can see he immediately complied when they asked to cuff him.  \n\nEven if they aren't going to uncuff a suspect, all cops have at least one form of non-lethal force.  Either a taser or pepper spray.  They also have training into when it's appropriate to use non-lethal vs lethal force.  Either one of these would have worked fantastically at taking down a dog, but the officer came over gun-drawn to deal with it.  Why did he need his gun out?  Why didn't he have his taser out instead?  Was there some situation where he thought he would need a gun going on there?  Clearly he made a major mistake in deciding what type of force to use.  ",
            "author": "benk4",
            "created_utc": 1372776219.0,
            "replies": [
                {
                    "name": "t1_cauwcaq",
                    "parent_id": "t1_cauhuox",
                    "body": "Are we watching the same video? The shot was fired immediately after the officer reached for the leash a third time, and the dog barked and jumped at the officer, the dog was less than two feet from him, he was not just standing on the sidewalk and got a bullet in the side. Hell, I think the dog was still in the air when the first shot was fired, but I don't want to watch it again to be sure of that.\n\nNot trying to defend the cops actions or anything, but I keep seeing comments like that. Watch the video again, as hard as it is, and you will see, the dog was not calmly standing on the sidewalk five or six feet away.",
                    "author": "thatrocketguy",
                    "created_utc": 1372815973.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cauj29r",
            "parent_id": "t3_1hgzdt",
            "body": "I think everyone is forgetting the major issue here: the dog wouldn't have been trying to protect its owner if its owner hadn't been illegally detained by the police. He was one of at least 3 people actively filming (including another person about 10 feet to his left, the other on the other side of the street).\n\nHe yelled something about no black cops (not a crime) and they decided to do what cops do in these situations - freak out and violate the law. They took him into custody which shouldn't have happened. They were directly responsible for the dog freaking out. If they even had released this guy when the dog came out he could have grabbed the leash and everything would have been fine.",
            "author": "ezen",
            "created_utc": 1372779667.0,
            "replies": [
                {
                    "name": "t1_caunrrz",
                    "parent_id": "t1_cauj29r",
                    "body": "Well all the other people filming were a safe distance and relatively quiet. This guy had parked his car next to the cops, was blasting music and pacing back and forth in front of them with a very large dog. Not illegal, but they weren't arresting him. It's not an arrest unless they read you your rights, they were rightfully detaining him for obstructing police work. \n\nNow before everyone gets all \"How is video taping and being loud obstructing\" or \"He was completely in his rights\" blah blah blah. Think about this. How well would you do your job with this guy outside your cubicle, pacing back and forth with a big dog, videotaping you and blasting music? Also, of that guy were doing that outside your house, just pacing back and forth on your lawn, you could justifiably call the police to remove him. Finally, if you'll notice there were over a dozen police cars there and an Armored Vehicle, not to mention the police that were carrying assault rifles. Perhaps he shouldn't have gone up to them and shouted in their faces, because quite frankly, that's not what smart people do.\n\nSo, stop blaming the cops and instead blame this bad dog owner that got his dog shot by provoking the police.",
                    "author": "FantasticDucks",
                    "created_utc": 1372791786.0,
                    "replies": [
                        {
                            "name": "t1_cauotos",
                            "parent_id": "t1_caunrrz",
                            "body": "&gt;Well all the other people filming were a safe distance\n\nThere was a guy next to him at the same relative distance that they didn't engage. If he was unsafe and the crowd was safe then it's a difference of about 20 feet and they could have gone over to him to tell him to move.\n\n&gt;How well would you do your job with this guy outside your cubicle, pacing back and forth with a big dog, videotaping you and blasting music?\n\nWhat a completely irrelevant comparison. We don't have the same jobs or circumstances. Nothing is the same about a police job and a desk job as it pertains to this situation.\n\n&gt;Also, of that guy were doing that outside your house, just pacing back and forth on your lawn, you could justifiably call the police to remove him.\n\nOn your lawn? Yes. On the sidewalk outside your house? No. He was completely in the public space and not on anyone's property.\n\n&gt;Perhaps he shouldn't have gone up to them and shouted in their faces, because quite frankly, that's not what smart people do.\n\nI think you'll find he was at least 100-150 feet away from those cops when shouting, wasn't he? When he actually started to approach the cops is after he put his dog away when they started approaching him. He lives in an area where this is common, obviously, so he knew he was getting arrested. When they were telling him to come over to him is when he walked over to them and put his hands behind his back before they closed the gap. Shouting in their faces would be a bad move, yes - except he simply didn't do this.\n\n&gt;stop blaming the cops and instead blame this bad dog owner that got his dog shot by provoking the police.\n\nIf he hadn't been illegally detained by the police there wouldn't be a dead dog or any incident. The first time the cops approached this man were to detain him, not to talk to him or to get him to leave. Not sure if you're black living in a poor neighborhood but I have a feeling you live a comfy life and can't sympathize with a situation that simply doesn't happen to rich white kids.",
                            "author": "ezen",
                            "created_utc": 1372794422.0,
                            "replies": [
                                {
                                    "name": "t1_caupvos",
                                    "parent_id": "t1_cauotos",
                                    "body": "well you got me, I'm not black. However, for the majority of my childhood I lived in a number of poor neighborhoods (because my parents couldn't hold on to an apartment for more than a year or two). I grew up in similar neighborhoods and went to school with kids that were a lot like that. I also have a brother who is a cop and I hear about what he has to deal with day in and day out in order to \"protect and serve.\" So as someone who has grown up on one side of this and has a brother currently on the other side let me tell you, 90% of the blame falls on the guy who decided to push his luck with the police.",
                                    "author": "FantasticDucks",
                                    "created_utc": 1372797110.0,
                                    "replies": []
                                },
                                {
                                    "name": "t1_cav04jm",
                                    "parent_id": "t1_cauotos",
                                    "body": "Also, I can't stress this enough, they didn't illegally detain him. Everything they did was 100% legal.",
                                    "author": "FantasticDucks",
                                    "created_utc": 1372827518.0,
                                    "replies": [
                                        {
                                            "name": "t1_cav5rh3",
                                            "parent_id": "t1_cav04jm",
                                            "body": "Things he was doing:\n\n1. Yelling a couple times to cops (other people were doing the same)\n2. Standing on public sidewalk (other people were doing the same)\n3. Filming cops in public (other people were doing the same)\n\nNone of these are illegal.",
                                            "author": "ezen",
                                            "created_utc": 1372858682.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cav7ei6",
                                                    "parent_id": "t1_cav5rh3",
                                                    "body": "1. He was blasting music over his car stereo (no one else was doing that)\n2. He was pacing back and forth on the other side of the police barricade (no one else was doing that)\n3. The cops were dealing with a hostage crisis, and he was trying to see how far he could push them (Stupid people do that)\n\nYou don't necessarily need to be doing anything illegal for the police to detain you. You just have to piss them off. ",
                                                    "author": "FantasticDucks",
                                                    "created_utc": 1372864061.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cavbwef",
                                                            "parent_id": "t1_cav7ei6",
                                                            "body": "You've certainly changed my view. It's good to know that the police can detain you because, even though you didn't break the law, you simply made them angry which led to them killing your dog. God Bless America.",
                                                            "author": "ezen",
                                                            "created_utc": 1372876186.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cavkqzf",
                                                                    "parent_id": "t1_cavbwef",
                                                                    "body": "I think you owe me a delta, and You're Welcome.",
                                                                    "author": "FantasticDucks",
                                                                    "created_utc": 1372902545.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_cavm7qb",
                                                                            "parent_id": "t1_cavkqzf",
                                                                            "body": "Perhaps I should have put a /s at the end to really drive it home...",
                                                                            "author": "ezen",
                                                                            "created_utc": 1372907612.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_cavobun",
                                                                                    "parent_id": "t1_cavm7qb",
                                                                                    "body": "well the fact that you didn't address the three counter points I made and instead focused on one sentence leads me to believe that you have no way to refute the part of my argument that is actually important and you are instead trying to change the subject and deflect with sarcasm. I think you owe me a delta, if not for changing you're view (which is yours to change or keep as you please) then at least for defeating you in an argument (which I believe I did). Or would you prefer to continue cherry picking my replies for minor victories in order to comfort yourself with the knowledge that you lost the major argument? I'll even change one \"your\" to a \"you're\" so you can attack my grammar if you want to do it that way.",
                                                                                    "author": "FantasticDucks",
                                                                                    "created_utc": 1372914650.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "name": "t1_cavu8nx",
                                                                                            "parent_id": "t1_cavobun",
                                                                                            "body": "",
                                                                                            "author": "",
                                                                                            "created_utc": "",
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cautx4z",
            "parent_id": "t3_1hgzdt",
            "body": "I posted this in the other thread on this topic:\n\n&gt;I was a dog handler in the Marines.\n\n&gt;This was a bad call, plain and simple. The dog was being aggressive, but not attacking. You'll note that when the officer \"calms\" the dog he does so by reaching a hand toward its face. (This is a bad idea.) You'll also note that the officer had his gun out the last time he moved towards the dog. The dog jumped up, but didn't bite. It jumped off him and back to the ground. The officer then backed away and shot a dog that wasn't attacking him.\n\n&gt;Considering that there were people all over the place, causing both a safety hazard and a public relations problem, it might've been a better idea to pull out pepper spray, mace, a baton or try to get a hold of the damn lead...basically anything but shooting a dog in front of half the neighborhood.\n\nThe most important point regarding the dog (arresting someone who irritates you is a separate issue) is that it wasn't attacking.  Dogs are what they're conditioned to be.  A dog develops violent tendencies in harsh, usually abusive environments.  It's also very difficult for them to switch that aggression \"off\" once it's switched \"on\".\n\nMy point there is that if this dog was vicious and ready to attack, it would've done so immediately and with conviction.  It didn't so it probably wasn't going to.",
            "author": "Grunt08",
            "created_utc": 1372808545.0,
            "replies": []
        }
    ]
}