{
    "name": "t3_1kvsyr",
    "title": "I believe that the conclusions reached by the House Select Committee on Assassinations (HSCA) regarding the assassination of JFK on Nov. 22, 1963 are true and accurate. CMV.",
    "body": "I believe that Lee Harvey Oswald assassinated JFK using a single rifle, fired all of the shots that killed him and wounded Gov. Connally, and did so as an individual actor (not as the agent of a nation or organized group). My knowledge of the Kennedy Assassination is admittedly limited; I've studied it in school and participated in several university level class discussions about the investigations and conspiracies surrounding the issue. After looking at the conclusions reached by the Warren Commission, I was somewhat skeptical of the notion that Lee Harvey Oswald acted alone, but the HSCA report clarifies some of the issues surrounding the timing and circumstances of the assassination, and leaves open the idea that Oswald may have had a partner. Additionally, I do feel that the events following the assassination are slightly suspicious (notably LBJ appointing and overseeing the Warren Commission), but are not at present sufficient for me to discount the accepted explanation of the assassination.  The number of conspiracy or alternate theories surrounding the assassination is prodigious and confusing, to say the least, but I am willing to accept an alternate theory and CMV if someone can present a compelling alternate explanation of the JFK assassination supported by clear and provable facts.",
    "author": "itsyoursnow",
    "num_comments": 7,
    "created_utc": 1377189523.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1kvsyr/i_believe_that_the_conclusions_reached_by_the/",
    "comments": [
        {
            "name": "t1_cbt4gif",
            "parent_id": "t3_1kvsyr",
            "body": "I've read almost every report, theory, you name it, I've read it about the JFK assassination, including about 100 hours of playtime in \"JFK: Reloaded.\"\n\nMy theory is this...\n\n- Oswald was the only shooter. All \"evidence\" for a second shooter can be explained away in a very logical way. I've also heard a second hand account of a conversation a friend of mine had with the marksman instructor who trained Oswald in the military. He testifies Oswald was a good enough shot.\n\n- We'll likely never know if Oswald was hired, but I believe he was hired by a friend of Communism, either a government (Russia, Cuba) or group (Communist Party members), most likely Russia. Kennedy was a threat because I believe Russia feared him escalating the Cold War into an actual war, and despite their hard attitude, they didn't want a nuclear war either.\n\n- I believe the Mafia thought they would be blamed, as they weren't too fond of Kennedy, and so they were happy to help out when asked to kill Oswald in revenge. They never knew, but the same people who hired LHO hired them. They chose Ruby because, he loved America, and he was terminal. He didn't have long anyway, so he was a low risk to talk. Once Ruby dies in prison, all loose ends are tied.\n\n- No one within the American government was involved. It was not an inside job.\n\nAgain, I draw these conclusions based on what I've read. There are \"experts\" out there who would agree this is all plausible. What do you think?",
            "author": "RoadYoda",
            "created_utc": 1377192776.0,
            "replies": [
                {
                    "name": "t1_cbt51l3",
                    "parent_id": "t1_cbt4gif",
                    "body": "Thanks for responding, you're exactly the kind of person I need to get these answers from! Looking at your theory, I'll go through the points one by one, because I have some concerns.\n\n- First, the question of who was the shooter. While I started out confident that Oswald was the only shooter, I've been reading a lot about the issue since I made this post and now I'm not sure I buy that Oswald was talented enough to make the shot. I accept that it is *possible* for someone to make three high-precision rifle shots within a six second time frame, but those are each high-level shots to make. Oswald's marksman credentials/testing puts him at the lower end of qualified, and moreover he hadn't been serving as an active duty marine in over a decade. His skills would have, and yet he was shoot a moving target at distance repeatedly? I need more convincing; what specific evidence suggests he could make those shots?\n\n- Second, why would a communist group hire Oswald? He actively disliked being in the Soviet Union when he lived there and basically defected *back* to the US. I feel like they probably wouldn't have trusted him with such a high-risk mission. Moreover, this was after the Cuban Missile Crisis; wasn't Kennedy starting to deescalate tensions with the USSR at that point? And wouldn't the risk of having a known communist be caught after killing the President almost certainly escalate those tensions (as did happen)? \n\n- Third; you’re saying that the Mafia hired Jack Ruby to kill Oswald and then killed him to avoid the possibility of the presidential assassination being pinned on them? To start with, which Mafia families are we talking about here, or are you saying that the entire Mafioso infrastructure of the US mobilized in two days to kill Oswald? And, if they were actually uninvolved, wouldn’t the smarter play be to stay out of the situation entirely? I don’t buy that sophisticated organized criminals would make such a hasty move.\n\n- Fourth; I agree with you that it wasn’t an inside job, despite several theories that attempt to claim LBJ or someone else orchestrated the killings. Out of curiosity, why do you dismiss those claims so quickly?\n\nThanks again, looking forward to your responses!\n\nEDIT: Still working on getting the formatting right...there it is.",
                    "author": "itsyoursnow",
                    "created_utc": 1377194157.0,
                    "replies": [
                        {
                            "name": "t1_cbt5e8e",
                            "parent_id": "t1_cbt51l3",
                            "body": "&gt; I'm not sure I buy that Oswald was talented enough to make the shot. I accept that it is possible for someone to make three high-precision rifle shots within a six second time frame, but those are each high-level shots to make. Oswald's marksman credentials/testing puts him at the lower end of qualified, and moreover he hadn't been serving as an active duty marine in over a decade\n\nThe target was slow moving, and from a sniper stand point, incredibly close. You are correct, Oswald wasn't a great shot. It wasn't 3 precision shots. It took him 3 shots to hit his target. An in form sniper would've sent one through his skull on the first shot. Oswald missed twice.\n\n&gt; why would a communist group hire Oswald?\n\nHe was a communist, who was loyal to Communism, if not Russia, and was mentally unstable. Not hard to convince. Plus, he had ties to Russia. They knew how to get to him.\n\n&gt; I feel like they probably wouldn't have trusted him with such a high-risk mission\n\nThey didn't have to trust him. They had plans to kill him. Dead people don't talk. And if he screwed it up prior, he's a crazy communist, and Russia has plausible deniability.\n\n&gt; wouldn't the risk of having a known communist be caught after killing the President almost certainly escalate those tensions\n\nYes, but for the first time in a while, the Cold War wasn't the priority to the American public. They cared more about how Jackie was holding up than whether or not LHO was hired.\n\n&gt; Third; you’re saying that the Mafia hired Jack Ruby to kill Oswald and then killed him to avoid the possibility of the presidential assassination being pinned on them\n\nNo, I'm saying Russia hired some Mafiosos to arrange Oswald being killed. The mafia didn't have much to lose because the weren't the ones who killed JFK, so no evidence would lead to them, and no one's going to care who killed him really. They had Ruby (who had mafia ties) do it because he was terminal. A loose end that would shortly be tied up on it's own. Then everyone is clear.\n\n&gt; which Mafia families are we talking about here, or are you saying that the entire Mafioso infrastructure of the US mobilized in two days to kill Oswald?\n\nNot the whole organization. No need. Just a few mafia guys who were willing to kill someone for money, and for America.\n\n&gt; if they were actually uninvolved, wouldn’t the smarter play be to stay out of the situation entirely?\n\nThey weren't risking a lot by killing Oswald. They made Jack Ruby into an American hero.\n\n&gt; why do you dismiss those claims [of it being an inside job] so quickly?\n\nI don't dismiss them quickly. I dismiss them after carefully considering what I've read and what I believe to be true. Being an inside job just simply doesn't fit in my eyes.",
                            "author": "RoadYoda",
                            "created_utc": 1377194990.0,
                            "replies": [
                                {
                                    "name": "t1_cbthyhz",
                                    "parent_id": "t1_cbt5e8e",
                                    "body": "For years the theory I'd believed was that the mafia was responsible with the orchestrator being Carlos Marcello. You've just changed my view. Thanks",
                                    "author": "Drose2323",
                                    "created_utc": 1377227923.0,
                                    "replies": [
                                        {
                                            "name": "t1_cbti486",
                                            "parent_id": "t1_cbthyhz",
                                            "body": "Accually was Dolan.",
                                            "author": "RoadYoda",
                                            "created_utc": 1377228388.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_cbujuoi",
                                    "parent_id": "t1_cbt5e8e",
                                    "body": "Sorry for the delay in responding; life and such. Okay, you’re starting to convince me that there was more at play than I initially suspected, but I have a few more questions that you might be able to clear up.\n\n* You’ve convinced me that Oswald acted alone, or at least plausibly could have made the shots that killed Kennedy and wounded Gov. Connally. Re-examining the distance Oswald was shooting from and the fact that he did actually miss twice, it fits that someone with his marksmanship skills would’ve done poorly but still hit his target.\n\n* I’m still skeptical about why a communist group would want to kill JFK. You’re right to point out that post-assassination most of the American public was more concerned with the effect the attack had on domestic affairs and the personal lives of the First Lady, etc. Yet that ignores the fact that LBJ immediately succeeding Kennedy led to increases in tensions with the USSR both in the short term and more over in the long term. I still don’t see why communist groups would want to kill Kennedy in Dallas; why didn’t they kill him around the Bay of Pigs or the Cuban Missile Crisis? I also feel like you brush off them trusting Oswald; if he was actually hired and then apprehended, he would have still had plenty of time to tell one of the Dallas police officers or FBI agents who interrogated him for several hours at least some degree of information about who had hired him. Sure, the FBI might have thought he was a nut, but in the immediate aftermath of a presidential assassination, I seriously doubt that they wouldn’t have followed up on every piece of information he provided, regardless of how crazy it sounded (and communists hiring an assassin in the political climate of the early 60’s isn’t that crazy). Sure, Oswald *didn’t* rat on the people who hired him (aside from saying he was a “patsy”) but the odds that he *might* have still seem to me to preclude a communist group from hiring such a lose cannon (who, again, defected *away* from the USSR despite initially professing his love for the Soviets).\n\n* If you can convince me on the Russia/Communist angle, I’m starting to buy the next link in the chain, of Mafia involvement. That said, I don’t see the evidence in your argument for Mafia involvement. Sure, they *could* have, and I see their motivations, but what is your actual proof for Mafia involvement?\n",
                                    "author": "itsyoursnow",
                                    "created_utc": 1377371988.0,
                                    "replies": [
                                        {
                                            "name": "t1_cbul5bq",
                                            "parent_id": "t1_cbujuoi",
                                            "body": "Oswald was certifiably crazy. Would've been hard to decipher fact from fiction in regards to his story once apprehended.\n\n \"The Russians paid me I swear!\"\n\"Likely story kid. You left Russia. You don't like them.\"\n\"I know it sounds crazy but I swear!\"\n\nSee how that sounds, even during an open admission?\n\nAs far as the mafia, the only hard evidence is that Jack Ruby had ties and was known to be a mafioso. They're good at covering their tracks. No one will ever find evidence linking back to them",
                                            "author": "RoadYoda",
                                            "created_utc": 1377376458.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}