{
    "name": "t3_1dza5z",
    "title": "There is nothing good about Waiting for Godot CMV",
    "body": "I had to read this book for class and currently think (besides being short) that there is nothing good about it.",
    "author": "spencerflem",
    "num_comments": 4,
    "created_utc": 1368070167.0,
    "url": "http://www.reddit.com/r/changemyview/comments/1dza5z/there_is_nothing_good_about_waiting_for_godot_cmv/",
    "comments": [
        {
            "name": "t1_c9va8fe",
            "parent_id": "t3_1dza5z",
            "body": "Have you actually seen the play? Because I find school tends to kill the enjoyment of a lot of really great texts. High school permanently turned me off romantic poetry, for example.",
            "author": "[deleted]",
            "created_utc": 1368071139.0,
            "replies": [
                {
                    "name": "t1_c9vagau",
                    "parent_id": "t1_c9va8fe",
                    "body": "That I have not. I've only read the play.",
                    "author": "spencerflem",
                    "created_utc": 1368071806.0,
                    "replies": [
                        {
                            "name": "t1_c9vbrx3",
                            "parent_id": "t1_c9vagau",
                            "body": "Have a look on YouTube, there are several versions to choose from.\n\nThe play has some very strong existentialist themes; I didn't like it at first but reading it over a couple times, and thinking about the allegories, C'd my V.",
                            "author": "Decapentaplegia",
                            "created_utc": 1368076233.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_c9vbz2g",
            "parent_id": "t3_1dza5z",
            "body": "A few years ago, I took a 2nd year course on modernist literature. I was working towards, and now have, a biochem degree. I am not an English major. Here is a paragraph from an essay I wrote about Waiting for Godot. \n\nDon't expect much, folks! I don't recall, but this was probably written the day before it was due!\n\n&gt;Beckett’s Waiting for Godot exemplifies the shift of cultural beliefs in the post-modernist age from religious belief to the beginnings of an age of reason and science. Beckett applies universal themes to his characters, going insofar as to call Pozzo, as he has fallen, a representation of  “all humanity”  (pg. 54). In contrast to Eliot’s works, Waiting for Godot is highly critical of religious beliefs indirectly but clearly disparaging the characters for being so foolish as to become trapped in the machinations of faith. Beckett intends to force the reader to re-evaluate his or her opinions on the meaning of life through the almost humorous antics of Didi and Gogo, and (at times) through their profound insights. In essence, “Beckett [is not] saying that life is literally meaningless : what [he is] doing is attempting to shift us away from the superficial 'meanings' of life… to consider what they see as the ultimate and really profound meanings. That these ultimate meanings are conceived and presented as nightmarish and prison-like, as anguish, is not, surely, to say that they are 'meaningless'.” (Watson, 1975) The evolution, or lack thereof, of their thoughts as the play progresses gives us an insightful cross-section of what Beckett attempts to have the reader understand. As the play opens Didi is a god-fearing individual – he fixates on the repentant thief and considers repenting to achieve good favour with God though he seems very unsure of his motives. Gogo suggests that they should commit suicide (in both acts) though not in a defeatist way; instead, he appears to simply want to get on with his life. This intent is very revealing: Gogo and Didi want to change their lives and not remain stagnant but are not willing to actualize this desire and are effectually trapped in a state comparable to Purgatory – similar to Eliot’s hollow men. This sense of unwillingness to act is a recurring theme throughout the play whenever any characters claim they will leave but remain stationary. Pozzo and Lucky introduce an interesting dimension to Didi and Gogo; the interactions between the former can be compared to the interactions of Godot with the latter. Lucky is physically tied to Pozzo in the same way that Didi and Gogo are tied to Godot (as Vladimir comments, “Tied to Godot! What an idea! No question of it. For the moment.” (pg. 17)). In the first act, Pozzo comments that Lucky obeys him because “…he imagines that when I see how well he carries I’ll be tempted to keep him on in that capacity.” (pg. 30) With this revelation  it is clear that the analogous Didi and Gogo are waiting for Godot in the same vein; and, more notably, that their waiting is comparable to that of religious piety in the pursuit of eternal afterlife. Pozzo in this sense is deliberately confused with Godot whenever he arrives, just as Godot is deliberately confused with God in his illusory role. Beckett is trying to imply that if such a character as Godot (read: God) exists in any form, He is malicious and unworthy of eternal waiting. In the second act Pozzo and Lucky reappear as blind and mute to echo the ineptitude of their associated figues: Pozzo’s analogue Godot is struck blind (by Beckett, as he aims to ‘blind’ God); Lucky’s analogues of Didi and Gogo are mute (or as Beckett says, ‘dumb’) and unable to think. As a result of their disabilities Pozzo and Lucky are unable to rise after they have fallen, while in contrast Didi and Gogo rise as soon as they decide for themselves that they should. In the final scenes Didi and Gogo begin to understand about Godot what Beckett wishes the audience can understand about God. As Didi speaks, Beckett is really addressing the audience: “We are no longer alone, waiting for the night, waiting for Godot, waiting for… waiting. All evening we have struggled, unassisted. Now it’s over. It’s already tomorrow.” (pg. 88) As the play continues, Didi becomes more aware of his predicament and Beckett continues to address the audience: “Let us not waste our time in idle discourse! Let us do something, while we have the chance! …What we are doing here, that is the question. And we are blessed in this, that we happen to know the answer.” (pg. 91) At this point Didi fails to understand the true significance of his realization and falls back into his old delusions just as Beckett feels that society will: “We are waiting for Godot to come… or for night to fall.” (pg. 91) Throughout Waiting for Godot Beckett expresses disdain for the entrapment of mankind by religious delusions but he recognizes that man is not yet ready to advance past an age of religious belief. Until man is able to progress to an age of reason, he is doomed to forever wait for Godot: unable to act; unwilling to change; and capable of nothing except the contemplation of suicide in the hopes of moving past life as it exists for the moment. ",
            "author": "Decapentaplegia",
            "created_utc": 1368077020.0,
            "replies": []
        }
    ]
}