{
    "name": "t3_2vky2k",
    "title": "CMV: I shouldn't get LASEK surgery.",
    "body": "I don't have any current ocular issues (aside from astigmatism). They are L: -9.5, R: -9.0. This means that I can't function without my glasses or contacts– for all intents and purposes I'm blind without them. As an active rock climber and runner, I'd find replacing my contacts (which I hate) convenient, but have my skepticisms.\n\nI've been hesitant to indulge because most LASEK surgeries will cost $2500/eye, according multiple evaluations at 4 different laser surgery centers. My insurance will only pay for 15% (pre-tax $). I'm saving up to go to MBA in about 4 years, and am not sure getting LASEK now would be a wise investment.\n\nI'm also hesitant because I've heard anecdotes from friends who've had LASEK (not LASIK) that, about 2 months~1 year after their surgery, they went from an average 1.0/1.0 back down to about 0.2/0.3 ish. Still pretty damn good, but makes me suspicious about the quality of the treatment.\n\nI've heard that people experience dry eyes constantly, and am afraid that it may imply bigger problems when I get old.\n\nLastly, I heard LASEK (not LASIK) hurts like a mother the first day or two.\n\nCMV!\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "nazedayo",
    "num_comments": 14,
    "created_utc": 1423691001.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2vky2k/cmv_i_shouldnt_get_lasek_surgery/",
    "comments": [
        {
            "name": "t1_coikt14",
            "parent_id": "t3_2vky2k",
            "body": "pain is correct, but what it seems is that you need a good explanation of a doctor, while i could clarify certain things for medical expertise you should never rely on the Internet\n\n",
            "author": "jumpup",
            "created_utc": 1423691761.0,
            "replies": [
                {
                    "name": "t1_coinwc1",
                    "parent_id": "t1_coikt14",
                    "body": "Medically speaking, the doctor has said go for it. Just worried that some doctors might be underselling the point about the declining vision, but other responses on this thread say otherwise– of course taking with a grain of salt",
                    "author": "nazedayo",
                    "created_utc": 1423696928.0,
                    "replies": [
                        {
                            "name": "t1_coipxba",
                            "parent_id": "t1_coinwc1",
                            "body": "Remember, doctors are bound by the Hippocratic oath. They aren't there to \"undersell\" possible side effects, but to give you a fair assessment based on their medical experience and knowledge.  If your doctor is saying \"go for it,\" he/she does not have [**dollar signs for eyes**](http://i.imgur.com/s1nR6cT.jpg); they are recommending surgery because their medical knowledge and experience tells them that the risk of complications is low.  \n\nAll we can give you here on Reddit is personal anecdotes and maybe cite a study or two (which may be years old and not take into account recent advances in the technology).  ",
                            "author": "topherkeey",
                            "created_utc": 1423700725.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_coim4zp",
            "parent_id": "t3_2vky2k",
            "body": "I had Wavefront-Guided PRK (essentially LASEK) and it cost $2000/eye\n\nFor me, it has been worth EVERY single cent I spent.\n\nI used to have terrible eyes too: around the -7.00 range in both eyes.\n\nMy life has been changed completely.\n\nI no longer worry about bringing glasses or contact lens solution - if I go drinking and crash on a buddy's couch, I don't have to worry about any of that anymore.\n\nIt was also a huge boost in self confidence - both superficially in terms of not having to wear glasses but also in just feeling good about not having to wake up and look for my glasses.\n\nThe cost isn't a big deal - sure, I paid for it out of pocket, but I'd rather pay more for the best doctor than go cheap and have complications from the surgery. My eyesight is too valuable to risk.\n\nDry eyes do happen in the first year or two - they went away for me after about 2 years and I rarely if ever need eye drops anymore. And the eye drops come in little disposable vials which are convenient to carry if you ever need to.\n\nMy eyes started at 20/15 and are now around 20/20 after 5.5 years. Again, compared to where I was before where the 20/400 line was a pipe dream, and it's a world of difference.\n\nOther complications? Well it allows me to fly high performance aircraft",
            "author": "flynavy88",
            "created_utc": 1423693903.0,
            "replies": [
                {
                    "name": "t1_coinv8r",
                    "parent_id": "t1_coim4zp",
                    "body": "This would be exactly why I want to do it. Good to hear the dry eyes go away after about 2 years– I've heard it lasts indefinitely, but guess that's a case-by-case thing. Lucky you!",
                    "author": "nazedayo",
                    "created_utc": 1423696876.0,
                    "replies": [
                        {
                            "name": "t1_coj0szh",
                            "parent_id": "t1_coinv8r",
                            "body": "I would like to second ALMOST everything he said. Lasik was one of the best decision I ever made. Before getting lasik I dealt with glasses and contacts for years. This meant losing/breaking glasses, spending time in the morning putting contacts in and out, worry about contacts before going to into a pool, etc. The cost of lasik well justifies getting rid of those hassles not to mention that the actual monetary savings. \n\nI remember for the first few weeks after lasik I would be just so thankful to wake up each morning having crystal clear vision. Its now become normal to me but even several years later it will pop into my head and I would think about how awesome lasik is. Cannot recommend it enough.\n\nThe one part of my experience that differed from the commenter above is that I never experienced dry eyes. Actually I differed a little from your post in that I really didn't have any pain either. Maybe lucky? I also paid significantly less than you stated (about half) but that was in part because I was referred to doctor by my sister. If you happen to live in Southern California I recommend the doctor. ",
                            "author": "MIBPJ",
                            "created_utc": 1423722715.0,
                            "replies": [
                                {
                                    "name": "t1_cok1zcn",
                                    "parent_id": "t1_coj0szh",
                                    "body": "Just curious, what was your prescription? It's usually low prescriptions who praise it to death and experience little to no dry eyes.",
                                    "author": "[deleted]",
                                    "created_utc": 1423806520.0,
                                    "replies": [
                                        {
                                            "name": "t1_cokopqu",
                                            "parent_id": "t1_cok1zcn",
                                            "body": "It wasn't low but I also didn't have extremely poor vision. I can't actually recall what my prescription was. I want to say I had 20/70 vision but I could totally be missing the mark. ",
                                            "author": "MIBPJ",
                                            "created_utc": 1423863433.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_coim7oq",
            "parent_id": "t3_2vky2k",
            "body": "The pain is only temporary.\n\nYou will be able to see without relying on an outside device (glasses/contacts).  That's a huge deal.  Right now, if someone knocked your glasses off, you could not function.  If you accidentally rubbed a contact out, you could not function.  After LASEK, you can. \n\nYou'll be able to see in the shower.  \n\nYou wake up and you can SEE.",
            "author": "[deleted]",
            "created_utc": 1423694029.0,
            "replies": []
        },
        {
            "name": "t1_coin2a8",
            "parent_id": "t3_2vky2k",
            "body": "$5,000\n\nHow much do you spend on glasses?  Contacts?  How often do you get new ones?",
            "author": "DashFerLev",
            "created_utc": 1423695458.0,
            "replies": [
                {
                    "name": "t1_coinuey",
                    "parent_id": "t1_coin2a8",
                    "body": "$100 every 2~3 years on glasses. $500/yr. (a bit less thanks to insurance) on contacts. Financially I can justify it if I can finance it, but not sure if that's a thing.",
                    "author": "nazedayo",
                    "created_utc": 1423696835.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_coixxlu",
            "parent_id": "t3_2vky2k",
            "body": "I had LASIK done six months ago. My eyes were slightly better than yours (about -7.25). The cost for me was about $4,000 after insurance. Then I used a lot of money from my HSA. I also financed the rest. \n\nThe surgery was completely painless, but the week after that felt like I had a torn contact. It hurt, yes, but was very uncomfortable. That lasted about two weeks. Several times I had to pull over while driving to work because my eyes hurt so bad, but I'm photosensitive so the surgery isn't solely to blame. \n\nSince then my eyes have felt great. They were very good after surgery, but one eye has slightly diminished. The eye doctor told me that this will be a good thing in the next fifteen or twenty years and will prevent me from needing reading glasses. In the meantime I do not need contacts or glasses. \n\nI cycle and rock climb (and run, swim, weight lift, etc., etc.). Most things I enjoyed were impossible in glasses and as I got older it was harder to wear contacts. If you can afford the surgery I would recommend it. The younger you are the better investment it is. ",
            "author": "drnc",
            "created_utc": 1423715813.0,
            "replies": []
        },
        {
            "name": "t1_coj1c2c",
            "parent_id": "t3_2vky2k",
            "body": "If you have had lasik you can become an astronaut, now why does that matter? Because the safety regulations to become an astronaut are ridiculously stupid, if you have ever had a kidney stone you can't be an astronaut. So I kinda consider that being a stamp of approval from a third party organization with strict regulations that could only lose by approving of it.",
            "author": "[deleted]",
            "created_utc": 1423724370.0,
            "replies": []
        },
        {
            "name": "t1_cojaicn",
            "parent_id": "t3_2vky2k",
            "body": "I had LASIK 8 years ago and I can say without a doubt, it was the best $3,000 I have ever spent.  Granted, I was about the perfect candidate in terms of nearsighted vs. far sighted, no astigmatism etc. so the doctors said that my surgery would be about as routine as it gets.  Your situation is a bit different in that you have astigmatism, but man, it is so worth it to never have to worry about glasses / contacts anymore and being able to wake up every day and just see perfectly. \n\nYes, I thought the surgery sucked, it was a shitty 20 - 30 minutes or whatever it was, but oh so worth it (for me).  I still have 20-20 vision now, and accept that later in life I will probably have to get cheater glasses, but that's a fact of life.  As for dry eyes - yeah it can happen, but having some visene with you is a quick and easy fix.  \n\nIf you choose to go with the surgery, good luck with it.  If you don't get the surgery I get it as it's a big financial and life decision that shouldn't be made lightly.   ",
            "author": "Mannbearpiggg",
            "created_utc": 1423756010.0,
            "replies": []
        }
    ]
}