{
    "name": "t3_2iwe8d",
    "title": "CMV: I did get why people love Catcher in the Rye",
    "body": "Okay, so I read the book about a year ago, I thought I missed something because all I hear is praise for this book.\n\nSo I listened to the audiotape, nothing! I didn't like it, I thought it was boring, it seemed just like some stubborn asshole named Holden going around making weird decisions and being a dick. I don't see a deeper meaning to it.\n\nNow I'm not on of those people that just don't get the deeper meaning. I can look at paintings and photographs and get what they're trying to say, and can see the beauty in it.\n\nI've read plenty of books, a lot of them I enjoyed, but Catcher in the Rye? Hated it.",
    "author": "Crabcakes125",
    "num_comments": 25,
    "created_utc": 1412981340.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2iwe8d/cmv_i_did_get_why_people_love_catcher_in_the_rye/",
    "comments": [
        {
            "name": "t1_cl66lsk",
            "parent_id": "t3_2iwe8d",
            "body": "You should realize the historical context. You've probably grown up in a time where teen angst is the norm and a big part of the social media fabric.  But the idea of an angsty teen coming to terms with cynicism and nihilism wasn't really popular culture back then\n\nWhat do you think of the great gatsby or to kill a mockingbird?  Maybe you just don't like 20th century american literature?  Or eve hick Finn? ",
            "author": "urnbabyurn",
            "created_utc": 1412988035.0,
            "replies": []
        },
        {
            "name": "t1_cl68r5l",
            "parent_id": "t3_2iwe8d",
            "body": "Let me try to explain the appeal of Catcher in the Rye. Holden is kind of an asshole, but there weren't really characters like him at the time. You didn't have authors writing about the awkward teenage years where you first started to cope with all the things that adults take for granted. No one else  (at least no one mainstream) captured that armchair nihilist phase when a teenager starts to notice everything wrong with the world but hasn't yet shed their sense of entitlement enough to put it into perspective. \n\nAre you familiar with Tv Tropes, specifically the trope [Seinfeld is Unfunny](http://tvtropes.org/pmwiki/pmwiki.php/Main/SeinfeldIsUnfunny)? Teenage angst is done to death now, but at the time Catcher in the Rye came out, it was something new and refreshingly honest.",
            "author": "Glory2Hypnotoad",
            "created_utc": 1412993582.0,
            "replies": [
                {
                    "name": "t1_cl68rw6",
                    "parent_id": "t1_cl68r5l",
                    "body": "Seinfeld Is Unfunny\n----\n____\nThere are certain shows that you can safely assume most people have seen.\nThese shows were considered fantastic when they first aired. Now, however,\nthese shows have a [ Hype Backlash\n](http://tvtropes.org/pmwiki/pmwiki.php/Main/HypeBacklash) curse on them.\nWhenever we watch them, we'll cry, \"That is _ so _ old\" or \"That is _ so _ [\noverdone ](http://tvtropes.org/pmwiki/pmwiki.php/Main/DeadHorseTrope) \".\n\n[Read More](http://tvtropes.org/pmwiki/pmwiki.php/Main/SeinfeldIsUnfunny)\n____\n*I am a bot. [Here is my sub](http://reddit.com/r/autotrope)*",
                    "author": "autotrope_bot",
                    "created_utc": 1412993637.0,
                    "replies": []
                },
                {
                    "name": "t1_cl696s0",
                    "parent_id": "t1_cl68r5l",
                    "body": "I don't think I'd agree with the refreshingly honest thing, and I didn't really find him \"angsty\" as much as I found him to be an obnoxious, insane, moron. I mean, I suppose him being kinda stupid while thinking he's super smart could have been part of the whole \"teenager\" thing, since that's sort of a common way adults view teens, but the thing is, I was about his age when I read the book, and even I thought he was a moron. Seriously, who the hell doesn't know that ducks migrate? I knew that when I was in elementary school. Goddamn, that character pissed me off so much.",
                    "author": "NightCrest",
                    "created_utc": 1412994730.0,
                    "replies": [
                        {
                            "name": "t1_cl69kyx",
                            "parent_id": "t1_cl696s0",
                            "body": "There was a point around chapter 7 or 8... I can't remember... when he's just been robbed by the pimp and he's standing at a window... I wanted him to jump so badly, but there was too much of the book left to cover his funeral so I knew it wouldn't happen.",
                            "author": "sleepyintoronto",
                            "created_utc": 1412995786.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cl69xhe",
                            "parent_id": "t1_cl696s0",
                            "body": "Out of curiosity, when you read the book, was it with the expectation that Salinger expected you to like Holden? I could see that completely killing a reader's experience of the book, which isn't to say you'd necessarily like it otherwise, but I think once you realize that the author is in on the joke, there's more to appreciate.\n\n&gt;  Seriously, who the hell doesn't know that ducks migrate?\n\nSomeone who was never taught that particular factoid. You could do that with virtually any fact and assume the person who doesn't know it is stupid. We all have gaping holes in our knowledge that make us idiots from someone's perspective.\n\nLet me put it this way. Have you ever watched a movie and thought a character was an obnoxious asshole but were still impressed by the actor who brought that obnoxious asshole to life? That's what people see in Catcher in the Rye: a smartly written portrayal of a flawed and kind of annoying character.",
                            "author": "Glory2Hypnotoad",
                            "created_utc": 1412996738.0,
                            "replies": [
                                {
                                    "name": "t1_cl6a7as",
                                    "parent_id": "t1_cl69xhe",
                                    "body": "&gt; when you read the book, was it with the expectation that Salinger expected you to like Holden?\n\nYou know, my English teacher asked me something similar to that when I expressed my disdain for the character. It wasn't really just that I disliked him as a person, I disliked him as a *character.* He didn't seem smartly written to me, he just seemed like an annoying character. He wasn't believably annoying, he wasn't interestingly annoying, he was just annoying. He wasn't a \"flawed character\" because he barely even qualified as a character to me. Characters, to me, either need to have some sort of redeeming quality to them or otherwise serve some sort of purpose to the plot. The book hardly had a plot and was basically just some annoying guy wandering around the city doing random shit and saying stupid as hell things. It was just bad.\n\n&gt; You could do that with virtually any fact and assume the person who doesn't know it is stupid.\n\nWell then that's the other thing. He asked where the ducks went to basically *friggen everyone.* You're telling me not a single goddamn person he ran into knew or could be bothered to utter the word \"migration?\"",
                                    "author": "NightCrest",
                                    "created_utc": 1412997474.0,
                                    "replies": [
                                        {
                                            "name": "t1_cl6ooml",
                                            "parent_id": "t1_cl6a7as",
                                            "body": "&gt;The book hardly had a plot and was basically just some annoying guy wandering around the city doing random shit and saying stupid as hell things\n\nThe book is episodic. Each chapter focuses on something different and has Holden have a different interaction or experiencing a different event, and the story builds off of these events. There is definitely a plot, it's just told in a disjointed way intentionally to better characterize Holden.\n\n&gt;He didn't seem smartly written to me, he just seemed like an annoying character. He wasn't believably annoying, he wasn't interestingly annoying, he was just annoying. He wasn't a \"flawed character\" because he barely even qualified as a character to me. \n\nI would strongly disagree with this, Holden definitely has ambitions, ideals, and struggles, and those things are all well presented. He definitely qualifies as a character, especially considering the entire book is told through his perspective and he's extremely opinionated about certain things. He's lonely and cynical, and no one seems to care about how unhappy he is. I don't expect everyone to relate to, or like him, but if you're a teenager you can probably relate to his juvenile mindset and emotions. ",
                                            "author": "bluefyre73",
                                            "created_utc": 1413052270.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cl6swis",
                                                    "parent_id": "t1_cl6ooml",
                                                    "body": "&gt; the story builds off of these events\n\nI don't see how all the random crap he did connected in any way at all.\n\n&gt; Holden definitely has ambitions\n\nYes, as I recall, his ambition was to stand out in a rye field and catch children he imagined would be running through said rye field towards a cliff. Which is at best a weird as all shit metaphor, and at worst the crazy ramblings of a mad man.\n\n&gt; He's lonely and cynical, and no one seems to care about how unhappy he is\n\nNo, because speaking of mad men, he was literally insane. He ended up in a mental hospital to get treatment because *the guy was crazy.*\n\n&gt; if you're a teenager you can probably relate to his juvenile mindset and emotions\n\nI was a teenager when I read this. I do understand what it's like to have a juvenile mindset and emotions. He took to to an extreme that I simply could not relate to. An extreme that landed him in a mental hospital.",
                                                    "author": "NightCrest",
                                                    "created_utc": 1413062097.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cl6vxxp",
                                                            "parent_id": "t1_cl6swis",
                                                            "body": "&gt;I don't see how all the random crap he did connected in any way at all.\n\nEach chapter shows an event that reveals or reinforces an aspect of Holden's character. Ie the chapter where he tries to call a stripper asking for a hook up and backs out shows he is afraid of sexuality in a fairly youthful manner; and this is reinforced when he tries to have a conversation with a prostitute, when he says his hotel is fully of dirty perverts before admitting he is one of the most horny people he's ever met, and when he asks one of his older friends very curiously about his sexual experiences. It takes many chapters for the reader to really understand how and why Holden thinks. \n\n&gt;Which is at best a weird as all shit metaphor, and at worst the crazy ramblings of a mad man.\n\nIt's one of the only things that make him happy. The metaphor is very clear cut, it's about preserving innocence. Holden has lost his innocence and wants to protect children from having that happen (he tries to scribble out swear words written on an elementary school). At the end of the novel he comes to grips that children will grow up and accepts it.\n\n&gt;No, because speaking of mad men, he was literally insane. He ended up in a mental hospital to get treatment because the guy was crazy.\n\nI don't get your point. Is a character who is insane suddenly not interesting to read about? Holden's suffering from depression and needs a lot of help mentally, why is this a problem with the book or character?\n\n\n ",
                                                            "author": "bluefyre73",
                                                            "created_utc": 1413069229.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cl6wrm4",
                                                                    "parent_id": "t1_cl6vxxp",
                                                                    "body": "&gt; Each chapter shows an event that reveals or reinforces an aspect of Holden's character\n\nSo basically the events are connected because the same person did stuff in them. That's honestly a pretty poor connection. If the entire point of the plot is just specifically to tell you stuff about this guy's personality, it's not that great of a plot imo.\n\n&gt; he is afraid of sexuality in a fairly youthful manner\n\n-\n\n&gt; Holden has lost his innocence\n\n-\n\n&gt; It takes many chapters for the reader to really understand how and why Holden thinks.\n\nSee, all I got out of it was that Holden was a massive hypocrite, a bit of an idiot, and mentally unstable. That was basically it. That is not, to me, an interesting character. The disjointed happenings the author used to beat those aspects of this character into my head for no other reason than \"because he's the main character\" were not something I found to be well written.\n\n&gt; Is a character who is insane suddenly not interesting to read about?\n\nIs a character that is insane supposed to suddenly *be* interesting to read about? My point is that all of his personality can be summed up by \"tragedy broke his mind and sent him into a spiral of idiocy and insanity.\" He was an insane hypocrite. That's all he was and that is utterly one dimensional.\n\nThere wasn't, as I recall, much of a showing of who he was before he lost his mind, so it doesn't even make for a compelling tragic tale to me. He was just some guy that suffered a lose and completely broke down in the most mundane, drawn out, and utterly frustrating way imaginable. I was a teen with depression while reading this book, and I've had people in my life die too. Him snapping because of those things isn't enough on its own to be either interesting or compelling to me.",
                                                                    "author": "NightCrest",
                                                                    "created_utc": 1413071115.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_cl6x2ih",
                                                                            "parent_id": "t1_cl6wrm4",
                                                                            "body": "&gt;Is a character that is insane supposed to suddenly be interesting to read about?\n\nI didn't say that was the case...you acted like that because Holden ended up in a mental hospital he wasn't interesting. Whether or not a character is stable doesn't determine how interesting they are and is irrelevant. \n\n&gt;He was an insane hypocrite. That's all he was.\n\nThere was a lot more to it than that. Holden has issues no one addressed and no one cared about. He was directionless and suffering the main point of the book is that he was alone without anyone to really help him. His brother died, his parents aren't around, he's surrounded by people he perceives as fake and one dimensional, and he doesn't know what to do with himself. He didn't \"snap,\" this was all building inside of him, and by the end of the book he begins to face the reality of the world. \n\nReally, you don't have to like the book, because it's subjective and whether you liked Holden or not is your own opinion. I do not believe the book is poorly written however, because there has obviously been a lot written about it in terms of criticism and interpretation. \n\n",
                                                                            "author": "bluefyre73",
                                                                            "created_utc": 1413071799.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_cl6xdwv",
                                                                                    "parent_id": "t1_cl6x2ih",
                                                                                    "body": "&gt; Whether or not a character is stable doesn't determine how interesting they are and is irrelevant.\n\nBut my point is that's all he was. All of his issues can potentially be traced back to his instability.\n\n&gt; Holden has issues no one addressed and no one cared about.\n\n...issues that stemmed from his instability.\n\n&gt; He was directionless and suffering\n\n...because his brother died.\n\n&gt; he perceives as fake and one dimensional\n\n..because he's unstable.\n\n&gt; this was all building inside of him\n\n...ever since his brother died. He is completely and utterly defined by that one singular event. Yes, it was a tragic event, but we weren't shown how it effected him because we weren't shown the character he was before. All we saw was the aftermath, and so all we got was a one dimensional character with one defining trait - instability.\n\n&gt; whether you liked Holden or not is your own opinion\n\nObviously. This is my interpretation of the book, and we're here discussing it because our interpretations differ. But also, I dislike it specifically because it is my own opinion that it is poorly written. The fact that a lot of people have written a lot of things about it only proves it's popular, not that it's well written. Well written is just as much of a subjective idea, and I'm entirely aware of that.",
                                                                                    "author": "NightCrest",
                                                                                    "created_utc": 1413072508.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "name": "t1_cl88xn5",
                                            "parent_id": "t1_cl6a7as",
                                            "body": "It reminded me of being younger and getting pissed when other people would Lauph at me for not knowing something that might be considered common knowledge, but somebody has to explain things to you at some point, my parents never taught me very much at all, I'm guessing holdens parents were always too busy to explain anything to him so he had no context. ",
                                            "author": "Lawrencium265",
                                            "created_utc": 1413212911.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cl89ogw",
                                                    "parent_id": "t1_cl88xn5",
                                                    "body": "But I'd guess you weren't obsessed with a really well known answer to a specific question. Like, if it was so very important to him to know exactly what happened to the ducks, why, with the answer being such a well known fact, was he completely unable to ever get an answer to that? That's the part of it that bugs me more than anything, he was in a goddamn boarding school at the start of the book, you're telling me he couldn't find the answer to that question *at a school?*",
                                                    "author": "NightCrest",
                                                    "created_utc": 1413214496.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cl89vmf",
                                                            "parent_id": "t1_cl89ogw",
                                                            "body": "I think that's what the author is getting at. Nobody will help this kid with what is troubling him not even something so basic. ",
                                                            "author": "Lawrencium265",
                                                            "created_utc": 1413214907.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cl8a4kq",
                                                                    "parent_id": "t1_cl89vmf",
                                                                    "body": "But it seems like a very extreme and unbelievable example to use for that. Part of why I don't see it as a well written book. He seemed sincere to me, so barring the idea that he was asking to see if anyone would answer, and assuming he genuinely didn't know...why couldn't he have gone to the friggen school library and found a book about ducks or even ask the goddamn librarian. Or a teacher for that matter. It's literally part of their job to answer questions, so unless he was at a really shitty school, it should have been a piece of cake for him to get that answer.",
                                                                    "author": "NightCrest",
                                                                    "created_utc": 1413215430.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_cl6ba7q",
                            "parent_id": "t1_cl696s0",
                            "body": "The funny thing about this view is that it almost perfectly reflects Holden's attitude. He criticises others intelligence from a position of, at best, modest intellectual superiority, (ironically in doing so he even makes frequent use of the word moron which you used twice above). He frequently criticises the authenticity, and by extension the validity, of other peoples feelings and emotions, which is essentially what we do when we call characters like him \"angsty.\" He picks on the seemingly insignificant shortcomings of others, (seriously who the fuck cares if he doesn't know that ducks migrate?) to make himself feel better. \n\nI'd really encourage you to read the book again now that you're older. Often kids read the book and feel threatened that Holden is perceived as being compelling when he's clearly not all that special, but in doing so they're demonstrating the exact reason he's so compelling; it's not that he's unique it's that his insecurity is so ubiquitous. Sometimes it just takes a bit of growing up to realise this.",
                            "author": "TomShoe",
                            "created_utc": 1413000517.0,
                            "replies": [
                                {
                                    "name": "t1_cl6bhfo",
                                    "parent_id": "t1_cl6ba7q",
                                    "body": "Ok, so first of all, I never called him angsty, and secondly, it's very different to question the authenticity of real people's emotions than to question the authenticity of a character's emotions which were literally manufactured by an author. They're not, by definition authentic, and it's completely valid to question their believability (not just of the character's actions, but the worlds reactions to them).\n\n&gt; seriously who the fuck cares if he doesn't know that ducks migrate?\n\nThe author apparently. Because it was mentioned over and over and over again. And if he were a real person, I wouldn't think anything of it, I'd say migration and move right the fuck on. But the author felt the need to have this character ask that stupid as hell question over and over and have *no one know the answer to something so annoyingly simple!*\n\n&gt; when he's clearly not all that special\n\nHe seemed pretty special to me. Just not the good kind of special.\n\nEdit: in fact, I vaguely recall that it ended with him being locked away in a mental hospital or something.",
                                    "author": "NightCrest",
                                    "created_utc": 1413001097.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cl6le9y",
                    "parent_id": "t1_cl68r5l",
                    "body": "Okay, so it's nothing special now, but it was the cannon for the teenage angst character to come later one, okay, I see.\n\nI still didn't like it though XD",
                    "author": "Crabcakes125",
                    "created_utc": 1413044411.0,
                    "replies": [
                        {
                            "name": "t1_cl7kou4",
                            "parent_id": "t1_cl6le9y",
                            "body": "It doesn't really matter if you liked it, or even if it qualifies as good by today's standards, but it was original and good in yesteryear. ",
                            "author": "NuclearStudent",
                            "created_utc": 1413143595.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cl6aecx",
            "parent_id": "t3_2iwe8d",
            "body": "Holden is suffering.  His brother died, his parents neglect him, his friend committed suicide while borrowing his sweater.  That's not generalized teen angst.  He is struggling with his own mental illness, and is profoundly sad and lonely.  When he tries to reach out to an adult he trusts (Mr. Antolini), he learns he has ulterior motives.\n\nI don't understand people who don't have sympathy for Holden.  Is it because he's rich?  And you think that people who come from rich families have no right to feel deep emotional pain?  This is a story of an abandoned child doing his best to navigate his world without any kind of guide.  What's more sympathetic than that?\n\nAs far as my own personal love for the book, I can tell you that when I read it as a teenager, I had an epiphany-like experience of feeling like someone else in the world might actually understand me.  I was neglected, I was mentally ill and not getting treatment, and when Holden said it was the kind of cold where you felt like you were going to disappear every time you crossed the street, I thought *\"Oh my God, somebody GETS me.\"*\n\nThis book isn't for everyone, but for some people it is a profoundly validating experience.  Maybe you didn't suffer in the same way as Holden when you were a child.  Maybe you have a different kind of coping strategy, a different kind of resilience.  But Holden's voice is so true to how so many of us feel, when we read that book we feel as if J.D. Salinger has reached out and held our hand.\n",
            "author": "dorky2",
            "created_utc": 1412998029.0,
            "replies": [
                {
                    "name": "t1_cl86ji7",
                    "parent_id": "t1_cl6aecx",
                    "body": "How did you know you are mentally ill?\n\nThis question seriously interests me. Even with people who are diagnosed, I don't really understand how psychiatrists draw the line between ill and not ill, just normally unhappy and weird. Sigmund Freund said the goal of psychotherapy is to turn abnormally unhappy people into normally unhappy people. Ha. \n\nAnd then there are people who weren't even been diagnosed and still somehow know they do it.\n\nI have never identified with being mentally ill, largely because in my culture there is a stigma on it - you don't want to be called an idiot or crazy. But even more, I never liked the idea that even my mind is something I might not have complete control of. \n\nUltimately when you have no idea between the line that separates the ill unhappy and the healthy unhappy, it is fairly easy to think you are OK. Why were you sure you are not? And why is the person described in this book?\n\n",
                    "author": "bazmeg",
                    "created_utc": 1413206557.0,
                    "replies": [
                        {
                            "name": "t1_cl8wefi",
                            "parent_id": "t1_cl86ji7",
                            "body": "For myself, I was diagnosed later on but my symptoms started at age 10.  My primary symptoms were panic attacks, lack of appetite (I was dangerously skinny), and low energy, in addition to periods of such deep depression that I was almost non-functional: crying multiple times a day, feeling hopeless, having an intense hatred of myself.  Mental illness isn't exactly black and white, but there is a difference between being a melancholy personality or an unusual person and having a mental health problem.\n\nHolden reveals at the beginning of the book that he is in a mental health facility, and goes on to narrate the book as a sort of flashback.  His outsize emotional reactions throughout the book imply that he is not mentally well.  There are indications all over the place that he's sick.",
                            "author": "dorky2",
                            "created_utc": 1413260763.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cl76a8q",
            "parent_id": "t3_2iwe8d",
            "body": "Catcher in the Rye is my favorite standalone book.  I think a lot of the reason that people \"can't get into it\" is due to a few factors.  The first is that there's virtually no \"action\" that happens in the book.  There's no suspenseful, edge-of-your-seat type scenes that people are accustomed to in our present day.  The second reason is that there's not a conventional plot so I can understand why the book feels like Holden is simply meandering around New York on his whims without a real objective in mind.  This causes a sense of strange anxiousness and impatience for the reader hoping for something to happen but they're unsure of what they actually want to happen.\n\nBut on the other hand, IMO Catcher in the Rye is pure gold simply because Holden's commentary.  He's always putting situations into words that are universal for a certain type of people and when you read it you think \"hey, I didn't know anyone else thought that except me.\"  And for many readers, this is the first time they encounter this specific emotion.  But it's the dry cynicism and sometimes antiquated choice of words that make his view on situations literally laugh out loud worthy.  For example, when he meets that Navy guy after the musical (or whatever it was) and he says something like \"He was one of those guys that think they're being a pansy if they don't break around forty of your fingers when they shake hands with you.\"  Hilarious and the book is full of this type of thing.",
            "author": "Adjustify",
            "created_utc": 1413097105.0,
            "replies": []
        }
    ]
}