{
    "name": "t3_2mmfrd",
    "title": "CMV: I should have gone to Space Camp when I was a kid.",
    "body": "Back in the late 90s and early 2000s I always wanted to go to Space Camp (the official NASA one in Mobile, Alabama). I used to see commercials for it on TV and they made it look like the coolest, most fun thing ever. However, my parents would always tell me that I couldn't go whenever I asked them about it. I don't exactly know their reasoning for it (they used to tell me that I could go if I got good grades and then tell me that they never said so) but in any case, I feel like should have gotten to go.\n\nBasically there's only one way to change my view. Convince me that Space Camp wasn't all it's cracked up to be. (I'm thinking it might be significantly lamer now than it was back then due to budget cuts, but I want you to convince me that it sucked back then)\n\nArguments about my parents' wishes aren't going to convince me by the way.\n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "razorbeamz",
    "num_comments": 16,
    "created_utc": 1416276622.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2mmfrd/cmv_i_should_have_gone_to_space_camp_when_i_was_a/",
    "comments": [
        {
            "name": "t1_cm5l693",
            "parent_id": "t3_2mmfrd",
            "body": "&gt;Arguments about my parents' wishes aren't going to convince me by the way.\n\nYou don't seem to consider that the cost of it might be prohibitive.  Space camp seems to cost currently between $700-1000, plus there's the cost of flying you there and back, and probably some ancillary costs too.  It's hard to say your parents should send you on what is a fairly expensive vacation if it would make them unable to pay the mortgage.",
            "author": "huadpe",
            "created_utc": 1416277046.0,
            "replies": [
                {
                    "name": "t1_cm5lbyg",
                    "parent_id": "t1_cm5l693",
                    "body": "Let's just imagine for the sake of argument that it's NOT cost prohibitive.\n\n&gt;plus there's the cost of flying you there and back\n\nI don't live horribly far from Mobile. Maybe a 4 hour drive at most. No need to fly. Just sayin'",
                    "author": "razorbeamz",
                    "created_utc": 1416277362.0,
                    "replies": [
                        {
                            "name": "t1_cm5lvxq",
                            "parent_id": "t1_cm5lbyg",
                            "body": "Fair enough.  I was just thinking that I know parents who have felt awful about disappointing their kids who wanted to do something the parent couldn't afford.  So I feel sympathy there if that's the case.\n\nBut assuming it's not, I don't know much about space camp, never went myself.  So no real perspective to add.",
                            "author": "huadpe",
                            "created_utc": 1416278441.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cm5mpb5",
            "parent_id": "t3_2mmfrd",
            "body": "Space Camp is this thing in your head now because it was the one that got away. \n\nLook at your life now. What actual change would have happened, you think, if you got to go to Space Camp? You're going to have to provide those details, since I don't really know anything about you. But honestly, would your life have been so much more better?\n\nAny effort looking at the possible regrets of the past is not effort you can spend on new ideas for the future.\n\nIf you're really missing out on the whole Space camp adventure there has to be something out there that you can do today that will give you a taste of things. \n\n",
            "author": "Raintee97",
            "created_utc": 1416280040.0,
            "replies": [
                {
                    "name": "t1_cm5mup4",
                    "parent_id": "t1_cm5mpb5",
                    "body": "∆\n\nI guess you're right. I'm still open to some arguments that Space Camp was overhyped though, so I'm definitely wanting to keep this thread open.  ",
                    "author": "razorbeamz",
                    "created_utc": 1416280338.0,
                    "replies": [
                        {
                            "name": "t1_cm5mzjk",
                            "parent_id": "t1_cm5mup4",
                            "body": "Please do since you might get some good thoughts. And thanks again for the delta kind internet stranger. ",
                            "author": "Raintee97",
                            "created_utc": 1416280608.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cm5nkqm",
                            "parent_id": "t1_cm5mup4",
                            "body": "Confirmed: 1 delta awarded to /u/Raintee97. ^[[History](/r/changemyview/wiki/user/Raintee97)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][[Subreddit](http://www.reddit.com/r/DeltaBot/)]",
                            "author": "DeltaBot",
                            "created_utc": 1416281771.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cm5xfbn",
                            "parent_id": "t1_cm5mup4",
                            "body": "I think Raintee97's comment is by far the most important one, and I agree with it.\n\nHowever, I went to space camp in California once when I was 12 or so. I enjoyed it pretty well, but I often forget that I ever did it until something reminds me. I guess the high points weren't high enough for it to really stick with me.\n\nNow in later years I went to Computer Camp, and that was the bomb.",
                            "author": "sm0cc",
                            "created_utc": 1416317852.0,
                            "replies": [
                                {
                                    "name": "t1_cm62tsf",
                                    "parent_id": "t1_cm5xfbn",
                                    "body": "Did you go to the one in I think Idyllwild? ",
                                    "author": "SamAdamsGaming",
                                    "created_utc": 1416329973.0,
                                    "replies": [
                                        {
                                            "name": "t1_cm64nte",
                                            "parent_id": "t1_cm62tsf",
                                            "body": "I barely remember, but I think it was near SF somewhere, and not woodsy at all. It was very well done, as far as I remember: we did the low-gravity simulator and had a huge mock space shuttle where we did a mission simulation. There was astronaut ice cream at one point. But for whatever reason it just didn't stick with me.",
                                            "author": "sm0cc",
                                            "created_utc": 1416333231.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cm5mwyw",
            "parent_id": "t3_2mmfrd",
            "body": "hello friend, i went to nasa camp.\n\nIt was based in florida, it occured in the 1980's\n\ni do not now recall if it was an official nasa thing, dad is dead, mom would say it was official no matter what.\n\nwe did a lot of space things, we did see some official rockets, we were on an official nasa campus.\n\nit was a terrible waste of money.\n\nI don't know what space camp is like, but Nasa camp was a continuation of high school, the cool kids and athletes had their representatives, the nerds and the ostracized had theirs. It was no different. we had some \"space\" themed classes that some people just dicked their way through, some payed attention too and others just used the time to flirt and mock other members of the group.\n\nI don't know where you fit in your own schools clique circle. I don't know how you would have handled it, but i was a nerdy kid, not an ostracized one, and it was a waste of time and money.\n\nthe education was geared towards an average grade level of 9 or so (i was in 7th grade at the time, most of the people attending where about my age or older) the \"experience space training\" was basically rides we could only go on twice.\n\nthe gravity jumper, [was basically bungee cords](https://c2.staticflickr.com/4/3415/3662223830_0b449f357c_z.jpg?zz=1)\n\n [the orbitron is something you can ride at most state fairs in texas](http://www.allaboutent.com/wp-content/uploads/2013/02/gyroscope-ride.jpg)\n\n the accelerator training was a [centrifugal force ride](http://2.bp.blogspot.com/_64wjUxIOxTc/TNAuIK0CqZI/AAAAAAAAAUA/AjHjkse2HSI/s400/Carnival+Zero+Gravity+Centrifugal+Force+Full+Circle.png) except not as fun. \n\n\nwe met astronaughts and went to a space museum, they showed us a pee/human waste catcher and played a \"prank\" by asking us to examine it and rub it against our faces, touch and smell it before telling us it was used to catch poo and pee.\n\nobviously the cool kids used this to mock everyone else, even though we all did it\n\nwe were not aloud in the scuba tank, but watched actual astronought trainees in it, we ate space food (which sucked) for 10 days\n\nwhen i went home, i told my parents it was great.\n\neven as a child i felt it was a terrible waste of money and time.\n\n\n\nI feel the one in Florida at least was a money making opportunity, not something that would benefit the people attending. we were part of a group of 50 over 10 days or so. (maybe 7 days of camp) with a total of about 8 from my own school.\n\nwe spent a few days in a hotel resolt and mall, i spent that time in a nearby arcade with little supervision. I thought that was the best part of the whole thing. \n\n\nMaybe mine was particularly poorly run. I still have a coat and a badge from the experience. first hand, personal experience, it was a waste of effort and money and the more i think of it the more i am convinced the school got a kickback or something for organizing and trip to the camp.\n\ni believe mine took place in november, just as it was getting cold, so maybe we got the B team, maybe we were the B team. \n\n\n\ni don't know if this would convince you, but as i kid, before i begged and pleaded and gave up allowances for 2 months to prove i wanted to go. and i regretted it deeply after.\n\ni don't care anymore. but jeeez, what a goddam waste. \n\n\ntl:dr - waste of money, a camp with a few carnival rides that was less educational than any given math, science or skill specific camp. difference is the branding and the cost. there is no increase in value, only on cost. if this was a \"i should have gone to camp. maybe, but i should have gone to space camp. it has the same logo as my nasa camp did, i suspect it was the same thing.   no added value.",
            "author": "10gags",
            "created_utc": 1416280465.0,
            "replies": [
                {
                    "name": "t1_cm5nasq",
                    "parent_id": "t1_cm5mwyw",
                    "body": "∆\n\nWow, that convinced me that at the very least, the Florida one sucked. I was actually more into the idea of going when I was the age to go to the 11-14 year-old camp, not the one for high school kids, but I'd imagine it wasn't a lot different.\n\nIf it's any help to know this, if you went to Cape Canaveral, Florida it was probably an official Space Camp.",
                    "author": "razorbeamz",
                    "created_utc": 1416281217.0,
                    "replies": [
                        {
                            "name": "t1_cm5nimr",
                            "parent_id": "t1_cm5nasq",
                            "body": "Confirmed: 1 delta awarded to /u/10gags. ^[[History](/r/changemyview/wiki/user/10gags)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][[Subreddit](http://www.reddit.com/r/DeltaBot/)]",
                            "author": "DeltaBot",
                            "created_utc": 1416281657.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cm5niv6",
                            "parent_id": "t1_cm5nasq",
                            "body": "cape carnivale, that was it alright.\n\nfucking space camp. seriously. \n\nthe waste disposal / pee catch prank was really what turned me on the whole thing \n\nthe \"cool kids\" used that to mock everyone else for the whole rest of the trip and then they used it when we got back to our school for a few months after \"10 gags rubbed some dudes shit container on his face\" \n\nfucking hell. \n\ni would be interested if this was scripted or if it was just a shitty presented who did this to us.  if anyone else has gone. \n\ntruly curious at this point looking back.\n\n\ni ran some architecture tours in chicago in early 2000 for extra money, the script was memorized and written before hand for everyone to read, even the jokes and puns i bet the shit on the face gag was too. ",
                            "author": "10gags",
                            "created_utc": 1416281670.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cm5nwf0",
            "parent_id": "t3_2mmfrd",
            "body": "I know you said Mobile, AL but do you mean the US Space and Rocket Center in Huntsville, AL? I went there in middle school. I thought it was fun. I went on a school trip. I'm not sure I can call it a field trip because I'm from Indiana and we went over the weekend. The group of students who went were people who wanted to go so it wasn't for a class. On the trip we buddied up with someone else and that person ended up being a good friend of mine throughout high school and I still keep in touch with him (I am one year out of college). \n\nHaving said all of that can you say that your trip would have ended up the same way or better? My enjoyment was due to the school trip and buddy system that was complete luck in it's pairing of myself and my friend. I also only remember two things about the entire weekend trip, which probably totals 20 minutes. My area of study and my career do not reflect an early interest in space or rocketry. Considering all of this, it is a nice memory but I cannot say my life is enriched by the experience. I have an interest in space now but that comes from other areas such as Neil Tyson, sci fi movies, and recent scientific events.\n\nI'm not saying it sucked back then like you want me to say but apparently it wasn't that great because I don't remember all that much about it. If your interest in science is making you reflect and wish that you went (you don't really give a reason), there are ways to get similar effects. Go to the National Air and Space museum in D.C. and watch an educational film in iMAX and there's most of Space Camp right there.",
            "author": "Sythin",
            "created_utc": 1416282432.0,
            "replies": []
        },
        {
            "name": "t1_cm5nyuj",
            "parent_id": "t3_2mmfrd",
            "body": "I'm not up to writing anywhere near as in depth as /r/10gags did, but I'll give you my take.\n\nI went to Space Camp in the late 80s (88?) in Huntsville. It was boring.  You only got to do a tiny bit of what you hoped and only a few kids got to do the fun stuff (and only for a few minutes).  Spending a day walking through the museum was the best part by a large margin.  I still enjoy that when I pass through Huntsville.\n\nTo put this into perspective, I entered a trivia contest at DragonCon in the late 90s.  I tied for 2nd with two others.  The top 3 got to have a play off with the top prize being a trip to adult Space Camp.  The 4th place prize was a $50 gift certificate to a local used bookstore.  I volunteered to take 4th because I preferred the gift certificate to the trip (and the second and third prizes).",
            "author": "gonzoforpresident",
            "created_utc": 1416282568.0,
            "replies": []
        }
    ]
}