{
    "name": "t3_23iop3",
    "title": "CMV: If you go into an energetic/aggressive moshpit, you can't complain if you get hurt.",
    "body": "Too many times I go to shows and people complain about getting (accidentally) kicked or hit pushed knocked down. (Preface: These are normal punk or hardcore shows, not some weird satanic blood shows 99% of the time no one is looking to intentionally harm someone) However, in a tight area where people are pushing shoving jumping stage diving crowd surfing, you could get mildly hurt or seriously injured. That's part of the fun of it, though. Too many times people get mad at others when they get hurt, complain, say it was a shitty show because they don't know how to behave in a mosh pit. It pisses me off, but enough people do it there must be a reason behind it. \n\nI've been decently hurt in one before and I expected it. There are always the side lines where people stand and nod their heads and enjoy the music. Go there if you want to listen and be apart of the show. \n\nPart 2 of this CMV if you WANT to be apart of the aggression, GO TO THE REAL MOSH PIT don't try to start shoving and pushing the sideline people, they chose not to be apart of it and it doesn't make you look tough pushing around people standing around. \n\n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "ShasneKnasty",
    "num_comments": 14,
    "created_utc": 1398011378.0,
    "url": "http://www.reddit.com/r/changemyview/comments/23iop3/cmv_if_you_go_into_an_energeticaggressive_moshpit/",
    "comments": [
        {
            "name": "t1_cgxdmh3",
            "parent_id": "t3_23iop3",
            "body": "Could you define \"get hurt\" for me? Are we talking nosebleed, bone fractures, concussions?",
            "author": "[deleted]",
            "created_utc": 1398011856.0,
            "replies": [
                {
                    "name": "t1_cgxdsgy",
                    "parent_id": "t1_cgxdmh3",
                    "body": "The worst injury I've seen is a broken nose and a concussion, I've been to many and never seen a hospital trip or ambulance. I usually go to smaller venues however. The big events usually have EMT's about. But either way, you know those risks and it is voluntary. Usually you could get like a black eye, and bruises.   ",
                    "author": "ShasneKnasty",
                    "created_utc": 1398012257.0,
                    "replies": [
                        {
                            "name": "t1_cgxqk31",
                            "parent_id": "t1_cgxdsgy",
                            "body": "\"voluntary\" - not all pit participation is voluntary. I was at a show while recovering from back surgery (I was far enough recovered that I wasn't at serious risk from someone lightly bumping into me, but I didn't want to be in the middle of an aggressive pit for obvious reasons). I was standing to the outside of the crowd purposefully to avoid being in the pit, and was pushed into a pit by the people around me. I ended up fucking up my back and having issues walking for about a week afterwards. I did not volunteer to be in that pit, I did not stand too close to it for it to be my fault. Not everybody who finds themselves in a pit wants to be there. As well, when some asshole cold clocks you in the face (which happened to me in another pit) it stands to reason that you're going to be pissed. And I would imagine the majority of people you see whining or complaining fall into one of those two categories - over aggressive assholes pushing you into a pit, or over aggressive assholes hurting you on purpose in said pit.\n\nAnd to clarify, I have been in many pits willingly, and have enjoyed the majority of those occasions. But those are two where I was hurt, and I was pissed off about it.",
                            "author": "TmoEmp",
                            "created_utc": 1398043243.0,
                            "replies": [
                                {
                                    "name": "t1_cgxt74l",
                                    "parent_id": "t1_cgxqk31",
                                    "body": "part 2 of my CMV was that there should always be a designated area for no pit goers, so in my view you do still have the right to be mad.",
                                    "author": "ShasneKnasty",
                                    "created_utc": 1398049260.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cgxdrsd",
            "parent_id": "t3_23iop3",
            "body": "I think this would be a fair thing to say if the big, collective goal of the pit is to hurt people. ",
            "author": "[deleted]",
            "created_utc": 1398012213.0,
            "replies": [
                {
                    "name": "t1_cgxdwsn",
                    "parent_id": "t1_cgxdrsd",
                    "body": "But that isn't the goal, the goal is to feel the energy of the music with other people. The music is just usually aggressive in this context. So the injury is a secondary affect that must be considered before entering. ",
                    "author": "ShasneKnasty",
                    "created_utc": 1398012545.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cgxef5t",
            "parent_id": "t3_23iop3",
            "body": "I somewhat disagree.\n\nDifferent mosh pits have different feels and different behaviors. I've been in some very, very friendly mosh pits where everyone is having a good time and people are pushing/shoving/jumping in a way that's considerate. I've also been in some mosh pits where people were aggressively inconsiderate and seemed out not just to have a good time by shoving into people, but to do so by causing as much pain to other people as they could get away with.\n\nI love the former kind of pit. I find the latter kind of pit massively unpleasant.",
            "author": "learhpa",
            "created_utc": 1398013759.0,
            "replies": [
                {
                    "name": "t1_cgxpbpx",
                    "parent_id": "t1_cgxef5t",
                    "body": "This is an important factor I think. If it is the first time if pit you described, but there is the one guy in there acting like it's the second, I would feel justified in being upset if that one guy hurt me.\n\nIf however it was just a legitimate accident, I agree with OP. The way the other person reacts makes a big difference too. I'm a smaller guy and I've been knocked down plenty, but the guy who knocked me down has always pulled me right back up, and I've never been angry about it because I've always felt reassured because I know it wasn't malicious or intentional. ",
                    "author": "AirOutlaw7",
                    "created_utc": 1398040356.0,
                    "replies": []
                },
                {
                    "name": "t1_cgxtaif",
                    "parent_id": "t1_cgxef5t",
                    "body": "I agree, I go into both, but if I go into the intense one, I'd be OK with getting hurt. ",
                    "author": "ShasneKnasty",
                    "created_utc": 1398049480.0,
                    "replies": [
                        {
                            "name": "t1_cgxvd3r",
                            "parent_id": "t1_cgxtaif",
                            "body": "And if you encounter someone in the former kind of pit - the friendly loving one - who is acting like he is in the intense one, then it's perfectly ok to complain about him.",
                            "author": "learhpa",
                            "created_utc": 1398054528.0,
                            "replies": [
                                {
                                    "name": "t1_cgy3cpi",
                                    "parent_id": "t1_cgxvd3r",
                                    "body": "to complain about him yes, not the pit itself. These kids usually get pulled to side or get ganged up on, not in a fight way just people won't take kindly to it. ",
                                    "author": "ShasneKnasty",
                                    "created_utc": 1398089808.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cgxgt36",
            "parent_id": "t3_23iop3",
            "body": "This relies on the pit being a clearly define area that people can choose to go into or not. Last large gig I was at, a handful of moshpits started through out the crowd despite the fact that many of the people didn't want to take part. Where I was standing, a bunch of asshole teenage boys decided to try starting a really aggressive moshpit despite the fact that many of the people around (including an older lady with her 2 young teenage daughters who would have been dragged right in to it) did not want this at all.\n\nAlso it really does depend on the gig. I have ben in moshpits where nobody gets hurt and everyone has been having a great time. I have been in pits where everyone's a little over-aggressive and some people get injured. I've also been in pits where people are trying to have an energetic but non-aggressive time and 2 or 3 idiots are clearly intentionally injuring people for the fun of it.",
            "author": "clairebones",
            "created_utc": 1398019485.0,
            "replies": [
                {
                    "name": "t1_cgxlked",
                    "parent_id": "t1_cgxgt36",
                    "body": "This has been my experience as well, plenty of times mosh pits that I did not consent to be in have sprung up around me, one of which lead to me being trampled while trying to escape it.",
                    "author": "[deleted]",
                    "created_utc": 1398030946.0,
                    "replies": []
                },
                {
                    "name": "t1_cgxt9jf",
                    "parent_id": "t1_cgxgt36",
                    "body": "The other part of my view was that there should be a designated area for non moshers, I agree with the fact it's wrong to push non moshers into it. My view applies to people who go into it voluntarily. If they get dragged in, I believe they have the right to be upset. ",
                    "author": "ShasneKnasty",
                    "created_utc": 1398049418.0,
                    "replies": []
                }
            ]
        }
    ]
}