{
    "name": "t3_2ebvsg",
    "title": "CMV: In the film 500 Days of Summer it is Summer who is in the wrong",
    "body": "I'd like to preface this by saying I love Zooey Deschanal and I think her character is lovely but here actions are not. I'd also like to say tha it has nothing to do with the fact she is a girl and my point would still stand if it was JGL's character who performed these actions.\n\nFirstly, I acknowledge that Summer specifically states that she is not looking for anything serious, and that that is an honourable and appropriate thing to say at the time because she's setting the groundwork for the 'relationship' or whatever you want to call it. However, she is an intelligent character and should be fully aware of when she is shifting that groundwork. After three months it is obvious that JGL's character is in love with her and she should be somewhat aware of this. That is when Summer should reaffirm that casual nature of the relationship but instead she allows it to progress further.\n\nFurthermore, I suppose the most evident case of when she shifts the nature of the relationship is during the scene where they are back at Summer's and Summer begins to tell him some of her close kept secrets ultimately finishing with the line \"I've never told that anyone before\". This is a huge progression into the seriousness of the relationship on behalf of Summer. Indeed, I think she's basically saying that JGL's character is different. Different to anyone else Summer has been with, and significantly more serious.\n\nFast forward a few months and Summer has gone but she invites JGL to her party knowing completely the love he has for her. They get on well but then she asks him to dance in a romantic way. This of course gives JGL false hope and all the while she is aware of his feelings. She attempts to justify it by saying that she just \"wanted to\" dance, as if that is acceptable.\n\nFinally, in one of the last scenes and almost at the point where JGL has gotten over Summer she returns at their bench just to say hello. She surely knows the implications of seeing him so soon after the wedding and yet she still goes potentially restarting JGL's sadness.\n\nI suppose what I'm trying to say is that her actions knowingly pushed, or allowed, the relationship into something more seriousness (even if she didn't explicitly verbalise it) and just because she stated her intentions at the beginning does not mean she got a get-out clause.\n\nAt this point I'd like to acknowledge that in the third act of the film JGL's character is being selfish but that doesn't justify Summer's actions.\n\nPlease, change my view.\n\nOn a side note: who marries a guy after meeting them eight weeks beforehand in a coffee shop?\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "Slicy_McGimpFag",
    "num_comments": 13,
    "created_utc": 1408756407.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2ebvsg/cmv_in_the_film_500_days_of_summer_it_is_summer/",
    "comments": [
        {
            "name": "t1_cjy1zku",
            "parent_id": "t3_2ebvsg",
            "body": "Your entire post is based on the assumption that summer *knows for sure* that he is in love with her, What she \"surely\" knows, etc.\n\nI really don't see any proof that she does.\n\nShe said at the beginning it wasn't serious. Her intentions were spelled out, levitt's character *did actually* know this. The fact that he wanted more is irrelevant to whether summer was wrong.",
            "author": "[deleted]",
            "created_utc": 1408762435.0,
            "replies": [
                {
                    "name": "t1_cjy72s1",
                    "parent_id": "t1_cjy1zku",
                    "body": "&gt; Tom Hansen of Margate, New Jersey, grew up believing that he'd never truly be happy until the day he met the one.       \n\nHe is established right from the beginning as someone who invests way too much in relationships because of this false idea that love and happiness only exist together. It did not matter that Summer said that she just wanted a FWB, he wanted more and was trying from the beginning to make it more.          \n\nIt is not Summer's fault that he fell in love. It is not Summer's fault that he idealized her as the one. She wanted Tom to be his friend. Even after they broke off, she attempted to be friends, and he foolishly read it as a chance to win her back.     \n\nThe only thing she is really guilty of is wanting to be friends with Tom. Unfortunately for him, that wasn't enough.  ",
                    "author": "GoldandBlue",
                    "created_utc": 1408779085.0,
                    "replies": [
                        {
                            "name": "t1_cjy73pb",
                            "parent_id": "t1_cjy72s1",
                            "body": "That still doesn't change that there was nothing indicating that she knew for sure though.",
                            "author": "CraigTheDolphin",
                            "created_utc": 1408779216.0,
                            "replies": [
                                {
                                    "name": "t1_cjy75z8",
                                    "parent_id": "t1_cjy73pb",
                                    "body": "Whoops, I was trying to reply directly not to a comment. ",
                                    "author": "GoldandBlue",
                                    "created_utc": 1408779533.0,
                                    "replies": [
                                        {
                                            "name": "t1_cjy865a",
                                            "parent_id": "t1_cjy75z8",
                                            "body": "Oh, that makes sense then haha",
                                            "author": "CraigTheDolphin",
                                            "created_utc": 1408785201.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cjy2u6j",
            "parent_id": "t3_2ebvsg",
            "body": "Why can't they both be at fault?\n\nBoth of them decided to start the relationship initially. Both knew that the other had a completely different philosophy on dating. Summer is at fault for getting involved with someone who she knew wanted a serious relationship when she didn't. JGL's character is at fault for getting involved with someone who he knew didn't want a serious relationship when he did.\n\nThat's the fundamental flaw that doomed their relationship from the beginning, and they're both to blame for ignoring that obvious fact. You could make a reasonable case that Summer is more to blame and does more bad things than JGL's character, but they're both at fault for the relationship failing. \n\n(I also think your interpretation of Summer's actions is a bit off and would happily explain that in another post if you want, but it isn't relevant to my argument about whether JGL deserves some blame for how things ended.)",
            "author": "eff_horses",
            "created_utc": 1408764607.0,
            "replies": [
                {
                    "name": "t1_cjydv04",
                    "parent_id": "t1_cjy2u6j",
                    "body": "Hmm, I think you might be right. I don't acknowledge that Summer was not in the wrong but I do acknowledge that it can be argued that both are equally at fault.\n\n&amp;#8710;\n",
                    "author": "Slicy_McGimpFag",
                    "created_utc": 1408809304.0,
                    "replies": [
                        {
                            "name": "t1_cjyf146",
                            "parent_id": "t1_cjydv04",
                            "body": "Confirmed: 1 delta awarded to /u/eff_horses. ^[[History](/r/changemyview/wiki/user/eff_horses)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][[Subreddit](http://www.reddit.com/r/DeltaBot/)]",
                            "author": "DeltaBot",
                            "created_utc": 1408812315.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cjy4wyv",
            "parent_id": "t3_2ebvsg",
            "body": "Your argument is based on her having complete control over her emotions and requires her to act with utmost care to protect the feelings of others.\n\nHowever, based on that standard, JGL would be at fault as well.\n\nThere's every reason to believe that she did develop feelings for JGL's character, that she did begin to care for him very deeply. However, *she didn't want to have a relationship like that*, so when she realized things had gotten more serious than she wanted, she broke it off. Putting the burden entirely on her to limit the relationship is unfair to her and treats JGL like a child who needs to be protected rather than face the risks of a relationship.",
            "author": "anon__sequitur",
            "created_utc": 1408770554.0,
            "replies": []
        },
        {
            "name": "t1_cjy59n0",
            "parent_id": "t3_2ebvsg",
            "body": "Tom (JGL's character) wanted a girlfriend. Summer wanted a FWB with no strings attached. Tom knew this but dated summer anyway because he though \"Well, maybe if we spend some time together, she will change her mind about me and we will stay together forever.\" Summer didn't change her mind and decided to break it off when she wanted to find someone to commit to, and Tom, now with his heart broken, pits all the blame on her, until he figures out at the end of the film \"She's happy, and I can always find someone else and move on.\"\n\nIt's a good moral. They are both wrong, and they are both right.\n\nI don't like the idea of FWB relationships, but it's wrong of Tom to assume that he can change Summer's mind when she was clear from the beginning that they are 'just friends who have sex sometimes.' Maybe if Tom was honest to her, things might have turned out differently, but the story we have is what we have.",
            "author": "samuentaga",
            "created_utc": 1408771711.0,
            "replies": [
                {
                    "name": "t1_cjy9w7i",
                    "parent_id": "t1_cjy59n0",
                    "body": "I understand your point, however I would argue not only did Summer allow the relationship to progress into a serious relationship from a FWB relationship, but she actively pursued it such as was the case when she told Tom all her secrets. She should have realised the difference she was making in that and subsequent scenes and stopped the relationship long before.\n\nI absolutely agree that both are partly at blame, but I think Summer behaved worse by stating her intentions and then going back on them, before returning to them when it was too late.",
                    "author": "Slicy_McGimpFag",
                    "created_utc": 1408795844.0,
                    "replies": [
                        {
                            "name": "t1_cjydcmp",
                            "parent_id": "t1_cjy9w7i",
                            "body": "You can tell non-romantic friends your secrets. Telling secrets isn't the basis of a romantic relationship.\n\n&gt;I absolutely agree that both are partly at blame, but I think Summer behaved worse by stating her intentions and then going back on them, before returning to them when it was too late.\n\nTom and Summer both started the relationship thinking they would just be friends. You seem to be accepting that Tom struggled with wanting more from the relationship but don't accept that Summer may have been struggling with wanting more too? What if her emotions drew her to wanting a closer relationship with Tom and that is why she went back on them? Why is it okay for Tom to say he's okay with nothing and then want more but not okay for Summer to say she wants nothing but then want more and then shaking off those feelings and not wanting more?",
                            "author": "gaviidae",
                            "created_utc": 1408807959.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cjy5lcj",
            "parent_id": "t3_2ebvsg",
            "body": "Like you said, Summer was very up front with what she wanted. Their relationship was formed based off of them being a casual thing. Tom agreed to this. However, it's Tom's emotions and Tom's needs from the relationship that changed, not Summer's. Summer can't know 100% what Tom feels or what he wants, and as such I feel that it's Tom's responsibility to acknowledge that his feelings have changed and either  break it off or ask if she wants to change their relationship (with the understanding she could say know). \n\nSummer wasn't perfect, by any means (which is part of the point of the movie, but hey), but since his feelings and expectations are what changed the onus is on Tom to decide how to go forward with those. ",
            "author": "proserpinax",
            "created_utc": 1408772823.0,
            "replies": []
        }
    ]
}