{
    "name": "t3_2ho8k5",
    "title": "CMV: Batman straight up kills people",
    "body": "Pretty simple. Basically [this video](https://www.youtube.com/watch?v=1byycwl8qgc) makes a perfect point. Batman might think he is not killing people, but he is straight up killing lots of people. If you knock someone out and they don't wake up in a few minutes, then you have done serious damage and they very well could die. If you are running around with sharp metal weapons and ninja stars, you are going to kill people. If you are smashing through walls with rockets and driving through shopping centres on a motorbike you are going to cause some casualties eventually.\n\nIn the Arkam games Batman is frequently seen bashing the heads in of people with a metal pipe. How is that not killing them?\n\nIn DKR Batman organizes a mass assault on Bane, knowing the police are using guns, and Bane's troops are using guns, which leads to a lot of deaths. If Batman were to say that he didn't kill these people, it would be like a General ordering troops to fire on an enemy, and when that enemy is killed, saying he had nothing to do with it.\n\nIn Batman begins, Batman had every intention of having Gordon blow up the train tower which would cause the train to crash, and every intention of leaving Ra's al Ghul there to die. He said he wasn't killing him, he just wasn't saving him. That's just the same as Batman pulling the trigger on a gun and saying \"I am not killing you, the bullet is\". He made the plan, and executed it, knowing Ra's al Ghul would die.\n\nBatman kills people. CMV\n\n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "scruntly",
    "num_comments": 17,
    "created_utc": 1411877674.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2ho8k5/cmv_batman_straight_up_kills_people/",
    "comments": [
        {
            "name": "t1_ckuh8hs",
            "parent_id": "t3_2ho8k5",
            "body": "&gt; Pretty simple. Basically this video makes a perfect point. Batman might think he is not killing people, but he is straight up killing lots of people. If you knock someone out and they don't wake up in a few minutes, then you have done serious damage and they very well could die. If you are running around with sharp metal weapons and ninja stars, you are going to kill people. If you are smashing through walls with rockets and driving through shopping centres on a motorbike you are going to cause some casualties eventually. In the Arkam games Batman is frequently seen bashing the heads in of people with a metal pipe. How is that not killing them?\n\nPeople in the DC universe are absurdly resilent. Criminals are regularly thrown through windows and walls without any lasting harm. Ordinary civilians and bystanders can jump higher, run faster, and take more punishment than a normal human would be able to. For instance, Batman, an ordinary human at peak physical health, runs faster than Usain Bolt, regularly lifts more than the human world record, and recovers from injuries faster than should be humanly possible. The DC human brain is probably more shock-resistant than a normal human brain.\n\n&gt; In DKR Batman organizes a mass assault on Bane, knowing the police are using guns, and Bane's troops are using guns, which leads to a lot of deaths. If Batman were to say that he didn't kill these people, it would be like a General ordering troops to fire on an enemy, and when that enemy is killed, saying he had nothing to do with it.\nIn Batman begins, Batman had every intention of having Gordon blow up the train tower which would cause the train to crash, and every intention of leaving Ra's al Ghul there to die. He said he wasn't killing him, he just wasn't saving him. That's just the same as Batman pulling the trigger on a gun and saying \"I am not killing you, the bullet is\". He made the plan, and executed it, knowing Ra's al Ghul would die.\n\nYou forget the point of Batman's no-kill rule. It isn't an arbitrary requirement he throws on himself for no reason. The no-kill rule is simply to hold himself back in the absence of public accountability, legal restrictions, or responsible partners (Robin is a kid. He doesn't count). When the cops fought Bane or when Gordon blew up the train tower, there were other people in the plot to ensure that Batman wasn't murdering out of petty revenge. The Batman can only kill out of absolute self-defense or under the eye of others to prevent himself from being the next Two-Face, Rorschach, or Ozymandias. \n",
            "author": "NuclearStudent",
            "created_utc": 1411878537.0,
            "replies": [
                {
                    "name": "t1_ckuhk6o",
                    "parent_id": "t1_ckuh8hs",
                    "body": "Ok well the DC universe argument makes sense. It's fantasy so in that world the normal laws of physics or biology don't apply.\n\nBut on your second point, I still don't agree. Take specifically the train tower situation. Batman told Gordon what to do, and fought  Ra's al Ghul in the train, leaving him there to die. To my mind, Batman killed Ra's al Ghul. Having other people involved doesn't change that or even change the fact that it could be petty revenge. If I hire a hitman out of petty revenge, I have still killed the person. They died because of my plan. To me in this scenario to say Batman didn't kill Ra's al Ghul is like saying that the killer in the Saw movies didn't kill anyone. He did. Batman hatched a plan which would directly result in the death of Ra's al Ghul. He knew it would. And then he carried out that plan, killing him.",
                    "author": "scruntly",
                    "created_utc": 1411879495.0,
                    "replies": [
                        {
                            "name": "t1_ckuhnyz",
                            "parent_id": "t1_ckuhk6o",
                            "body": "&gt; But on your second point, I still don't agree. Take specifically the train tower situation. Batman told Gordon what to do, and fought Ra's al Ghul in the train, leaving him there to die. To my mind, Batman killed Ra's al Ghul. Having other people involved doesn't change that or even change the fact that it could be petty revenge. If I hire a hitman out of petty revenge, I have still killed the person. They died because of my plan. To me in this scenario to say Batman didn't kill Ra's al Ghul is like saying that the killer in the Saw movies didn't kill anyone. He did. Batman hatched a plan which would directly result in the death of Ra's al Ghul. He knew it would. And then he carried out that plan, killing him.\n\nThe difference is that Gordon is an independent person who would have spoken up if he had believed Batman was in the wrong. In contrast, a hitman wouldn't have done a thing if he believed that Ra's al Ghul didn't deserve to die. \"No-kill\" simply means \"don't kill people unless you've got a second opinion and can avoid crossing the psychological barrier of direct murder.\"",
                            "author": "NuclearStudent",
                            "created_utc": 1411879818.0,
                            "replies": [
                                {
                                    "name": "t1_ckuhqup",
                                    "parent_id": "t1_ckuhnyz",
                                    "body": "So he does kill then? Just in very specific circumstances?",
                                    "author": "scruntly",
                                    "created_utc": 1411880064.0,
                                    "replies": [
                                        {
                                            "name": "t1_ckuhr8k",
                                            "parent_id": "t1_ckuhqup",
                                            "body": "Yes. He doesn't straight up kill people, he does it indirectly in very specific ways. ",
                                            "author": "NuclearStudent",
                                            "created_utc": 1411880097.0,
                                            "replies": []
                                        },
                                        {
                                            "name": "t1_ckujvor",
                                            "parent_id": "t1_ckuhqup",
                                            "body": "Batman doesn't murder but he's cool with manslaughter.",
                                            "author": "MisanthropeX",
                                            "created_utc": 1411888434.0,
                                            "replies": []
                                        },
                                        {
                                            "name": "t1_ckuosz7",
                                            "parent_id": "t1_ckuhqup",
                                            "body": " I'll start by saying Batman's plan didn't necessarily involve Ra's Al Ghul being on the train-- that is Batman didn't know Ra's would be there. Ra's Al Ghul also deliberately sabotaged the train's accelerator to keep Batman from stopping it prior to it reaching the point where Gordon had collapsed the elevated track. \n\n &gt;In DKR Batman organizes a mass assault on Bane, knowing the police are using guns, and Bane's troops are using guns, which leads to a lot of deaths. If Batman were to say that he didn't kill these people, it would be like a General ordering troops to fire on an enemy, and when that enemy is killed, saying he had nothing to do with it. \n\n Batman's no-kill rule is for himself. I don't know why you specifically use TDKR as you could argue Batman should be actively protesting Gordon and the GPD using guns across all the his media when he works with the police. But! Again, Batman's not a self-righteous prick about his **personal** code. \n\n ",
                                            "author": "astrangefish",
                                            "created_utc": 1411913843.0,
                                            "replies": [
                                                {
                                                    "name": "t1_ckuqadl",
                                                    "parent_id": "t1_ckuosz7",
                                                    "body": "&gt;  But! Again, Batman's not a self-righteous prick about his personal code. \n\nWhat? There's specifically a scene in Dark Knight where he says \"No Guns\". \n\nhttp://wac.450f.edgecastcdn.net/80450F/comicsalliance.com/files/2013/01/guns01.jpg\n\nAlso I think with something as profound as a no kill policy, he would be more \"self-righteous\" (which IMO is a terrible term to use to describe something like this) about it. And he is. ",
                                                    "author": "howbigis1gb",
                                                    "created_utc": 1411918176.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_ckuqi1g",
                                                            "parent_id": "t1_ckuqadl",
                                                            "body": " That's true! \n\n But that's in an instance where he is personally working side-by-side with a *vigilante* of similar physical skill. The police are lawfully authorized to use guns in the line of duty. Notice he never tells Gordon he can't use his gun. \n\n ",
                                                            "author": "astrangefish",
                                                            "created_utc": 1411918744.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_ckuqn0l",
                                                                    "parent_id": "t1_ckuqi1g",
                                                                    "body": "However he does in many cases stop the Gotham police from killing many of his rogues. \n\n",
                                                                    "author": "howbigis1gb",
                                                                    "created_utc": 1411919102.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_ckuqtwr",
                                                                            "parent_id": "t1_ckuqn0l",
                                                                            "body": " Examples? Was Batman trying to stop the police in question from pulling a Ferguson, Missouri?",
                                                                            "author": "astrangefish",
                                                                            "created_utc": 1411919597.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_ckurb23",
                                                                                    "parent_id": "t1_ckuqtwr",
                                                                                    "body": "I can't recall specific instances, but I do remember him putting himself in harm's way to save his rogues from police action. \n\nI'll see if I can pull up some scans/clips",
                                                                                    "author": "howbigis1gb",
                                                                                    "created_utc": 1411920779.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_ckuo2jw",
                                    "parent_id": "t1_ckuhnyz",
                                    "body": "WARNING: CONTAINS POSSIBLE SPOILERS TO THE BATMAN: HUSH STORYLINE\n\n&gt;Gordon is an independent person who would have spoken up if he had believed Batman was in the wrong.\n\nA very good point, and he shows that in the *Hush* story arc. Batman thinks the Joker has murdered his childhood friend, and beats him nearly to death. Before he can kill him though, Gordon confronts him and informs him that if he kills the Joker, Gordon will consider it murder and prosecute Batman to the full extent of the law, resulting in Batman letting the Joker live. Part of what makes Gordon such a good character is that he acknowledges that the world isn't black and white, that there are grey areas where good and bad are harder to distinguish; but at the same time he does have limits to what he considers a lesser of two evils.",
                                    "author": "the_jiujitsu_kid",
                                    "created_utc": 1411911224.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "name": "t1_ckvjrwg",
                            "parent_id": "t1_ckuhk6o",
                            "body": "Gordon is the police Comissioner.  If he's down with killing someone on purpose, then that's as above-board as things can manage to be in Gotham.",
                            "author": "Diabolico",
                            "created_utc": 1411999811.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ckunpl4",
            "parent_id": "t3_2ho8k5",
            "body": "I took Ra's al Ghul's death symbolically. He was the leader of an organization that trained in stealth and agility, so I think that he could have escaped the train if he really wanted to. However, he realized that his plan to destroy Gotham had failed and that there would be no point in escaping, because he would live in shame as an exile. I think that he also realized that his belief in justice being about revenge had failed him: It didn't bring back his wife, and he betrayed his student and friend when he left Bruce for dead.",
            "author": "[deleted]",
            "created_utc": 1411909805.0,
            "replies": []
        },
        {
            "name": "t1_ckuq57v",
            "parent_id": "t3_2ho8k5",
            "body": "Well - I think it is documented fact that Batman does kill, so I don't know if this is a true CMV. \n\nHere is a panel of Batman killing (or at least trying to kill - I don't recollect) Darkseid\n\nhttp://static.comicvine.com/uploads/original/11112/111127359/3867374-1.2.jpg\n\nPlus - here's a Cracked article about other times. \n\nhttp://www.cracked.com/article_20111_the-6-most-brutal-murders-committed-by-batman_p2.html\n\nEdit: Here's an interesting essay on his relationship with guns\n\nhttp://comicsalliance.com/batman-guns-gun-culture/",
            "author": "howbigis1gb",
            "created_utc": 1411917797.0,
            "replies": []
        },
        {
            "name": "t1_ckuwqi8",
            "parent_id": "t3_2ho8k5",
            "body": "Batman from the Dark Knight Trilogy is pretty terrible. He definitely kills Harvey, and, from any reasonable perspective, kills Ra's as well. To an extent, he also causes Talia to die in a car accident. He also has no qualms about Catwoman killing Bane.\n\nIn summary, Nolan-Bats is a pretty bad example of Batman. The rest of your argument can proceed with the more canonical Batmen. ",
            "author": "tidier",
            "created_utc": 1411931958.0,
            "replies": []
        }
    ]
}