{
    "name": "t3_242qn0",
    "title": "CMV: I victim blame the guy who got raped in the linked thread",
    "body": "[Here ](http://www.reddit.com/r/sex/comments/2423ao/i_was_raped_last_night_im_engaged_im_a_man/) is the thread I'm talking about.  A man was raped by an old flame.  Please see the story for full details.\n\nI think he should be personally should feel **somewhat** to blame for the situation.  I don't think he should've showed such lack of discipline towards alcohol when he knew explicitly there was an old flame who was into him.\n\nI feel like I'm in the wrong here to blame him at all.  I think the answer probably has something to do with the logistics of victim-blaming and why that's wrong.  I could also be convinced that the alcohol makes it not his fault.  I think the root of my inability to see him as blameless comes from how similar the individual seems to myself as a male near his age.  I would hold myself accountable **to a degree** in his situation.  \n\nWith that said, it's real shitty what happened to him, and the lady involved deserves 94.5% of the blame, as well as some kind of litigation if possible.  I apologize for slow responses, but it is kind of late here and this is a serious topic, so I would like to try to think through my responses entirely.  \n\nPlease, CMV!\n\nEdit 3:  sheep74 was the final straw that won me over.  While I would personally blame myself in the situation, I am in no place to judge and owe him the benefit of the doubt, the same as I would with anyone else.  Thanks for the good responses from everyone.  sheep74 just happened to be the final response that clicked\n\nEdit:  Description is gone in that other link, sorry.  If anyone has it for reposting, that would be cool.  I apologize if I make any inaccurate claims about the story now that it's gone.\n\nEdit2:  Original text below.  Thanks Shaabaaab for providing it again:\n\n\"Since the original text is deleted, here's the text form the original post:\nThrowaway account.\nFirst of all, I am a 24 year old male, engaged to my girlfriend (now fiance) of 6 years. We are in a great place and are getting married in October.\nLast night I went to my best friend's birthday party. My fiance is out of town til Tuesday. I arrived around 1030pm after pre-gaming with two other friends, so when I arrived I was pretty sloshed. I remember arriving.\nI also remember running into a girl, we'll call Mandy, I had known in high school. We had dated briefly and she was my first blowjob back then. Anyway. We caught up and all that, and I remember her being particularly flirty. I told her I was engaged and even showed her pictures of my fiance. Then, I went about my night. I remember my best friend pulling me aside and told me that Mandy was wanting to hook up with me, and was overly flirty. I was honestly pretty oblivious of her advances.\nAnyway, I kept drinking. Took several shots of Southern Comfort, and eventually blacked out. The only thing I remember after that is a quick flash of me vomiting out in the back yard. But something else happened.\nMy best friend said he walked upstairs to grab a towel, because someone had thrown up in his kitchen. When he opened the door, apparently Mandy was giving me a blowjob. I was apparently just lying there, looked like I was asleep. In his drunken state, he didn't think much of it, so he shut the door.\nI woke up the next morning around 7am, alone. My pants were completely off, and I still had my shirt on. I found out later from my best friend he overheard Mandy on her way out telling someone we had sex. I was completely blacked out, probably even passed out. I was definitely raped.\nI don't know what to tell my fiance. I'm trying to keep it under wraps. I'm afraid she won't believe I was raped. What do I do?\nTL;DR I was raped by an old flame at my friend's party. I have a fiance and I'm afraid of telling her in fear she won't believe me.\nEdit 1: Just called my fiance, told her I had something I wanted to talk to her about and not to worry. I just didn't want to pretend everything was normal til Tuesday. She is coming home early and will be back tomorrow evening. I've worried her, and now I'm even more afraid to tell her...\nEdit 2: Thank you everyone for your support. I'm still incredibly worried about telling my fiance. But it's gotta happen. I will post an update tomorrow night if I can. Honestly, I'm more worried about losing my love than I am hurt that it happened. I don't think I will need counseling, I'm a pretty level headed and rational person. NOT that people who do need counseling aren't! Just for me, personally, I don't think it would help much. Just a personal preference. Everybody copes differently.\nEdit 3: I just talk to my best friend. We both agree, it definitely appears I was raped. He says the more he think about it, the more he thought I was asleep or passed out when she was blowing me. He apologized for not stopping it, but was so drunk he just didn't think anything of it. He's willing to talk to my fiance is she needs proof. Also he is going to try and talk to Mandy soon. He's just thinking of a way to do it tactfully. I will also update with how that goes.\"\n \n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "rocaterra",
    "num_comments": 58,
    "created_utc": 1398565366.0,
    "url": "http://www.reddit.com/r/changemyview/comments/242qn0/cmv_i_victim_blame_the_guy_who_got_raped_in_the/",
    "comments": [
        {
            "name": "t1_ch30mms",
            "parent_id": "t3_242qn0",
            "body": "If the genders were reversed would you feel the same way? OP as a woman with a man performing oral sex on her and later having intercourse?",
            "author": "fanningmace",
            "created_utc": 1398566313.0,
            "replies": [
                {
                    "name": "t1_ch3110x",
                    "parent_id": "t1_ch30mms",
                    "body": "Mhm good point.  I would like to think I wouldn't blame the woman at all, but I'm not sure if I would without acknowledging it to myself.\n\nI guess it's like I hold myself to a certain standard of cautiousness.  I'm under the belief me and the other poster are similar enough for me to apply these same standards to him.  In the event of uncertainty and inability to relate, I opt with the other party.  Connecting this to that, if a women had the same story, I'd like to think I wouldn't blame her at all because it's a situation I'm incapable of understanding fully and thus she gets credit, sympathy, and zero blame.  \n\nI haven't wrapped myself around it yet, but I could see how I'm false in assuming he's similar enough for me to apply my standards to.",
                    "author": "rocaterra",
                    "created_utc": 1398567391.0,
                    "replies": [
                        {
                            "name": "t1_ch33462",
                            "parent_id": "t1_ch3110x",
                            "body": "Are you saying you would blame the woman as you are blaming the man?",
                            "author": "santa_cloud",
                            "created_utc": 1398573084.0,
                            "replies": [
                                {
                                    "name": "t1_ch33863",
                                    "parent_id": "t1_ch33462",
                                    "body": "I'm saying I would not blame her because I cannot accurately interpret her situation and will therefore default to her point of view being correct.\n\nHowever based on my blame for the man in this post, I wonder if I would blame the women subconsciously and that's part of why my view should be analyzed.",
                                    "author": "rocaterra",
                                    "created_utc": 1398573391.0,
                                    "replies": [
                                        {
                                            "name": "t1_ch33aph",
                                            "parent_id": "t1_ch33863",
                                            "body": "That was part of the question; the situation is exactly the same but the genders are reversed.",
                                            "author": "santa_cloud",
                                            "created_utc": 1398573584.0,
                                            "replies": [
                                                {
                                                    "name": "t1_ch33kj1",
                                                    "parent_id": "t1_ch33aph",
                                                    "body": "Still no.  I'm not in a place to understand the situation of a women well enough so I would default to not blaming her.  Same would be the case if it was a person equally different to myself.  With OP I feel (incorrect or not) similar enough to interpret his actions.",
                                                    "author": "rocaterra",
                                                    "created_utc": 1398574355.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_ch33si6",
                                                            "parent_id": "t1_ch33kj1",
                                                            "body": "Why not?  Why do you have a double standard on who to blame?  They both did the exact same thing, why does one get blamed and the other no?",
                                                            "author": "santa_cloud",
                                                            "created_utc": 1398575038.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_ch33yi9",
                                                                    "parent_id": "t1_ch33si6",
                                                                    "body": "I'll have to disagree with you on doing the exact same thing.  The end result may be similar, but that does not account for what happens before and after the fact.\n\nI can assess what happens to a certain degree to the male in the story because I'm about the same age and have drank while in a relationship.  \n\nI would similarly not be able to blame say a male getting more than he wanted in an S&amp;M situation simply because I don't know enough to properly assess that situation.  I think (perhaps wrongly) that I know enough to assess the situation at hand and place a small fraction of blame.",
                                                                    "author": "rocaterra",
                                                                    "created_utc": 1398575570.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_ch33zyh",
                                                                            "parent_id": "t1_ch33yi9",
                                                                            "body": "**The entire premise of the question is that they did the exact same thing.**",
                                                                            "author": "santa_cloud",
                                                                            "created_utc": 1398575702.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_ch34273",
                                                                                    "parent_id": "t1_ch33zyh",
                                                                                    "body": "Alright, I guess what I was getting that is I don't believe there can be a comparable situation.  Or at least there cannot be two parallel situations that I can put myself into the shoes of.  I can't put myself in the hypothetical girl's shoes.",
                                                                                    "author": "rocaterra",
                                                                                    "created_utc": 1398575905.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ch30sac",
            "parent_id": "t3_242qn0",
            "body": "You should be allowed to expect other people not to rape you. It's pretty much as simple as that. He got wildly drunk under this perfectly reasonable expectation, and the fact that this expectation was not met is entirely the fault of the old flame. \n\nFurthermore, he tried to show the old flame that he was not interested: he went so far as to show her pictures of his fiancee. If anyone should have refrained from alcohol, it was the old flame, as perhaps she knew that were she to be drunk and find him compromised, she would have a difficult time resisting taken advantage. But that's all on her, not on him. \n\nOne way to think about it is the example of people who wear clothes that can be called provocative. Even if this does increase the likelihood that they'll be raped (I don't know whether it does or not), they are not to blame in the least if they are raped. It's the same situation here: increasing the likelihood that you'll be raped does not make you at fault. Would you say someone walking around a dangerous area was to blame for being murdered? ",
            "author": "[deleted]",
            "created_utc": 1398566729.0,
            "replies": [
                {
                    "name": "t1_ch31a6l",
                    "parent_id": "t1_ch30sac",
                    "body": "Thought out response, thank you.  You raise a lot of very good points.  \n\nI'm having trouble pinning how much should be blamed on the old flame.  If she was partying with the secondary intention of banging the OP, is it her fault when he (dubiously) consents later on in the night.  I'm aware that legally this is not content, but should she stop drinking because he is in a relationship?  \n\nIf I were to wake up in somebody else's bed I'm thinking \"man I shouldn't have overdone it\" not \"that person I slept with shouldn't have overdone it.\"\n\nI will continue to think on your response though.  My view has certainly been shifted, but I need time to take it all in.",
                    "author": "rocaterra",
                    "created_utc": 1398568075.0,
                    "replies": [
                        {
                            "name": "t1_ch32zj8",
                            "parent_id": "t1_ch31a6l",
                            "body": "As I read it, the OP did not consent even when drunk. Those the consent is dubious not just because of the alcohol involved but also because I think there might not have been any consent whatsoever. \n\nFurthermore, on Mandy's part, if she's partying with the secondary intention of banging the OP even after he's made it completely clear while relatively sober that he does not want to have sex with her, she is entirely to blame. The OP's lack of consent was not just implied (through an absence of active consent) but actually explicit. Now it's possible that Mandy was drinking with no intention of banging the OP but that after enough alcohol, she couldn't control herself even though she expected she would be able to. Then perhaps she's not entirely to blame, but any residual blame goes to the alcohol rather than to the OP. \n\nNow, if you were to wake up in someone's bed after you had told that person explicitly while sober, \"I don't want to have sex with you,\" would you still be blaming yourself? Especially given that the other person initiated the act and you were too out of it to really do anything to prevent it? ",
                            "author": "[deleted]",
                            "created_utc": 1398572734.0,
                            "replies": [
                                {
                                    "name": "t1_ch33ioi",
                                    "parent_id": "t1_ch32zj8",
                                    "body": "Since the text is back up, I can disagree with you that he didn't make it clear that he didn't want to bang.  He showed pictures of his fiance, but hey.  A lot of people are sleazy.  I don't think a definitive \"no\" or \"back off\" was stated.\n\nIt was possibly implied, but nevertheless not on Mandy to have picked it up- as far as we can deduce from the story",
                                    "author": "rocaterra",
                                    "created_utc": 1398574201.0,
                                    "replies": [
                                        {
                                            "name": "t1_ch36a9d",
                                            "parent_id": "t1_ch33ioi",
                                            "body": "The problem here is that he definitely did not say \"yes, have sex with me\" under the definition of informed consent; if you aren't cognizant enough to remember what happened, you aren't cognizant enough to give consent. Even if he had said \"yes\" while blacked out, he didn't have the ability to consent. If you aren't in a state to know where you are and who with because you're that gone... you see what I'm getting at?",
                                            "author": "Mavericgamer",
                                            "created_utc": 1398585290.0,
                                            "replies": [
                                                {
                                                    "name": "t1_ch3dre4",
                                                    "parent_id": "t1_ch36a9d",
                                                    "body": "I do, but it seems flawed to look at it from solely his point of view.  You're assuming Mandy was perfectly cognizant enough to analyze what level of drunk he was.  Because he nor I am able to identify, it seems wrong to default blame entirely onto someone else.",
                                                    "author": "rocaterra",
                                                    "created_utc": 1398617061.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_ch3gnvh",
                                                            "parent_id": "t1_ch3dre4",
                                                            "body": "essentially it boils down to this.\n\nBoth parties talk while at a reasonable level of sobriety. At this point it's clear that one of them wants to bang (A) and one doesn't (B). At this point it's unreasonable for B to assume there's any danger, they are in control of their own decisions, they have rejected flirtation and they are in safe and comfortable surroundings. They also aren't going to assume that A needs to hear a clear 'no i will not have sex with you tonight' in order to avoid sex. Do you say that to everyone you meet just in case they get confused and think you want it? No, consent needs to be enthusiastic. For A to have any defense, B would have at one point need to actively engage in the idea of banging which clearly didn't happen. \n\nLater B is so drunk that they black out. At this point, and even before, people are unable to consent to sex. Even if they say yes, it doesn't count because alcohol. At this point if anyone has sex with B it's pretty much rape (unless you get into the confusing situation where the other person was as drunk and both parties were fully involved in the act)\n\nA is possibly also drunk, but clearly able to still move around. A friend, C, witnesses B pretty much passed out and unresponsive while A performs oral sex. It is clear that this is not a reciprocal session. \n\nAt this point it's pretty clear that A is more sober than B. B even seems unable to drunkenly consent. A had already asserted their intentions, and B theirs. They conflicted yet A has ignored this.\n\nFurther evidence is that, while B wakes up unable to form words or thoughts, A is already up and driving. This indicates enough disparity between their drunkeness that A is entirely culpable for what happened.\n\nMaybe if sober A wouldn't have done it. But do we excuse men who hit their wives only when drunk? Or people who murder under the influence of crazy drugs? No, A's state does not impact the fact they committed a crime.\n",
                                                            "author": "sheep74",
                                                            "created_utc": 1398623874.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_ch3j8fo",
                                                                    "parent_id": "t1_ch3gnvh",
                                                                    "body": "Friend C *thought* friend B was passed out.  Unless he got a close look, that's what drunken, late night blowjobs look like.  \n\nI don't think the getting up and driving is concrete evidence.  Everyone is effected differently in regards to how they feel the next morning.  Did they eat beforehand?  Were they drinking water?  I don't get hangovers unless I drink A LOT.  I don't think this argument holds water.   \n\nI do not think it was clear friend A was more sober than friend B.  Narrator A gives no indication of her state other than that she drove the next morning, as I addressed my opinion on.  \n\nYou give evidence, but I don't believe it definitively adds up enough to equate to proof.  Proof for himself, the law, or us as observers.  And without said proof, it is wrong for him to dump complete blame onto friend B.  ",
                                                                    "author": "rocaterra",
                                                                    "created_utc": 1398629677.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_ch3jfff",
                                                                            "parent_id": "t1_ch3j8fo",
                                                                            "body": "i think you got the As and Bs muddled up about halfway through.\n\nfor it to not have been rape - and i believe that the fault of rape lies entirely with rapist. Person B would have either needed to give sober enthusiastic consent,which they didn't; or A and B to be equally drunk and equally participatory. \n\nFrom this account, which is all OP is using, it sounds very, very unlikely that person B was participating at all. So from this account, which again is all we have, it seems pretty cut and dry that the rape is 100% on person A. \n\nobviously this account may not be the whole story. Maybe when both A and B were drunk a mutual banging occurred and B's alcohol processing was sufficiently different from As to leave them in a completely different state the next morning.\n\nBut from this account, that's purely speculation, from this account there is no evidence that person B is at all to blame, or responsible, for the events. ",
                                                                            "author": "sheep74",
                                                                            "created_utc": 1398630118.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_ch3kgyz",
                                                                                    "parent_id": "t1_ch3jfff",
                                                                                    "body": "I think I did, sorry.  \n\nI appreciate that you acknowledge the ambiguity, and still bring it around to being out of his control.  \n\nWhile I would blame myself if I was in that guy's position, it's not my place to fairly judge and thus I should give him the benefit of the doubt.  Even if I'm able to understand his situation better, I'm still not able to enough to do so fairly.  &amp;#8710;\n\nLots of other great responses that brought me to this point, but I think this is the one that finished the job.",
                                                                                    "author": "rocaterra",
                                                                                    "created_utc": 1398632442.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "name": "t1_ch3m71x",
                                                            "parent_id": "t1_ch3dre4",
                                                            "body": "So if Mandy had gotten into a car instead of hopped on his dick, that would've been okay because she wouldn't have been cognizant enough to realize that she was too drunk to drive?\n\nIt doesn't take much cognizance to realize that someone is slipping in and out of consciousness, and he had given no indication prior to becoming drunk past being able to give informed consent that he wanted her to do things to him.",
                                                            "author": "Mavericgamer",
                                                            "created_utc": 1398636254.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_ch3o7uo",
                                                                    "parent_id": "t1_ch3m71x",
                                                                    "body": "Let's say you go to a party and meet somebody who seems particularly friendly to you.  Do they like you?  At this point, you're not sure.  You both keep drinking, strike up a conversation, find out more conclusively that you like eachother.  You hook up, exchange numbers, have a nice chat, whatever.  Great.  Happy drinking story.  \n\nDid either party consent beforehand?  No.  Would you and person hooking up be illegal?  Yes, there was no informed consent.  Would it be ethical.  I don't believe so.  \n\nI'm assuming he wasn't carried upstairs.  I'm assuming Mandy was drunk and she thought he consented- probably.  \n\nHowever, my view has been changed.  I do not blame him for what happened.  I do not know the full extent of the situation and therefore have to give him the benefit of the doubt that everything he said and believes is true.  I also don't blame Mandy though without better evidence.  ",
                                                                    "author": "rocaterra",
                                                                    "created_utc": 1398640921.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_ch3p1te",
                                                                            "parent_id": "t1_ch3o7uo",
                                                                            "body": "There is a line between \"drunk\" and blackout, not conscious drunk. When you are so drunk that you can't stand, don't remember the next morning, and aren't even conscious half the time, active sex can't happen. If one party is that drunk, and sex still happened, it implies the other party was not.\n\nIn the situation you mentioned, you might be too drunk to safely operate a motor vehicle, but not too drunk to consent. If both parties were equally drunk, however, then they were both equally able to consent.",
                                                                            "author": "Mavericgamer",
                                                                            "created_utc": 1398642859.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_ch331j2",
                            "parent_id": "t1_ch31a6l",
                            "body": "You cannot consent when passed out.  He never consented.  She shouldn't stop drinking because he is in a relationship, she should stop raping people.",
                            "author": "santa_cloud",
                            "created_utc": 1398572889.0,
                            "replies": [
                                {
                                    "name": "t1_ch3366t",
                                    "parent_id": "t1_ch331j2",
                                    "body": "Did she hop on his sleepboner or was he blacked out?  I thought he just didn't remember, but I may have been wrong with the text gone.",
                                    "author": "rocaterra",
                                    "created_utc": 1398573242.0,
                                    "replies": [
                                        {
                                            "name": "t1_ch33a6s",
                                            "parent_id": "t1_ch3366t",
                                            "body": "He didn't remember and his friend walked by and saw him barely conscious of the bed with her blowing him.  I'm assuming he didn't get more conscious by the time she was having sex with him.",
                                            "author": "santa_cloud",
                                            "created_utc": 1398573545.0,
                                            "replies": [
                                                {
                                                    "name": "t1_ch33rrs",
                                                    "parent_id": "t1_ch33a6s",
                                                    "body": "I'm confused as to what your point is.  \n\nAre you implying that if he's blacked out he doesn't share responsibility for sex?  Are you implying him being impaired gets him out of responsibility for sex?  \n\nThe way I see it, he gets out of complete responsibility if and only if he was **passed out** at the time of blowjob and sex.  Not blacked out, passed out.  However since there's no way of confirming a distinction, it seems unfair to assign 100% blame to Mandy.  \n\nSorry for the misunderstanding ",
                                                    "author": "rocaterra",
                                                    "created_utc": 1398574972.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_ch33u0t",
                                                            "parent_id": "t1_ch33rrs",
                                                            "body": "I'm saying he was in no physical state to be able to consent; therefore it was rape and he has no responsibility, hence the \"conscious\" clause in my other post.\n\nAlso, if we can't tell how passed out he is, the Mandy should have 100% of MAKING SURE he has the ability to consent, not do it anyway and hope for the best.",
                                                            "author": "santa_cloud",
                                                            "created_utc": 1398575174.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "name": "t1_ch34j11",
                                                            "parent_id": "t1_ch33rrs",
                                                            "body": "You've since edited the text into your post.\n\n&gt;I was apparently just lying there, looked like I was asleep.\n\n&gt;I woke up the next morning around 7am, alone. My pants were completely off, and I still had my shirt on. I found out later from my best friend he overheard Mandy on her way out telling someone we had sex. I was completely blacked out, probably even passed out.\n\nAll we know is that he looked unconscious while she was giving him a blowjob and then she told someone in the morning that they had sex.\nIf a third party thought he looked unconscious and he thought he was unconscious while I acknowledge the possibility he wasn't, I just don't see why you'd assume he wasn't with the information we have.\n\nIt seems to me she performed one or more sexual acts on him when he couldn't speak at all, to give consent or deny it.\n",
                                                            "author": "Chelsifer",
                                                            "created_utc": 1398577520.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_ch3bqwe",
                                                                    "parent_id": "t1_ch34j11",
                                                                    "body": "Good points, thanks for the response.  \n\n&gt; It seems to me she performed one or more sexual acts on him when he couldn't speak at all, to give consent or deny it.\n\nI like this part a lot.  If we knew it to be true, he would deserve zero blame.  However, there's too much fuzz involved due to his choice to drink.  Walking, talking, having sex are not uncommon blacked-out activities.  ",
                                                                    "author": "rocaterra",
                                                                    "created_utc": 1398611911.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_ch3auh7",
                    "parent_id": "t1_ch30sac",
                    "body": "Would you blame a rich person driving a Ferrari, with bags of money in it, through a shady neighborhood for being mugged?",
                    "author": "Banane9",
                    "created_utc": 1398609421.0,
                    "replies": [
                        {
                            "name": "t1_ch3ggry",
                            "parent_id": "t1_ch3auh7",
                            "body": "That's an interesting argument, but I don't see the two situations as comparable. Most pertinently to the topic at hand, the cases are different because a rapist could never argue that the rapist has more right to take control of someone's body than that person does. Whereas, there are situations in which a mugger could make the argument that repossessing the wealth of the Ferrari driver would overall serve justice (you might not buy it, but in certain situations, I would--but only in certain situations and only if the Ferrari driver was not hurt). \n\nNow, as to who is to blame when the repossession of wealth does serve justice, that's a really complicated issue. I would say the Ferrari driver is not to blame for driving into the neighborhood and getting robbed. However, first, if the thieves were intending to use the money for basic rights (among which I include permanent shelter and health care), I would blame the government for not having provided them with the resources to fill these needs. You might not agree with this, but the important point in terms of the rape scenario is that I would not blame the Ferrari driver. \n\nHowever, I would blame the Ferrari driver for amassing unneeded wealth in a society in which people were too poor to fill what I consider to be basic rights. This moral blame is, though, completely independent of the action of driving into the neighborhood ostentatiously displaying money. I think in this case, I would view the thievery as simply not a crime: there would be no fault because I would see no crime as being perpetrated. I realize that's a radical position, but it's the position you'd take if you're the *most* inclined to blame the Ferrari driver, and under such circumstances, I still don't see the Ferrari driver at fault.\n\nFinally, I want to make the following point: If you see a bankrobber walking down the street, the fact that the bankrobber has committed a crime does not allow you to rape the bankrobber. Even if you see the rich person as criminal in amassing wealth (which I'd be inclined to do in certain circumstances), you're not allowed to kill that person, because that's a completely independent crime. Thus, I only say wealth can be allowably removed from the Ferrari driver in the circumstance that the Ferrari driver has amassed wealth at the expense of the thief, because only in that case do I see the act of removal not as a separate crime but as a response to the original crime. However, I am personally inclined to interpret \"at the expense of\" more liberally than most people might. \n",
                            "author": "[deleted]",
                            "created_utc": 1398623407.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ch30u5o",
            "parent_id": "t3_242qn0",
            "body": "&gt; I don't think he should've showed such lack of discipline towards alcohol when he knew explicitly there was an old flame who was into him.\n\nThat's like saying: \"She was asking for it going out of the house dressed like that\". \n\nPeople have the right to be stupid and make bad decisions without being sexually assaulted. ",
            "author": "Gekko_the_Great",
            "created_utc": 1398566867.0,
            "replies": [
                {
                    "name": "t1_ch3c0l2",
                    "parent_id": "t1_ch30u5o",
                    "body": "Sexual assault implies an act of intentional violence. Courts may enforce certain actions as \"assault\" because it's difficult to disprove malicious intent, that doesn't make it theoretically correct. So much of human interaction, especially sexual cues, are non-verbal. You shouldn't be up in arms when shit like this happens. Like someone else said, would you be surprised if a rich guy drove through a shady neighborhood with bags of money and got robbed? It's common sense. The blame is on both parties.",
                    "author": "sittinginabaralone",
                    "created_utc": 1398612621.0,
                    "replies": [
                        {
                            "name": "t1_ch3e2zy",
                            "parent_id": "t1_ch3c0l2",
                            "body": "&gt; Sexual assault implies an act of intentional violence. \n\nThat's absolutely wrong. *Battery* implies violence, not assault. \n\n18 U.S. Code § 2242(2)(A)(B):\n\n(2) engages in a sexual act with another person if that other person is—\n\n(A) incapable of appraising the nature of the conduct; or\n\n(B) ***physically incapable of declining participation in, or communicating unwillingness to engage in, that sexual act***\n\nThe language changes among State Law, but it's substantively the same: oral sex on someone who is black-out drunk *is* sexual assault.\n\n&gt;You shouldn't be up in arms when shit like this happens. Like someone else said, would you be surprised if a rich guy drove through a shady neighborhood with bags of money and got robbed? It's common sense. The blame is on both parties.\n\nYes, the absolute fuck you should be \"up in arms when shit like this happens\"; the stupidity of the victim does not excuse criminal behavior.  ",
                            "author": "Gekko_the_Great",
                            "created_utc": 1398617861.0,
                            "replies": [
                                {
                                    "name": "t1_ch3fpaz",
                                    "parent_id": "t1_ch3e2zy",
                                    "body": "Again, like I said, the courts will label it sexual assault.  Bringing a legal definition means nothing in the context I laid out.  Criminal - another term that means nothing outside a court definition.\n\n\n\n",
                                    "author": "sittinginabaralone",
                                    "created_utc": 1398621638.0,
                                    "replies": []
                                },
                                {
                                    "name": "t1_ch3gu4i",
                                    "parent_id": "t1_ch3e2zy",
                                    "body": "We're only getting the guy's point of view though.  How drunk was Mandy?  From a realistic point of view it comes down to whether she was soberly forcing herself on a drunk man or drunkenly hooking up with an old flame.  \n\nSince neither conclusion is able to be established, guy should get partial blame as an unfortunate consequence of drinking \n\n**Legally** they were both drunk and both incapable of legal consent.  ",
                                    "author": "rocaterra",
                                    "created_utc": 1398624269.0,
                                    "replies": [
                                        {
                                            "name": "t1_ch3hoh4",
                                            "parent_id": "t1_ch3gu4i",
                                            "body": "It's completely irrelevant. Yes, they were both probably drunk, but *she* committed the act, not him. \n\nAgain, flip the roles: imagine a drunk girl, blacked out in a bedroom at a party, and her drunk ex comes in and goes down on her while she's passed out. That guy would be arrested and charged in a heartbeat, and rightly so. Why should a woman get away with an act that would get a man busted?",
                                            "author": "Gekko_the_Great",
                                            "created_utc": 1398626172.0,
                                            "replies": [
                                                {
                                                    "name": "t1_ch3j0r0",
                                                    "parent_id": "t1_ch3hoh4",
                                                    "body": "He wouldn't be charged if nobody knew whether or not the girl was passed out.  Correct me if I'm wrong, but all we have to go by is his drunk friend saying he *looked* passed out.\n\nMan definitely should get busted in that scenario.  We are aware she was passed out.  Here we are not.  ",
                                                    "author": "rocaterra",
                                                    "created_utc": 1398629191.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ch3101z",
            "parent_id": "t3_242qn0",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1398567314.0,
            "replies": [
                {
                    "name": "t1_ch3bwx4",
                    "parent_id": "t1_ch3101z",
                    "body": "There's too much fuzz in the situation.  He and we don't know whether he was conscious at the time of the blowjob &amp; sex. \n\nTo me, it seems like he's assuming a more positive outcome (for him) that he didn't cheat on his girlfriend.  From my point of view, it seems significantly more likely he got too drunk and cheated on his girlfriend plain and simple.    \n\nBecause he is responsible for the ambiguity, I feel like some accountability should be taken.  If there was a sober guy watching the whole thing, then it would be entirely different.  It's not the end of the world, but it does seem like his choices partially led him to this point.  ",
                    "author": "rocaterra",
                    "created_utc": 1398612350.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_ch3155p",
            "parent_id": "t3_242qn0",
            "body": "I think the problem here is not the lack of discipline he had towards alcohol... he was at a friends house, surrounded by his own friends with arrangements in place for a bed to sleep on that night, This is probably the safest, most responsible environment to get blackout drunk in,\n\nThe problem arising is that while you in retrospect can see Mandy as a potential problem which alcohol moderation would be needed to deal with, OP showed up already half cut, he didnt perceive Mandy as a threat, she knew about his fiance, and his happiness with her... In this scenario he trusted her not to be a problem so he carried on drinking in what he thought was a safe environment",
            "author": "[deleted]",
            "created_utc": 1398567704.0,
            "replies": [
                {
                    "name": "t1_ch31l1a",
                    "parent_id": "t1_ch3155p",
                    "body": "Thank you for the response.  You've made it clearer that he was in a pretty safe situation.  \n\nI think I'm still grappling with whether Mandy is to blame or not.  Does there have to be one rapist and one victim?  Seems like she was already there drinking and that just happened to be the way of the night.  Did she forcibly get her way or did it just happen because everybody was drinking.\n\nI guess I'm having trouble actually placing blame on anyone and the only one left really is the poor unfortunate OP.  I guess I felt like someone should be assigned blame in this situation, but now I'm not as sure.\n\nEdit:  I forgot about the part where the friend said she was dragging him upstairs.  I went back to check, but the description has been deleted.  Seems hard to tell what the nature of that dragging was.  I'm assuming playful, but who knows.  I really wish I could read the post again.",
                    "author": "rocaterra",
                    "created_utc": 1398568902.0,
                    "replies": [
                        {
                            "name": "t1_ch31vnl",
                            "parent_id": "t1_ch31l1a",
                            "body": "Well compounding, in my eye's, Mandy's guilt is the differing levels of sobriety... She was sober enough to drive home safely before Op's brain could even manage a concious thought\n\nthough you have a good point, 1 rapist 1 victim... Was Mandy the archetypical predatorial rapist planning this from the beginning... or were her inhibitions lowered enough that when she saw a chance to act on her feelings she took it?... While I don't feel Mandy plotted to have her way with him, I feel that having sex with an unconscious man (the opportunity to act) does put her at blame\n\nIf I got into a fist fight while drunk and ended up in lockup I wouldn't be able to use \"But officer i was drunk\" as an excuse, it would be a reason, but i should still face the consequences of my actions, just as i feel Mandy should be held accountable for hers",
                            "author": "[deleted]",
                            "created_utc": 1398569723.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ch32wl6",
            "parent_id": "t3_242qn0",
            "body": "Since the original text is deleted, here's the text form the original post:\n\nThrowaway account. \n\nFirst of all, I am a 24 year old male, engaged to my girlfriend (now fiance) of 6 years. We are in a great place and are getting married in October. \n\nLast night I went to my best friend's birthday party. My fiance is out of town til Tuesday. I arrived around 1030pm after pre-gaming with two other friends, so when I arrived I was pretty sloshed. I remember arriving. \n\nI also remember running into a girl, we'll call Mandy, I had known in high school. We had dated briefly and she was my first blowjob back then. Anyway. We caught up and all that, and I remember her being particularly flirty. I told her I was engaged and even showed her pictures of my fiance. Then, I went about my night. I remember my best friend pulling me aside and told me that Mandy was wanting to hook up with me, and was overly flirty. I was honestly pretty oblivious of her advances. \n\nAnyway, I kept drinking. Took several shots of Southern Comfort, and eventually blacked out. The only thing I remember after that is a quick flash of me vomiting out in the back yard. But something else happened. \n\nMy best friend said he walked upstairs to grab a towel, because someone had thrown up in his kitchen. When he opened the door, apparently Mandy was giving me a blowjob. I was apparently just lying there, looked like I was asleep. In his drunken state, he didn't think much of it, so he shut the door. \n\nI woke up the next morning around 7am, alone. My pants were completely off, and I still had my shirt on. I found out later from my best friend he overheard Mandy on her way out telling someone we had sex. I was completely blacked out, probably even passed out. I was definitely raped.\n\nI don't know what to tell my fiance. I'm trying to keep it under wraps. I'm afraid she won't believe I was raped. What do I do?\n\n**TL;DR** I was raped by an old flame at my friend's party. I have a fiance and I'm afraid of telling her in fear she won't believe me.\n\nEdit 1: Just called my fiance, told her I had something I wanted to talk to her about and not to worry. I just didn't want to pretend everything was normal til Tuesday. She is coming home early and will be back tomorrow evening. I've worried her, and now I'm even more afraid to tell her...\n\nEdit 2: Thank you everyone for your support. I'm still incredibly worried about telling my fiance. But it's gotta happen. I will post an update tomorrow night if I can. Honestly, I'm more worried about losing my love than I am hurt that it happened. I don't think I will need counseling, I'm a pretty level headed and rational person. NOT that people who do need counseling aren't! Just for me, personally, I don't think it would help much. Just a personal preference. Everybody copes differently. \n\nEdit 3: I just talk to my best friend. We both agree, it definitely appears I was raped. He says the more he think about it, the more he thought I was asleep or passed out when she was blowing me. He apologized for not stopping it, but was so drunk he just didn't think anything of it. He's willing to talk to my fiance is she needs proof. Also he is going to try and talk to Mandy soon. He's just thinking of a way to do it tactfully. I will also update with how that goes.\n\n[Source](http://np.reddit.com/r/sex/comments/2423ao/i_was_raped_last_night_im_engaged_im_a_man/)",
            "author": "Shabaaab",
            "created_utc": 1398572515.0,
            "replies": [
                {
                    "name": "t1_ch33ayd",
                    "parent_id": "t1_ch32wl6",
                    "body": "Ah!  Thank you so much.  This thread can live again",
                    "author": "rocaterra",
                    "created_utc": 1398573603.0,
                    "replies": [
                        {
                            "name": "t1_ch34vso",
                            "parent_id": "t1_ch33ayd",
                            "body": "Not a problem, mate :) If it helps, the original post had been crossposted to another sub, which is where I got it from.",
                            "author": "Shabaaab",
                            "created_utc": 1398578890.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ch338wb",
            "parent_id": "t3_242qn0",
            "body": "I say that someone is responsible/to blame if that person directly and consciously causing an action to occur.  If you have a different definition, tell me, but this is the one I like to use.  Him drinking did not make her rape him.  He didn't trigger a rape instinct in her that made her lose control of her actions.  Him drinking did not affect her at all, so she had no reason to commit a crime against him.  Therefore, he is not responsible.  It's a good idea not to get black out drunk, but that makes him thoughtless, not responsible.\n\nNothing illegal should happen to you if you haven't done anything illegal (I mean this like being in prison would be illegal if it wasn't ordered by the government.)",
            "author": "santa_cloud",
            "created_utc": 1398573446.0,
            "replies": []
        },
        {
            "name": "t1_ch3kiuf",
            "parent_id": "t3_242qn0",
            "body": "If the story happened the way the poster ~~says~~ thinks it did, then he was raped.  I think your problem isn't with blaming him for being raped.  I think your issue is that we (and perhaps he) don't really know what happened.\n\nHe says he was drunk.  He says he was blacked out.  So if he was, how does he even know that the girl, rather than him, was the aggressor in the encounter?  He says that someone told him that Mandy was looking to hook up with him.  How do we (how does he) know that he didn't file that information away, get horny as the night went on, and went on to ask Mandy for a blowjob and led her to the bedroom?\n\nFor all we know, and for all he knows, that's how it went down.  Is it fair to now accuse Mandy of raping him if he was the one who suggested the sexual encounter to her?\n\nAnd that is the biggest problem with drunk sex/rape allegations:  The \"victim\" doesn't really know what happened.  So if they don't **know** they were raped, how can they claim they were raped?  Why should anyone believe they were raped?  Were they raped, or are they leveling a false rape accusation?\n\nThat's not victim-blaming.  That's just recognizing that we don't even know whether or not there was a rape.",
            "author": "Russian_Surrender",
            "created_utc": 1398632556.0,
            "replies": []
        }
    ]
}