{
    "name": "t3_2cy7r8",
    "title": "CMV: (Minor spoilers) Ragnar is absolutely justified in Blood Eagling Jarl Borg.",
    "body": "In the TV show Viking, Season 2 episode 7, Ragnar Lothbrok (blood ealges)[http://en.wikipedia.org/wiki/Blood_eagle] Jarl Borg is response to his massive attack on Kattegat, and attempted murder of his family while Ragnar was in England. I believe this was absolutely justified on Ragnar's part. Ragnar had to show King Horik (who was plotting to betray him... and kill his family) that such an assault simply would not be tolerated. He had to show those who wanted to do him in what would happen. Further to this, it showed the people of Kattegat how far Earl Ragnar would go to protect them from an invader. \n\nSo go ahead Vikings fans of Reddit: Change my view!\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "ZeroNightskye",
    "num_comments": 8,
    "created_utc": 1407470316.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2cy7r8/cmv_minor_spoilers_ragnar_is_absolutely_justified/",
    "comments": [
        {
            "name": "t1_cjkc3lb",
            "parent_id": "t3_2cy7r8",
            "body": "I don't know about this show but in real history, around the 9th century King Ælla of Northumbria threw legendary viking Ragnar Lothbrok into a snake pit to die.\n\nHis sons, including Ivar the Boneless, traveled to England leading the Great Heathan Army and made King Ælla into the Blood Eagle. They founded the city of York (which they named Jorvik).\n\nThe sons of Ragnar Lothbrok were only stopped by King Alfred the Great, the only English king to be called \"The Great\". He united England and drove away the Vikings.",
            "author": "Software_Engineer",
            "created_utc": 1407483219.0,
            "replies": []
        },
        {
            "name": "t1_cjkge3v",
            "parent_id": "t3_2cy7r8",
            "body": "I realize that this is cultural bias talking, but while I can recognize Ragnar's need to kill Jarl Borg, and to make a statement, I simply can not justify doing something that terrible to another human being.\n\nThat level of torture, of sadism... it's a sign of a monster, and I think that was demonstrated during the scene. Every one watching understood why Ragnar had to kill Borg, but the process was so horrible that even members of the tribe had a hard time watching. \n\nIt's inhuman, and to describe it as necessary, regardless of culture, displays to me an innate flaw in a person.",
            "author": "sailorbrendan",
            "created_utc": 1407502490.0,
            "replies": [
                {
                    "name": "t1_cjkgzwn",
                    "parent_id": "t1_cjkge3v",
                    "body": "What I got from the scene was the non warriors getting really squeamish. They're not really used to that level of violence. Also, I think the choice of execution method has to do with ragnars character and his long standing anger at jarl borg. He's still going to give even an enemy a chance to enter valhalla, even if itsa remote one",
                    "author": "ZeroNightskye",
                    "created_utc": 1407504194.0,
                    "replies": [
                        {
                            "name": "t1_cjkhajj",
                            "parent_id": "t1_cjkgzwn",
                            "body": "&gt; I think the choice of execution method has to do with ragnars character\n\nThis is part of my point. What I saw was more than a religious rite and a chance for redemption. \n\nI saw sadistic glee, which calls into doubt a sense of \"right\" in my mind. It's intentional cruelty which has rarely been promoted as good in human history. \n\nAnd history has always judged most harshly the times and cultures that promoted it.\n\nRitual killing is one thing, but torture is another.",
                            "author": "sailorbrendan",
                            "created_utc": 1407504928.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cjkh0e7",
                    "parent_id": "t1_cjkge3v",
                    "body": "The bloodeagle was a clearly a horrible way to execute Borg, but by doing so Ragnar allowed him the chance to enter Valhalla. Based on the show's mythos, had Borg simply been decapitated, he'd never be able to drink Zima with the Gods. But now he is, because Borg took his eaglin' like a man.",
                    "author": "mrgoodnighthairdo",
                    "created_utc": 1407504231.0,
                    "replies": [
                        {
                            "name": "t1_cjkhz4m",
                            "parent_id": "t1_cjkh0e7",
                            "body": "I'm not against the blood eagle but couldn't Ragnar just challenge him to a duel?\n\n(my understanding is that men who die in battle get there).\n\nIt would be more warrior like and showing that Ragnar isn't afraid of him but i guess the blood eagle is something reserved for special occasion like this?",
                            "author": "tehzeroFIN",
                            "created_utc": 1407506547.0,
                            "replies": [
                                {
                                    "name": "t1_cjkitpy",
                                    "parent_id": "t1_cjkhz4m",
                                    "body": "*From what I understand*, trial by combat only really took place when there was some question of whom the Gods favored. As the Gods had given Borg the celestial finger, I don't believe trial by combat was ever even on the table.\n\nAlso, Ragnar put on his earl hat when he condemned Borg. And, being as there was no challenge to his authority, no need to win the favor of the Gods or prove he was in their favor, nor any need to win the respect of his people, Ragnar had no reason at all to allow Borg a trial by combat. And, really, Ragnar had already fucked Borg's shit up in combat anyway.\n\nLastly, Borg's eaglin' had already been prophesied by the seer, who teased Borg with hints of his impending doom. So, if the seer had foreseen Borg's fate, the there's the question of whether or not Ragnar could have even chosen *not* to eagle Borg.",
                                    "author": "mrgoodnighthairdo",
                                    "created_utc": 1407508429.0,
                                    "replies": [
                                        {
                                            "name": "t1_cjkjaqy",
                                            "parent_id": "t1_cjkitpy",
                                            "body": "Thanks for clearing that up. Also forgot the foreshadowing.",
                                            "author": "tehzeroFIN",
                                            "created_utc": 1407509405.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}