{
    "name": "t3_26nxut",
    "title": "CMV:I don't understand why American families will their children to their own fate",
    "body": "So I've been reading a few of the responses in this sub these days, and after a lifetime of being curious I finally decided to bring the issue to you: \n\nAmerican famillies just don't make sense to me. People seem to think their responsibilities as parents end when the child goes to college/university or even when the child is of working age. \n\nAnd I used to be able to grasp this cultural difference as a tradeoff: \"oh well they take care of their children less, but they don't expect to be taken care of when they grow older in return\"\n\nBut I keep seeing those comments as to why \"it is bad\" to \"shelter\" their children from their adult responsibilities. How they will not develop character. \n\nBut this just seems like nonsense to me, because university education (for those who want it) or any kind of apprentinceship for a craft, is important for character development and the future career oportunities your kid may have. If you can help, even a little, and you don't it's a consious choice and not for their own good. In my mind. \n\n\nIt just doesn't make sense to me. And you don't even have free tuition in your universities. \n\nSo what am I missing? Have I got this wrong? Is this only a vocal minority and the majority helps their children through? \n\n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "Flamousdeath",
    "num_comments": 18,
    "created_utc": 1401246165.0,
    "url": "http://www.reddit.com/r/changemyview/comments/26nxut/cmvi_dont_understand_why_american_families_will/",
    "comments": [
        {
            "name": "t1_chst55p",
            "parent_id": "t3_26nxut",
            "body": "It may interest you, there was a posting a few days ago (perhaps even Yesterday) with the opposite sentiment.  I'm not sure of the title, but it was fairly recent.\n\n",
            "author": "[deleted]",
            "created_utc": 1401246602.0,
            "replies": [
                {
                    "name": "t1_chstdjg",
                    "parent_id": "t1_chst55p",
                    "body": "You're right. I can't find it, it looks like it's been removed. But there was a CMV either earlier today or yesterday that was \"Why Do American families continue to coddle their children after they become legally adults?\"\n\nSo here, OP believes American families are one way, and there, a different OP thought they were another. Neither OP were actually American.\n\nHow do we reconcile this?",
                    "author": "DHCKris",
                    "created_utc": 1401247130.0,
                    "replies": [
                        {
                            "name": "t1_chstfv8",
                            "parent_id": "t1_chstdjg",
                            "body": "I found it, I just linked it to the OP.\n\n",
                            "author": "[deleted]",
                            "created_utc": 1401247279.0,
                            "replies": [
                                {
                                    "name": "t1_chsthjv",
                                    "parent_id": "t1_chstfv8",
                                    "body": "Ooh, gotcha. Thanks!",
                                    "author": "DHCKris",
                                    "created_utc": 1401247385.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "name": "t1_chstlop",
                            "parent_id": "t1_chstdjg",
                            "body": "I don't think that those 2 views can't be reconciled. \n\nEvery person sees the world through the lense of his own culture. My lense is more family centric, that other person's isn't. To both of us, the American way seems weird. \n\nI didn't start this thread to argue that my way of life is better, I just want to hear about how your way makes sense to you. \n\nNote: I found that other thread that I will be reading for a while too",
                            "author": "Flamousdeath",
                            "created_utc": 1401247653.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_chstdo9",
                    "parent_id": "t1_chst55p",
                    "body": "I did a search before posting, and I did another one now and I can't seem to find it. \n\nIf you can link it to me and I find the discussion there pertinent I'd be more than happy to delete this thread",
                    "author": "Flamousdeath",
                    "created_utc": 1401247140.0,
                    "replies": [
                        {
                            "name": "t1_chstedv",
                            "parent_id": "t1_chstdo9",
                            "body": "It looks like it was removed or deleted. But yeah, he was also a non-American with a view of American families, but it was exactly the opposite: that American parents are TOO involved in their child's lives after the age of 18.",
                            "author": "DHCKris",
                            "created_utc": 1401247185.0,
                            "replies": []
                        },
                        {
                            "name": "t1_chstfhk",
                            "parent_id": "t1_chstdo9",
                            "body": "http://www.reddit.com/r/changemyview/comments/26lh04/cmv_it_is_misguided_to_protect_those_18_and_over/\n\nI'm not going to tell you to delete it, I'm just offering it for your perusal.\n\n",
                            "author": "[deleted]",
                            "created_utc": 1401247254.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_chstndx",
            "parent_id": "t3_26nxut",
            "body": "Where are you coming from with this? In the America I know (which is middle-class white America, for those keeping score), people don't think their parental responsibilities end at age 18, or graduation, or whatever. But the expectation for what a healthy lifestyle is at that age or stage typically involves significant financial and personal independence.\n\nLook, when I was 27, I moved back to live with my parents under what I think were honorable circumstances: I was needed to help run the family business, but didn't expect to stay in that city for more than a few months, so it didn't make sense to lease an apartment. But when I met people socially, my living arrangements were a point of distinct embarrassment: living with your parents is widely seen as a sign that you're not capable of taking care of yourself.\n\nParents like mine and my peers' don't \"encourage\" their children to move out by age 20 because they don't feel responsible for them. It's because parents don't want their kids to be seen as (or to be, in both parent and child's opinion) helpless losers.",
            "author": "cnash",
            "created_utc": 1401247764.0,
            "replies": [
                {
                    "name": "t1_chstuw3",
                    "parent_id": "t1_chstndx",
                    "body": "It's the general impression I've got from movies/books and people here on reddit. I acknowledged from the start that it may be false. \n\nYour description does ring closer to home for me, although I don't get the whole shame bit. \n\nBut I'm beginning to see where the cultural difference lies. \n\nIf a child got married, how tied would the 2 financial situations of the families be?\n\n",
                    "author": "Flamousdeath",
                    "created_utc": 1401248239.0,
                    "replies": [
                        {
                            "name": "t1_chsunve",
                            "parent_id": "t1_chstuw3",
                            "body": "&gt;If a child got married, how tied would the 2 financial situations of the families be?\n\nWell, 3 financial situations, since there are two parent families. But to answer your question, the new couple would typically be functionally independent: they should have separate bank accounts from their parents, and be responsible for paying their own lease/mortgage and bills. But it wouldn't be unheard of* for parents to discreetly subsidize their children or their child-in-law. Things like selling them your old car for a dollar, or paying for their plane ticket to visit if they live far away, or investing (sometimes a lot of money) in a startup business. And (the bride's) parents customarily pay the expenses involved in the wedding itself.\n\n\\* Other families' financial arrangements are usually kept firmly private, so these are more \"things I wouldn't be surprised by\" and \"things my close friends have told me\" than \"compiled from a public records.\"",
                            "author": "cnash",
                            "created_utc": 1401250204.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_chstnie",
            "parent_id": "t3_26nxut",
            "body": "For better or for worse, America has an individualistic narrative. It is romantic to think that we cut our own trenches. This is not my view; I am my children's parent forever, and I will always have more experience. Why would I not continue to teach and try to guide as long as I can? This goes against the idea of the self-made american, which is a very influential theme in the American ideology. I can't even think of an influential American author that didn't explore individualism and the self-made *person*.",
            "author": "logimath",
            "created_utc": 1401247771.0,
            "replies": [
                {
                    "name": "t1_chstz1a",
                    "parent_id": "t1_chstnie",
                    "body": "That's a nice angle. I'm from one of the few remaining places on earth to still have vendettas around. An aweful thing, but still, our narative is heavy loaded with familly honor and duty. \n\nSo while this may not differentiate us much from people with neutral narratives, I guess if a culture has a conflicting ideal: The self-made individual with no strong familly ties, differences in familly structures may become more apparent",
                    "author": "Flamousdeath",
                    "created_utc": 1401248513.0,
                    "replies": [
                        {
                            "name": "t1_chsz7ut",
                            "parent_id": "t1_chstz1a",
                            "body": "This is completely off-topic, but where is it that vendettas are still a cultural norm (the only place I can think of off the top of my head is Corsica, pardon my ignorance)? How does that practice work in the larger culture? ",
                            "author": "294116002",
                            "created_utc": 1401267586.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cht35m0",
            "parent_id": "t3_26nxut",
            "body": "Being an individual is what being an American or any free person in general is all about",
            "author": "adamk5",
            "created_utc": 1401284611.0,
            "replies": []
        },
        {
            "name": "t1_chtmsji",
            "parent_id": "t3_26nxut",
            "body": "This really stems from a \"go west young man\" mentality.\n\nWe are always taught to make our own way, to go grab a piece of America for ourselves. It's not that our parents leave us, they just give us room to start and I think that's important. \n\nPersonally I would be embarrassed to live with my parents past 25 or so. It would mean I have failed to stand on my own. \nBesides I want to live my own life, not my parents.",
            "author": "[deleted]",
            "created_utc": 1401327537.0,
            "replies": [
                {
                    "name": "t1_chtpq6t",
                    "parent_id": "t1_chtmsji",
                    "body": "85% of young adults move back in with their parents during or after college.\n\nSounds like you're a rare breed.",
                    "author": "limeade09",
                    "created_utc": 1401333973.0,
                    "replies": [
                        {
                            "name": "t1_chtvmwp",
                            "parent_id": "t1_chtpq6t",
                            "body": "Graduated college at 22, moved home for six months, then left. I don't think it's all that rare.",
                            "author": "[deleted]",
                            "created_utc": 1401357738.0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}