{
    "name": "t3_2xi5bb",
    "title": "CMV: Ross &amp; Monica have an almost creepy relationship (in Friends)",
    "body": "Ross &amp; Monica are brother &amp; sister, but yet they remain incredibly close friends, well into their 30s. While this in and of itself isn't necessarily concerning, the way that they act together is. \n\nTime after time, Monica &amp; Ross share the same chair when the gang is just sitting around, and Monica sometimes sits on his lap. Monica is always grabbing on to Ross, touching him and leaning into him, and he's always wrapping his arms around her. Okay, but this can be put off as they're relatively handsy people. \n\nNot only that, but there are also countless situations where there are just some weeeeeeeeeeeeeird boundaries crossed. Monica &amp; Ross are incredibly open about their sex lives with each other... In \"The One Where the Stripper Cries\" (Season 10), we find out that Ross &amp; Monica kissed at a party once (which just so happened to be Monica's first kiss!). In \"The One in Barbados (Part 2)\", Monica listens through the very thin walls of the hotel on her brother hooking up with the girl that Joey had been dating approximately 1 hour previously. In \"The One Where Rachel Goes Back to Work\", Monica wants to have sex with Chandler (\"Pants off Bing!\"), and when Ross lets her know he's still in the room, she says that it will happen whether or not he's in the room. \n\nMost of these examples are from later seasons (because that's what I've been watching the past week or two), but there are SO many examples throughout the series and it's something that really has been bothering me. Please help me find a way to find their relationship not as creepy, since I really love the series, but this is really weirding me out. \n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "dandiroar",
    "num_comments": 10,
    "created_utc": 1425162884.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2xi5bb/cmv_ross_monica_have_an_almost_creepy/",
    "comments": [
        {
            "name": "t1_cp0ambd",
            "parent_id": "t3_2xi5bb",
            "body": "Monica and Ross do have a close relationship, sure, but those aren't very good examples of it being \"creepy.\" In the \"Pants off, Bing!\" moment, Monica and Chandler are trying to conceive a child, and Monica is trying to maximize their chances of conception by having sex while she's ovulating; Ross is delaying that by staying around. In Barbados, she listens at the wall because she's caught up in the drama of the moment, but as soon as Chandler points out that she's listening to her brother, she reacts appropriately and stops. And the kiss at the party was, if I recall correctly, an accident.\n\nSo yes, they have a very close relationship, sure, but I've never found it creepy. And really, *everybody* on that show is very affectionately physical with each other. *Friends* is ten seasons of hugs.",
            "author": "evilgenius815",
            "created_utc": 1425163455.0,
            "replies": [
                {
                    "name": "t1_cp0bshb",
                    "parent_id": "t1_cp0ambd",
                    "body": "I think that if these were isolated incidences, then I would agree with you. However, this type of situation happens time and time again throughout the course of the series. These are just the examples from the episodes I've watched in the past 2 days. \n\nTime &amp; time again, Monica &amp; Ross try to get involved in each other's sex lives, and encourage the other to get lucky (like when Monica asked Ross for advice on which lingerie to wear). Please tell me that that isn't normal. And we know from the episode where Monica &amp; Ross's cousin, Cassie, comes to visit that Ross is attracted to his relatives, as he was so attracted to her that she couldn't stay with him. \n\nMy issue isn't with any of the isolated incidences, as they are weird, but not necessarily THAT weird on their own, but by the sheer number and frequency of these incidences.",
                    "author": "dandiroar",
                    "created_utc": 1425165927.0,
                    "replies": [
                        {
                            "name": "t1_cp0c4jc",
                            "parent_id": "t1_cp0bshb",
                            "body": "Well, it's a comedy, and it's **funny** to joke about things on the borderline of being weird or creepy. Like when Monica says sex will happen whether or not Ross stays around, she clearly wants him to leave, but also wants to conceive so much that she can joke about that being her top priority. There's a grain of truth to it - she does really want to conceive - but the joke is that it gets us to think about what would happen if she actually went through on her \"threat\", which would be creepy obviously.\n\nSo yes, the show does veer a little close to \"creepy\", but they're not **really** creepy. It's just funny to joke about how creepy things could get. But they don't.\n\nThe fact that they even **can** joke about such things is because they have a pretty good relationship. They care about each other and are close. They are a brother and sister in the same tight-knit group of friends, which rarely happens among adults. Given their relationship, it's funny to laugh about how creepy it could be, because it's secure in being not creepy.",
                            "author": "therapy",
                            "created_utc": 1425166639.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cp0h7f5",
                            "parent_id": "t1_cp0bshb",
                            "body": "I'll grant that some of the things they can or do come off as creepy, particularly when you've got Monica talking with Rachel about her relationship with Ross, but by and large it's not that bad or abnormal. In the Barbados example, the other characters point out how weird it is that she's listening to Ross through the wall, and then she immediately realizes what she's doing. The reason for that is just that they're, well, friends, and she gets caught up in that rather than being overly conscious about sibling boundaries. The first kiss thing was a freakish case of mistaken identity that can be thrown away. Ross hadn't seen his cousin for like 20 years. You can't say \"he's attracted to his relatives\" like it's a rule or an immutable fact about him. Having sex with Ross in the room was a joke.\n\nThe whole gang is ridiculously touchy-freely. They all hug/cuddle/touch/talk about having sex (or actually do it, or almost do it) with each other with a frequency that far exceeds what you'd ever see from any regular group of good friends. In that context, the way Ross and Monica act is unremarkable. There's no sexual element to any of it.",
                            "author": "amaru1572",
                            "created_utc": 1425177879.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cp0nthy",
                            "parent_id": "t1_cp0bshb",
                            "body": "Yore definitely missing the whole point. Both instances you brought up (Monica telling Ross her and Chandler are going to do it even if he's still there and where she asks shows him her lingerie) you're misunderstanding. First one, as someone said, Monica is circulating and excited to have a baby and she is trying to get Ross out of the house but when he is lingering she flat out tells him he should go because her and Chandler are going to have sex. Harmless. Then Monica is wanting to ask (rachel, if I remember correctly) which lingerie she should wear but Ross offers his help. She tries to decline but he persists because he doesn't know what she's asking help for. She tells him probably for shock value. She tried to tell him he didn't want to know what she was talking about. And he acts accordingly, and gets all uncomfortable. \n\nMaybe you're just not used to close relationships other than significant others but this is completely normal.\n\nThey even did an episode with a neighbor that Rachel dates who is way to close to his sister. ",
                            "author": "reallybadadvicebear",
                            "created_utc": 1425194687.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cp0qr6u",
                            "parent_id": "t1_cp0bshb",
                            "body": "I agree that if this was a real world relationship it would be creepy. But as you said any given one isolated event in the real world wouldn't be \"creepy\" per se, just awkward and kind of funny that people would laugh at and tease them about in the future. Since this is a TV comedy (and one where a waitress and unemployed chef have a massive apartment adjacent to Central Park NYC) we suspend a little bit of reality. In their case the frequency of \"funny-awkward moments.\" \n\nIn reality adult siblings may have an awkward funny moment every few years. But that's not enough content for the show. In reality people aren't getting into quirky jams every week at work and dating either as all the characters are. But a TV show about people going to work, sitting at home on reddit and watching TV wouldn't be that funny. So they get into situations all the time, when in reality you may have a funny story that anyone would want to hear even as an anecdote only every once in a while. So because we suspend reality that they have quirkier lives in general than realistically expected, the relationship between Ross and Monica is not \"creepy\" based on volume alone because again as you pointed out any one isolated incident is perfectly plausible in the real world, the show just ups the frequency in line with the rules we accept for their reality.\n\nAlso, though they have awkward moment, they generally recognize that they're awkward and act appropriately when they realize it. For example when Ross advises Monica about the lingerie she isn't overtly asking for his opinion, she is trying to hide the skimpy clothes from him, but he pushes and demands to see what she is hiding. She then intentionally embarrasses him during the reveal by saying, \"Okay, which one of these nighties would make your friend want to sleep with your sister?\" (or something to that effect) while clearly being very annoyed that he pushed and demanded to see what she was hiding.",
                            "author": "thekingearl",
                            "created_utc": 1425208681.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cp1c22n",
                            "parent_id": "t1_cp0bshb",
                            "body": "You forgot to mention how ridiculously excited Monica got over watching Ross' sex tape with Rachel ",
                            "author": "Ultra-ChronicMonstah",
                            "created_utc": 1425257148.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cp0c6kp",
            "parent_id": "t3_2xi5bb",
            "body": "Anything can be \"creepy\" if you project sexualization onto a non-sexual act. Petting a dog is creepy if you sexualize it. \n\nAll the examples you cite between the Chandler and Monica characters are \"creepy\" because you are projecting sexual attraction on characters that are written as not being sexually attracted to each other. That's your prerogative, as a viewer. The writers of the show have no control, or responsibility, over that.",
            "author": "GregBahm",
            "created_utc": 1425166759.0,
            "replies": []
        },
        {
            "name": "t1_cp0f8wq",
            "parent_id": "t3_2xi5bb",
            "body": "if you'll recall, the show sort of handles this off handedly in a couple of instances. there's the guy Rachel dates (Joshua?) who has a creepy way too close incest vibe with his sister, and everyone in the group agrees w/ Rachel's break up reason. when Ross gets the hots for his cousin (in a way he never did for Monica, contrast), he's rebuffed and shamed. they're not that open about sex either - quote Monica from an early episode: \"my brother never even told me when he lost his virginity.\" \n\nwhile i can kind of see what you're getting at, there's too much of a wholesome platonic friendliness to Mon and Ross's relationship, not to mention the sibling rivalry that drives so many episodes. they've had some weird moments, but most families have, and the show makes it clear there are certain lines Ross and Monica will never cross. ",
            "author": "5lash3r",
            "created_utc": 1425173422.0,
            "replies": [
                {
                    "name": "t1_cp0gnbh",
                    "parent_id": "t1_cp0f8wq",
                    "body": "Danny is the one that takes baths with his sister. Joshua bought a bunch of clothes from her at Ralph Lauren after his divorce. ",
                    "author": "PlanetXpressDelivers",
                    "created_utc": 1425176608.0,
                    "replies": []
                }
            ]
        }
    ]
}