{
    "name": "t3_2o9ofv",
    "title": "CMV:Jim should have lost his virginity to Nadya in American Pie.",
    "body": "I will assume you are all familiar with the subject material.  Jim always had his sights set on Nadya, but through the shenanigans in the movie, he instead wound up boning future wife Michelle.\n\nNow I'm not saying that Michelle and Jim shouldn't have boned or gone on to get married and such.  I'm just saying that Jim shoulda held out for Nadya as planned.  She was definitely a worthwhile endeavor and they come back to their connection in later movies.  And the problem is that connection is never consummated because Jim is perpetually in the relationship with Michelle.  So Jim shoulda lost his virginity to Nadya foremost, then if he wanted pursued his relationship with Michelle IMHO.  ",
    "author": "ADIDASects",
    "num_comments": 8,
    "created_utc": 1417708880.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2o9ofv/cmvjim_should_have_lost_his_virginity_to_nadya_in/",
    "comments": [
        {
            "name": "t1_cml0lai",
            "parent_id": "t3_2o9ofv",
            "body": "your assuming michelle would have accepted second hand boyfriends",
            "author": "jumpup",
            "created_utc": 1417709305.0,
            "replies": [
                {
                    "name": "t1_cml0o5q",
                    "parent_id": "t1_cml0lai",
                    "body": "Jim just needed to play his cards right, which woulda been pretty easy.  We know Michelle was DTF and we know she knew Jim liked Nadya.  She didn't even really have feelings for Jim before coitus.  It would have been easy to take care of both tasks.  ",
                    "author": "ADIDASects",
                    "created_utc": 1417709453.0,
                    "replies": []
                },
                {
                    "name": "t1_cml2ft5",
                    "parent_id": "t1_cml0lai",
                    "body": "*experienced  boyfriends",
                    "author": "Captain_Gamemaster",
                    "created_utc": 1417712767.0,
                    "replies": []
                },
                {
                    "name": "t1_cml3k82",
                    "parent_id": "t1_cml0lai",
                    "body": "Michelle was originally helping Jim try to get laid by Nadya because Jim had no idea what he was doing. Since she already knew that about Jim's intentions with Nadya I think she would have accepted him after.",
                    "author": "man2010",
                    "created_utc": 1417714714.0,
                    "replies": []
                },
                {
                    "name": "t1_cml53oh",
                    "parent_id": "t1_cml0lai",
                    "body": "Yes we are assuming she is not retarded or unfamiliar with society.",
                    "author": "TheDayTrader",
                    "created_utc": 1417717310.0,
                    "replies": []
                },
                {
                    "name": "t1_cml6rm4",
                    "parent_id": "t1_cml0lai",
                    "body": "The girl went after him *because* she saw his embarrassing broadcast with Nadya, if memory serves me right. Purity was deffo not on her boyfriend priority list.",
                    "author": "EnamoredToMeetYou",
                    "created_utc": 1417720129.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cml5w9m",
            "parent_id": "t3_2o9ofv",
            "body": "First off, he (probably) couldn't have lost his virginity to Nadya.  He tried to hook up with her in the first movie, shot his load early twice, and she got sent out of the country when her host family saw the video online.  At the point, he had no reason to think he would ever see her again (or that she would be interested in him), so it made sense to go to prom with Michelle.  At the point, he wasn't even trying to get laid, he just wanted to have a fun prom.  Michelle wanted to hook up with him, and Jim had realized he actually liked Michelle, so he went with it.\n\nNow in the second movie, he had a shot to hook up with Nadya again.  However, he realized that he loved Michelle and would rather make a grand romantic gesture to her and start dating her than to hook up with Nadya.  He made the grand gesture and it worked, and he and Michelle lived happily ever after.\n\nI don't see a point in this series of events where he should have hooked up Nadya.",
            "author": "notdomoduro",
            "created_utc": 1417718650.0,
            "replies": [
                {
                    "name": "t1_cml60ij",
                    "parent_id": "t1_cml5w9m",
                    "body": "Very airtight points.  I guess it would involve a scenario by which Jim kinda of improbably held out hope for Nadya.  While that may be ridiculous, he didn't hold out and in fact she did come back, so the (Hollywood deus ex machina) fate still swung his way.  And again I point out that he wouldn't have risked much since Michelle was mostly about the DTF and even in the second movie she was just more about hooking up.  ",
                    "author": "ADIDASects",
                    "created_utc": 1417718847.0,
                    "replies": []
                }
            ]
        }
    ]
}