{
    "name": "t3_228jbo",
    "title": "The modern summer camp setting is an acceptance circle jerk. CMV",
    "body": "So, I attended summer camp from ages 8-16 and got heavily involved with the camp setting, and have worked most summers in between college semesters up at the camp I grew up at in a managerial capacity.\n\nGrowing up, the emphasis was placed on silly movie cliche's (Think heavyweights, Adams family values, camp nowhere) and the kids having fun, and if you were lucky you took something greater away from it but the goal was to have a good and memorable time. \n\nToday though from my standpoint that culture has been lost in favor of a gigantic acceptance circle jerk. Pranks are no longer allowed because mom's got lawsuit happy but more importantly it's gone because it \"may\" hurt someone's feelings. In my particular case, it's a YMCA camp and while most of the staff is not religious, nor does the camp put heavy emphasis on Christianity in the first place however anything resembling Jesus including ultimately minor campfire song lyrics ect. have been removed because we are attempting not to force people to \"believe something\" Now, I have stated I'm not a religious person, but some of these things are simply a tradition, and the camp setting as a entity is all about tradition and honoring it. Lastly from my personal observations of the newer/younger staff from afar, it's sort of a catastrophic circle jerk, and if you break the jerk you are ostracized by the staff hive mind.  \n\nI don't think this is a good thing for the camp setting. I think kids going up to camp and skinning their knees, physically or emotionally is a good personal growth experience. Camp is a prime example of how adults have to operate in the real world, because sometimes you have to make things work with people you simply don't love or even like, and ultimately there are people that you do not simply HAVE to affiliate yourself with people who you feel are a detriment to your life. \n\nMake no mistake, I don't think there's any room for bullying however; I don't think there's any crime in the boys doing something icky to the girls cabin  vice versa (silly string, shaving cream non damaging stuff that is ultimately harmless, but makes the kids feel accomplished in mischief.)\n\nI think an important part of the culture is lost in the modern camp setting because we're too concerned with protecting the kids instead of giving them a positive but very real exposure to somewhat real life.\n\nPlease CMV.\n\n",
    "author": "championofobscurity",
    "num_comments": 5,
    "created_utc": 1396658078.0,
    "url": "http://www.reddit.com/r/changemyview/comments/228jbo/the_modern_summer_camp_setting_is_an_acceptance/",
    "comments": [
        {
            "name": "t1_cgke088",
            "parent_id": "t3_228jbo",
            "body": "I went to and worked at the same camp for 11 years. From my understanding (and experience), camp is almost purely a social experience. When you are young, it is a social experience where you learn how to become friends with children of your own sex without the aid of your parents. As you get older, it is a social experience befriending (and other activities...) people of the opposite sex. I don't know if this makes camp all about \"acceptance,\" but it definitely makes the camp owners want to foster a friendly environment.\n\nIn regards to pranks, at my camp they used to be condoned; however, the pranks progressed year after year, become more and more vagrant (for lack of a better word). When my camp switched owners, the first year of under new ownership, a particularly ridiculous prank occurred (I wouldn't even call it a prank; some idiots stole candy from the Canteen). It was the owner's first year so he just put out a zero tolerance policy towards pranks and the lot. People still do them, but they are much smaller and more discreet than before. \n\nIn regards to protecting kids, I think a camp should foster a safe environment, especially for younger children. By age 12, most parents are okay if their children get hurt at camp (i.e. when they would get a call from the camp, they would say it happens), but for younger children (ages 8-11) parents were very scared whenever they heard their children were hurt. This is understandable and I this is why I accept trying to make camp a safe environment. At these young ages, camp is literally all about the activities to the kids; when they are older, camp is about the friendships and relationships they make. If the focal point of camp for these younger children doesn't appear safe to a parent considering sending their child there, then the camp would be failing one of its goals. \n\nThat's at least what I think about it anyway.",
            "author": "elev57",
            "created_utc": 1396659457.0,
            "replies": [
                {
                    "name": "t1_cgke5cw",
                    "parent_id": "t1_cgke088",
                    "body": "See, with the youngsters though they're completely uninterested in doing anything prank like in the first place. In my experience they're more concerned with farting in their bunks and falling asleep by 9PM sharp. lol. It's the 12-15 year olds who want to meet a cute girl or give the girls cabin a scare, and it's the 14-17 year olds who are purely concerned with the drama of the situation and want to meet someone instead of do activities.\n\nI think a big problem with the setting is the advent of the ACA. I think personally that has been the biggest determent to the modern camp setting. It's brought in this idea of \"Camp that is corporate\"",
                    "author": "championofobscurity",
                    "created_utc": 1396659856.0,
                    "replies": [
                        {
                            "name": "t1_cgkelv3",
                            "parent_id": "t1_cgke5cw",
                            "body": "This past summer I was a counselor for the second youngest group of campers. You pretty much nailed it on the head with their behavior. I only have one exception: When I was an OD (on duty at night if you don't use that term), I would never make my kids go to sleep. I would just say \"Flashlight time is for as long as you want. Go to bed when you get tired.\" Most kids would fall asleep right away. Others would stay up a few extra hours and I would tell them to go to bed. They would go right to bed and be tired the next day and would not stay up late again. If I ever ended flashlight time early, the kids would never go to bed. If you are a counselor and ever have this problem, I recommend doing what I did. \n\nFrom my own experience as a camper, my friends and I (when we started hanging out with girls) never wanted to prank them: we just wanted to hook up. We would sneak out at night and go to their bunk, but we wouldn't prank them (I don't really see the point in that now or then). When we did pranks, we just fucked with the camp owners. We would release all the kayaks on the lake, or switch the soccer and hockey goals (they were very far away), throw all the tennis balls in the pool, etc. Pranking the owners was the best because everyone (except the owners and senior staff) thought it was funny. But other than pranks like that, we would just prank each other sometimes, but never the girls.\n\nMore importantly, I think 2 things really damage the camp experience: 1) the ACA (having an accredidation board is good, but sometimes they go too far and its really annoying); 2) Electronics. When I went to camp, I had a flashlight and a gameboy. Now kids bring iTouches. One kid I had never wanted to leave the bunk. We had to confiscate his iTouch (and other electronics) so he would have to leave the bunk and do activities. He cried and had a tantrum so we sent him to the HQ. The head counselor couldn't calm him down at all. This went on for like 3 hours. Eventually we had to call his parents. The call was on speaker. It went basically like this:\n\n(Little Kid Crying) \"MOM! THEY STOLE MY ITOUCH\"\n(Mom, confused) \"Who stole your iTouch\"\n(LITTLE KID) \"ELEV57 and my co-counselors\"\n(Mom, still very confused) \"Your counselors?\" This was after visiting day so she had already met all of us and thought we were great.\n(Little kid tries to respond, but head counselor cuts him off) \"Hello, Mrs. Mother of Little Crying Kid. This is the Head Counselor. Your child wouldn't leave the bunk so his counselors took his electronics so he would participate with the others.\"\n(Mom, annoyed) \"Is this true, little crying kid?\"\n(Kid, scared, mumbles) \"A-huh...\"\n(Mom, mad) I won't write it here, but she went off on her kid for lying, wasting her money, and not making use of his camp time. \n\nThe kid promptly shut up and someone took him to the activity. We ended the call. When the kid left, we all broke out laughing.\n\nBut, yeah, electronics are killing camp as well.",
                            "author": "elev57",
                            "created_utc": 1396661137.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cgkkbrb",
            "parent_id": "t3_228jbo",
            "body": "Oh man did you and I have different experiences. I went to the same camp for 4 summers and then worked there for one. That was 4 years ago. My brother went there too so I visited the two years after I worked. It was an all-guys sports camp, and it was everything your camp wasn't. \n\nThe camp used to be predominately Jewish, so jokes are made every time something jewish-related comes up. We made fun of the one black kid in our bunk because he was the best basketball player at the camp. We threw water balloons into the younger kids' cabins, snuck away from camp to buy ice cream, basically anything middle school guys could think of. And our counselors were all college kids, mostly college athletes, so what did they care? They took part, and even encouraged most of our behaviors. The oldest kids in the camp are 15, yet there were more sex jokes told by the counselors than you could shake a stick at. Only the winners got trophies, and everyone else sucked it up. Later we learned our parents called the camp Wi-No-Rules (a pun on the name of the camp) because of all this. And from the camps we visited to play sports against, we got very similar stories and vibes. \n\nBut we had the greatest time in the world and every senior cried the last night of camp.\n\nBasically, I don't know what camp you went to, but I can assure you that they aren't all like that.\n\nEDIT: We spent 90% of the time fairly well behaved, I'm only providing examples of camp not being a giant circlejerk. I'm not trying to say the whole place we racist, sexist and mean, because it wasn't. But we had a hell of a time.",
            "author": "klawehtgod",
            "created_utc": 1396679323.0,
            "replies": []
        },
        {
            "name": "t1_cgkknkp",
            "parent_id": "t3_228jbo",
            "body": "&gt; I think an important part of the culture is lost in the modern camp setting because we're too concerned with protecting the kids instead of giving them a positive but very real exposure to somewhat real life.\n\nCamp is not real life whatsoever, and if we convince children that it resembles real life then they are going to be very disappointed once they grow up.",
            "author": "[deleted]",
            "created_utc": 1396680849.0,
            "replies": []
        }
    ]
}