{
    "name": "t3_24i4jc",
    "title": "CMV: I believe that keeping my check register up to date is unnecessary.",
    "body": "I have had a checking account for about 6 years now, and a debit card for that account for about 3 years. When I got the debit card, I also figured out how to access the account online. Because it is so easy to access this account, I have been able to keep a rough mental approximation of my account balance this entire time. I get online to check it about two to three times a week out of habit. Because of this, I see no reason to tediously write down every single transaction that I make with my debit card. Give me some good reasons to keep my check register up to date so my mother will stop nagging me about it.\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "ithinkiamaps",
    "num_comments": 3,
    "created_utc": 1398991365.0,
    "url": "http://www.reddit.com/r/changemyview/comments/24i4jc/cmv_i_believe_that_keeping_my_check_register_up/",
    "comments": [
        {
            "name": "t1_ch7cvu3",
            "parent_id": "t3_24i4jc",
            "body": "My most recent high school reunion was canceled due to lack of interest. The senior class president, who is in charge of organizing reunions, had to write a refund check to everyone who had already purchased a ticket. I know that at least 50 people paid for tickets. So that means she has 50+ checks floating around out there for over $1,000. These checks do not show up on your online account statements until they have been cashed or deposited. \n\nYou might think people would go deposit these checks right away, but people are weird. Sometimes people wait weeks or even months to deposit a check. They just keep forgetting or something, I don't know. Anyway, that is a long enough time that you can't keep a rough mental record of what checks have been cashed and what checks are still out there. \n\nAlso, you have no control over *when* the checks get cashed. With your debit card, you know if you are running low. So you know not to use it. If you are running low and 10 people decide to cash their checks at once, you will get slammed with bounced check fees. \n\n----\n\nedit: It might not seem like a big deal now, but I write a lot more checks now that I am out of school. ",
            "author": "mrg58",
            "created_utc": 1398992766.0,
            "replies": [
                {
                    "name": "t1_ch7ddwy",
                    "parent_id": "t1_ch7cvu3",
                    "body": "I guess I should add that the only time I use the check register is when I write a check, which does not happen very often due to the convenience of the debit card. How does this change my situation?",
                    "author": "ithinkiamaps",
                    "created_utc": 1398993917.0,
                    "replies": [
                        {
                            "name": "t1_ch7p0mo",
                            "parent_id": "t1_ch7ddwy",
                            "body": "For the past 10 years or so, I keep 2 checking accounts.  One of them is for checks (acct a), the other for my debit card (acct b).\n\nWhen I pay bills or write checks, I cover them by transferring money from account b.  I pay close attention to account b online, making sure that there's nothing I don't recognize and that everything I've done shows up.  I check this every day.\n\nI haven't kept a register in all that time, and never bounced a check.\n\n",
                            "author": "jcooli09",
                            "created_utc": 1399036801.0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}