{
    "name": "t3_2zroxp",
    "title": "CMV: Goku is an awful father.",
    "body": "It always seems to me like Goku is portrayed in such a positive, heroic light. I do not agree with this. Goku seems to enjoy fighting and I believe he actively tries to instill this in his children. Particularly during the Cell saga when, not only is willing to push his son into fighting the most dangerous foe they had ever faced, and chose to not help him in the fight, and keep others from aiding Gohan, and still watch as Gohan is being beaten and crying in front of him. To top all this off, instead of at least having Gohan fight Cell in Cell's current state, he goes as far as to assist the person that could kill his son by giving Cell a sensu bean. This is neglectful, dangerous parenting that holds no benefit, and Goku is only interested in showboating how tough his son is, at the risk of his son being murdered. Please change my view.\n\nTL;DR I believe Goku is a bad father because he is a showboating, childish person who values fighting to such a degree that he is willing to endanger his sons life by healing the opponent, and keeping others from aiding his son.",
    "author": "greyhoodedbryan",
    "num_comments": 19,
    "created_utc": 1426904627.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2zroxp/cmv_goku_is_an_awful_father/",
    "comments": [
        {
            "name": "t1_cpltkbs",
            "parent_id": "t3_2zroxp",
            "body": "&gt; Goku seems to enjoy fighting and I believe he actively tries to instill this in his children.\n\nDon't all fathers try to instill their joys into their kids.\n\n&gt;  Particularly during the Cell saga when, not only is willing to push his son into fighting the most dangerous foe they had ever faced\n\nBecause he knows that he is the only one who can defeat him.\n\n&gt; and chose to not help him in the fight, and keep others from aiding Gohan, and still watch as Gohan is being beaten and crying in front of him.\n\nBecause he knows he won't be around forever and thus Gohan needs to reach his potential.\n\n&gt; he goes as far as to assist the person that could kill his son by giving Cell a sensu bean.\n\nGoku has connections with everyone in charge of the afterlife so a risk of death is practically non-existent for Gohan.",
            "author": "[deleted]",
            "created_utc": 1426918219.0,
            "replies": [
                {
                    "name": "t1_cplz8n8",
                    "parent_id": "t1_cpltkbs",
                    "body": "With the whole Cell beating up Gohan and Goku assisting him it should be further explained to people not as familiar with DBZ. Gohan is half alien, he's not a normal human. As a saiyan (his alien race) it is a net gain to get beaten up. They become stronger through physical endurance. OP is viewing their relationship through a very human centric view point, as others have stated Gohan has never died, so worst case he can be resurrected twice, which would only further increase his strength. \n\nOP also fails to mention the very start of DBZ Goku sets out to sacrifice himself to save his kidnapped son. Everything Goku does is to protect Earth and his friends. Even if he isn't there all the time it's a sad reality that his training took precedent so he could be able to protect his family. After Gohan beats Cell Goku refuses to be resurrected in order to dissuade people from putting Earth in danger to challenge Goku. While Goku was certainly neglectful, everything he did was to protect the one he loved.",
                    "author": "lalilulelo09",
                    "created_utc": 1426945029.0,
                    "replies": [
                        {
                            "name": "t1_cpm4kuv",
                            "parent_id": "t1_cplz8n8",
                            "body": "Apologies for responding well after the 3 hour rule, a game of Mario Kart DUI took over my night. After reading all the responses, yours I find most persuading in that he is thinking about the entire world (though I fail to see how healing the person threatening the world is supposed to help protect it). But I agree that I am viewing it through human goggles and that's my biggest mistake so a ∆ goes to you my friend.",
                            "author": "greyhoodedbryan",
                            "created_utc": 1426957435.0,
                            "replies": [
                                {
                                    "name": "t1_cpm4qve",
                                    "parent_id": "t1_cpm4kuv",
                                    "body": "Confirmed: 1 delta awarded to /u/lalilulelo09.\n\n[^lalilulelo09's ^delta ^history](/r/ChangeMyView/wiki/user/lalilulelo09) ^| [^delta ^system ^explained](/r/ChangeMyView/wiki/DeltaBot)",
                                    "author": "DeltaBot",
                                    "created_utc": 1426957766.0,
                                    "replies": []
                                },
                                {
                                    "name": "t1_cpm4zcb",
                                    "parent_id": "t1_cpm4kuv",
                                    "body": "For strengthening cell, it meant Gohan would become stronger again. Most of Goku's training on his way to Namek was him shooting himself, healing up and shooting himself again. All while under constant stress from increased gravity. The stronger the physical endurance they survive, they stronger they become. In training to fight the androids and cell Goku/Gohan and Vegeta/Trunks quite literally beat each other up to increase their strength in a cyclical fashion.\n\nCell was the strongest thing they had fought, thus would be the greatest improvement for Gohan. As for threatening the world, consequences are actually very low in the DBZ world, they always had the Earth set and Nakemian set of dragon balls to wish people/the planet back.",
                                    "author": "lalilulelo09",
                                    "created_utc": 1426958232.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cpltorr",
            "parent_id": "t3_2zroxp",
            "body": "He's pushing his son because, contrary to the sayans that stayed behind, he like people and feels that it is their duty to protect Earth if they can, and he knows they can if they experience pain and a near death.",
            "author": "MahJongK",
            "created_utc": 1426918657.0,
            "replies": []
        },
        {
            "name": "t1_cplubov",
            "parent_id": "t3_2zroxp",
            "body": "You might not realize this, but you are touching on an important debate in parenting circles. There are a few types of parents:\n\n1. Parents who don't spend time with their kids. Kids end up trying to seek approval and love from their absent parent(s) and end up with very low self-esteems (e.g. \"daddy issues.\")\n\n2. Overprotective helicopter parents. These parents cushion their kids from the real world. If their kid gets a B, they are the first ones at school yelling at the teacher. Their kids end up weak because they are never challenged in the real world.\n\n3. Self-esteem boosting parents. These are the parents that always praise their kids. \"It's ok if you don't win, as long as you tried your best.\" These are the parents that make sure every kid gets a trophy. They believe that self-esteem leads to success.\n\n4. Tiger mom's. These, often Asian, parents constantly challenge their kid to be successful. Their child must study right after school, then practice the piano for hours before dinner and bed. They must always get straight A's. They must always challenge themselves.\n\nGoku is something of a tiger dad. He doesn't believe in cushioning Gohan. He believes that Gohan is incredibly strong and tough. He knows that the only way Gohan will realize this is if he is challanged, not in safe and manufactured situations, but in the real world when faced with real consequences. Tiger parents believe that success leads to self-esteem. They don't believe in telling their kids that they are smart, they demand their kids get A's so their kid realizes that they are smart on their own.\n\nAt the same time, Goku isn't an obnoxious tiger dad. He is very friendly and lenient with Gohan most of the time. But when it really counts, Goku challenges Gohan to succeed, and is always right behind him to catch him if he falls. This might just be an Asian parent vs. American parent debate, but I tend to side with Goku.",
            "author": "McKoijion",
            "created_utc": 1426921072.0,
            "replies": [
                {
                    "name": "t1_cplziwo",
                    "parent_id": "t1_cplubov",
                    "body": "I wouldn't call Goku a Tiger father by any stretch. He is often the one seen pressuring Chi Chi to just let Gohan have fun.",
                    "author": "MrTyninja",
                    "created_utc": 1426945933.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cpluhpn",
            "parent_id": "t3_2zroxp",
            "body": "&gt;chose to not help him in the fight, and keep others from aiding Gohan, and still watch as Gohan is being beaten and crying in front of him\n\nHis mother would keep him locked up safe forever, where he'd never learn that there are some things in life that are painful, and difficult, and that you'd wish you had more help for.  If Goku saved him from everything, he'd never learn to prove himself *to himself*, which is what he really needed.  Look at afterwards, Gohan decides to pursue studying, while also still doing hero-stuff, he's way more confident than the little kid Piccolo trained.  \n\nAlso, Goku might've been trying to instill a sense of honor in Gohan with the senzu bean thing.  Remember, when Goku first turned into a Super-Saiyan, he had to have somebody take away *his own son* because he couldn't tell what he'd do.  For how much of a doofus he is, he still would've thought about how dangerous Gohan could potentially be if he lost it.  ",
            "author": "LaoTzusGymShoes",
            "created_utc": 1426921762.0,
            "replies": [
                {
                    "name": "t1_cplwg2z",
                    "parent_id": "t1_cpluhpn",
                    "body": "&gt; Remember, when Goku first turned into a Super-Saiyan, he had to have somebody take away his own son because he couldn't tell what he'd do.\n\nAnd Gohan does the same when he goes SSJ2, he is unnecessarily cruel to cell to the point where it almost costs him the fight. It seems from the canon that going up a level on being a super saiyan initially leads to some of the negative saiyan traits coming out in the person. Perhaps Goku feels that it is the positive virtues such as honor, mercy, etc. which allow a saiyan to overcome the tendency to give into the rage of a super saiyan transformation.",
                    "author": "[deleted]",
                    "created_utc": 1426932079.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cplv4pb",
            "parent_id": "t3_2zroxp",
            "body": "I think it insinuates that goku knows that gohan is stronger than him and as such has the best chance at beating cell. Either that or goku knows that gohan can reach super sayan 2 but needs to be pushed to get there",
            "author": "draculabakula",
            "created_utc": 1426924681.0,
            "replies": []
        },
        {
            "name": "t1_cplydhh",
            "parent_id": "t3_2zroxp",
            "body": "First of all, Saiyans are biologically programmed to fight and test their skills in battle against the strongest opponents. This is why Goku always let's his enemies power up to their fullest even though he can sometimes finish them earlier. A Saiyans need for combat is greater than even their need for survival. \n\nSecondly, Goku knew that he couldn't beat Cell. And Goku could sense that gohan was stronger than himself, and that gohan had the hidden potential to go ssj2 (which I believe at that point was only theatrically possible). But such an exceptional transformation requires a massive push, especially since gohan had always been somewhat of a reluctant fighter. Goku fight cell in his weaker stages, and loses. Goku knows he can't win, but he has to lose for gohan. His entire life gohan had seen his father beat every challenger no matter what he odds.  Gohan needed to see that Goku wasn't going to be able to bail him out. It was all a calculated move by Goku to have gohan reach his potential as a warrior.\n\nSo is Goku a bad father? He trains his son (teaches his son the skills he needs to succeed), he then motivates him to succeed and is loving and supportive throughout the entire situation. \n\nMy memory is fuzzy, but doesn't Goku sacrifice his life so that gohan can find the inner strength to tap into his potential? ",
            "author": "Gygsqt",
            "created_utc": 1426941980.0,
            "replies": [
                {
                    "name": "t1_cpm5rt3",
                    "parent_id": "t1_cplydhh",
                    "body": "Nah, the only calculated thing about fighting Cell was giving Gohan the advantage of seeing Cell fight ahead of time. If he needed Gohan to see him lose, he wouldn't of quit mid-fight while he still had energy left. Also, Goku sacrifices himself to prevent Cell from taking the planet with him upon self-destructing.\n\nPiccolo was right when he called Goku out on that shit. He wasn't being some noble self-sacrificing hero. As far as Gohan was concerned, his father gave up and refused to step in to help even when he was inches from death. \n",
                    "author": "Glitterandpie",
                    "created_utc": 1426959799.0,
                    "replies": []
                },
                {
                    "name": "t1_cpmoilf",
                    "parent_id": "t1_cplydhh",
                    "body": "Goku gave Cell a senzu bean but letting Gohan fight him...",
                    "author": "Man_of_Sin",
                    "created_utc": 1426998991.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cpm1b9f",
            "parent_id": "t3_2zroxp",
            "body": "I think everything you are saying is entirely undermined by a single sentence.\n\nWith great power comes great responsibility.",
            "author": "Unconfidence",
            "created_utc": 1426950661.0,
            "replies": [
                {
                    "name": "t1_cpmoklh",
                    "parent_id": "t1_cpm1b9f",
                    "body": "Giving Cell a senzu bean was utterly irresponsible.",
                    "author": "Man_of_Sin",
                    "created_utc": 1426999134.0,
                    "replies": [
                        {
                            "name": "t1_cpmtijj",
                            "parent_id": "t1_cpmoklh",
                            "body": "Goku knew what needed to happen, and it worked.  There was only one shot at victory, he took it, and put his faith in his son.\n\nIt's also quite feasible that Goku figured there would be future challenges other than Cell, and wanted to make sure Gohan would be ready to protect the earth in his stead if need be.",
                            "author": "Unconfidence",
                            "created_utc": 1427018223.0,
                            "replies": [
                                {
                                    "name": "t1_cpnb1u9",
                                    "parent_id": "t1_cpmtijj",
                                    "body": "Giving Cell that bean didn't really helped them, just made things harder.\n\nIt resulted in his death. Gohan stopped training after that away, leading him to get weaker. ",
                                    "author": "Man_of_Sin",
                                    "created_utc": 1427060293.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}