{
    "name": "t3_2b3p94",
    "title": "CMV: I believe that if you have moderate/severe acne, no one will find you attractive.",
    "body": "First of all, I'd like to say that I myself am an 18 year old male, and I do suffer from acne. Recently, it's been getting better, but before it wasn't looking so good.\n\nSo my belief is that if you've got a bunch of acne and/or scars on your face, no one will find you attractive. I believe that looks aren't everything, but I think they're a big chunk of how you are seen. With horrible looks due to having acne, there's no way that life can be great for you until you find some way to clear it all.\n\nI am aware that 80-90% of the population has to deal with acne, but of all those people, probably 90% of them have like a pimple a year or something. I'm not talking about those people being unattractive. I'm talking about the other 10% or whatever that have it REALLY bad.\n\nAlthough I think the occasional couple of pimples is ok, I don't think I could see myself dating someone with a face full of pimples. Likewise, I don't see anyone that would want to be with me because of the acne on my face.\n\nWould someone change my view and prove to me that you can still be seen as attractive even with acne? I would really like to change my mindset right now.... and I promise to read through anything and everything posted here. Thank you!\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "Resmell",
    "num_comments": 28,
    "created_utc": 1405737522.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2b3p94/cmv_i_believe_that_if_you_have_moderatesevere/",
    "comments": [
        {
            "name": "t1_cj1jb17",
            "parent_id": "t3_2b3p94",
            "body": "Well, I have moderate/severe acne and I've had a boyfriend who found me attractive. I've had random hookups and messages with people who found me attractive. Not sure what else there is to say.",
            "author": "ReOsIr10",
            "created_utc": 1405742438.0,
            "replies": []
        },
        {
            "name": "t1_cj1jcqk",
            "parent_id": "t3_2b3p94",
            "body": "I would argue that attractiveness is so subjective that who the hell are you to try and say what nobody else will be attracted to? You can't truly understand why anybody would be attracted to someone with acne any more than you can truly understand why [that tribe in Burma find those neck rings attractive.](http://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Kayan_woman_with_neck_rings.jpg/180px-Kayan_woman_with_neck_rings.jpg)\n\nThe reason for that is because you aren't attracted to those things, so on a direct level you don't understand why somebody else would be. You have to just realize that different people like different things, and that other people's likes and desires are no less valid than yours. \n\nYou said *you* can't see *yourself* dating somebody with lots of acne.  And *you* couldn't see anybody dating *you* because of your acne. And how is this proof that NOBODY would date someone with acne? You are not everybody. Whose to say you aren't just insecure about your acne? I don't know what gender you are, but I know that for both genders confidence is extremely attractive to a lot of people. I'm not into fat girls, but an overweight person who is confident in themselves and their body gets bumped up a few points for me. So maybe it's not the acne itself that makes someone unattractive, but how they carry themselves because it's something that makes them stand out, and that's something for an insecure person to latch on to. \n\nI'm not saying this is true for you, but it could be true for plenty of people. And it's not just about acne, it's about anything that could be considered \"abnormal\" in appearance. ",
            "author": "discipletr",
            "created_utc": 1405742568.0,
            "replies": []
        },
        {
            "name": "t1_cj1jfd0",
            "parent_id": "t3_2b3p94",
            "body": "The thing about that statement is that you need only one person out of 7 billion to find people with moderate to severe acne attractive for your view to be false.\n\nIf you mean most people don't find people with moderate to severe acne attractive well that's subjective. Attractiveness varies according to region, culture and personal preference.\n\nIf you mean you don't find people with moderate to severe acne attractive, well that isn't really /r/ChangeMyView territory. Personal preference is hard to change.",
            "author": "AccountHaver25",
            "created_utc": 1405742777.0,
            "replies": []
        },
        {
            "name": "t1_cj1kf92",
            "parent_id": "t3_2b3p94",
            "body": "Really?  Must say that one surprises me.  Don't usually respond to these posts as I am not a persuasive writer, but that one just hasn't been my experience, so I hope you don't mind my trying to answer.  \n\nCan understand it being tough; anything on your face can seem daunting.  Now I am old and wrinkly my face looks like an elephant sat on me.  But in my experience, and when I was young I was va va voomish, acne has never been a barrier to attractiveness.  \n\nWhen I read your post my first thought was of the dashing Philip Glenister, as only yesterday I was watching a show starring Glenister and enjoying his good  looks.  But then it occurred to me that I spent most of my twenties in love and living with a fellow with severe acne.  This made me laugh and decide to write to you as I didn't even think of this when I read your post.\n\nThe fellow I loved is a good tenor and enjoyed drawing cartoons, and has a range of other attributes I'd remember long before his skin problems.  \n\nWhen I was twenty-one I visited a share house where he was living.  We had known each other for some time, and I was visiting to listen to the New Zealand hour with my friends.  This was a radio show on Triple Zed in Brisbane, Australia, at the time, and for most of the show they would play great stuff from the Flying Nun Record label.  \n\nI remember walking down the creaking corridor of this old Queenslander, and this fellow's door was open and I saw a glimpse of part of his leg.  The part with the knee.  He was curled up under a doona on his bed reading.  Damn near swooned.  Such a strong visceral reaction.  Giddy stuff.  Had never thought of him that way, and when I hung around after the radio show, he drew a circle on my arm with his finger.  What else could I do?  I was a goner.  The other clear memory I have of him at that time is of the two of us at night walking down the street while he sang me ballads.\n\nHere I am years later with tears in my eyes thinking of that handsome fellow.  He was so very attractive to me, and to others.  Wish I could persuade you and change your mind because that just hasn't been my experience at all.\n\nNow I think of it another fellow who knocked my socks off had acne scars - I didn't get to know him during his acne phase.  The most vibrant and dynamic fellow I've met so far.  Really just lights up places to the point of craziness.  He is now a top chef in England.  He shared with me once that when he was in high school he was shy because of his acne.  I know how lucky I am to have met him because I get anxious and worried about things and he really does live well, sucking it all dry.  Find him inspiring.  Wish very much I'd won his heart forever, but I am lucky we crossed paths as we did.  \n\nIn addition, and relevant to your post, he is hands down one of the most handsome men I've met.\n\nWish I could be more eloquent, and I wish you the best luck in the world with your adventures of the heart.",
            "author": "Flying-Fox",
            "created_utc": 1405745563.0,
            "replies": []
        },
        {
            "name": "t1_cj1l2ax",
            "parent_id": "t3_2b3p94",
            "body": "My girlfriend has some pretty severe acne.  She has some pretty bad acne scarring on both of her cheeks... and I find her to be a genuine 7/10.\n\nIn fact, she's asleep right now, behind me, and *we just had sex!* \n\nYou're 18.  As a good rule of thumb, when you're a teenager, your opinions and feelings (especially when they come to how you view yourself) are pretty off the mark.  ",
            "author": "[deleted]",
            "created_utc": 1405747443.0,
            "replies": [
                {
                    "name": "t1_cj1pi15",
                    "parent_id": "t1_cj1l2ax",
                    "body": "if your gf has severe acne, then please take her to the derm if you really care about her. trust me. she will thank you later on.",
                    "author": "Galahad_Lancelot",
                    "created_utc": 1405767467.0,
                    "replies": []
                },
                {
                    "name": "t1_cj1v09z",
                    "parent_id": "t1_cj1l2ax",
                    "body": "\n&gt; you're a teenager, your opinions and feelings (especially when they come to how you view yourself) are pretty off the mark.\n\nThis is a solid advice to every teenager related issue. I was told this when I was a teenager, but I didn't buy it. Took me a few years to realize that it's so true. ",
                    "author": "iushiush",
                    "created_utc": 1405787648.0,
                    "replies": [
                        {
                            "name": "t1_cj1y6z1",
                            "parent_id": "t1_cj1v09z",
                            "body": "Know what's funny?\n\nThat really applies to everyone's opinion of themselves.",
                            "author": "[deleted]",
                            "created_utc": 1405795465.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cj20i76",
                    "parent_id": "t1_cj1l2ax",
                    "body": "Either you find her personality attractive or the acne isn't that bad.\n\nBtw this is anecdote, which should be taken with a grain of salt.",
                    "author": "[deleted]",
                    "created_utc": 1405801205.0,
                    "replies": [
                        {
                            "name": "t1_cj21mw3",
                            "parent_id": "t1_cj20i76",
                            "body": "Well I mean... You can't have a relationship with someone without finding their personality attractive... But I definitely bang her with the lights on.\n\n",
                            "author": "[deleted]",
                            "created_utc": 1405803994.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cj1lhpg",
            "parent_id": "t3_2b3p94",
            "body": "Skin complexion doesn't affect attractiveness as much as bone structure. Take the most attractive celebrity you can find and photoshop a few pimples on their face. Now compare that to someone with beady eyes, a long rectangle face, a hard protruding brow line, a gummy smile, and a double chin.\n\nPoor complexion might not be as attractive as perfect complexion, but it doesn't play a role in attraction as much as bone structure and a healthy weight.",
            "author": "Prof_Acorn",
            "created_utc": 1405748746.0,
            "replies": [
                {
                    "name": "t1_cj1mlgb",
                    "parent_id": "t1_cj1lhpg",
                    "body": "&gt; a few pimples on their face.\n\nThe point OP is making strongly distinguishes between the average few pimples, and an entire face full of exploding. \nWhile obviously people can still find people attractive despite most flaws, I think it would be silly to think that serious problem acne doesn't seriously detract from people's attractiveness.  ",
                    "author": "kairisika",
                    "created_utc": 1405752462.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cj1m9xa",
            "parent_id": "t3_2b3p94",
            "body": "I had severe acne and got a stunning girl to fall for me. \n\nIts rare but it happens. ",
            "author": "AbsolutelyCone",
            "created_utc": 1405751313.0,
            "replies": []
        },
        {
            "name": "t1_cj1mc69",
            "parent_id": "t3_2b3p94",
            "body": "You can't make such a subjective claim without it simply being incorrect. Acne is generally unattractive to most people, but attitude and confidence can completely override it in most cases. On top of that, most people get through it or just grow into it. Scarring can cause issues with hair growth and whatnot, but it's otherwise not a huge determining factor of whether or not a person is attractive. Skin condition is only one variable.",
            "author": "AKnightAlone",
            "created_utc": 1405751538.0,
            "replies": []
        },
        {
            "name": "t1_cj1n7b0",
            "parent_id": "t3_2b3p94",
            "body": "I don't know if I can really prove it to you. But just go look around, check out /r/popping or some of the famous BBW porn stars. To me some of these people are fucking hideous disgusting people both physically and in their character. However they have thousands of fans who would do nearly anything for them and find them attractive.\n\nMy point is people are weird, you'll never understand how someone can find someone else attractive. But you don't need to understand their standards or think the way they do. So yeah, acne, and acne scars aren't nearly as bad as you think and while it truly is hard to get your head around some people really just don't care.",
            "author": "RocketMan63",
            "created_utc": 1405754947.0,
            "replies": []
        },
        {
            "name": "t1_cj1plx1",
            "parent_id": "t3_2b3p94",
            "body": "A friend of mine met and married his missus after burns to most of his body. When we're all out people stare. His eyes look like they're in different places, he has a kind of melted look, almost no hair on his entire head. Look mate, at 18 most people think they're fugly, here's a tip, no one pays as much attention to how you look as you. You can't really change it either, diet and exercise only go so far, so get over it. Stop comparing yourself to every airbrushed model you get bombarded with. \n\nAs a wide note my acne cleared up when I dropped sugar and wheat for three months. Try playing with your diet or even lifestyle to see what happens.",
            "author": "dumblederp",
            "created_utc": 1405768117.0,
            "replies": [
                {
                    "name": "t1_cj1qh1x",
                    "parent_id": "t1_cj1plx1",
                    "body": "My younger brother has burn scars over 50% of his body. He also grew up with severe acne. Despite all that, he married the prettiest cheerleader at school.",
                    "author": "Mange-Tout",
                    "created_utc": 1405772904.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cj1q5xk",
            "parent_id": "t3_2b3p94",
            "body": "I have moderate acne, but other than that I have been told that I am pretty attractive. Yes it is one of my bad qualities, and it probably puts my \"attractiveness score\" down a bit, but only by a bit.\n\nSevere acne might be a problem, but with a little bit of extra care, it can be remedied more easily than most people think.",
            "author": "BlankTrack",
            "created_utc": 1405771331.0,
            "replies": []
        },
        {
            "name": "t1_cj1qf2l",
            "parent_id": "t3_2b3p94",
            "body": "I had severe acne when I was a teen and still have some scarring from it. I was called \"Pizza Face\" by schoolmates. I was also completely clueless as far as dating and girls was concerned. Despite that, I still managed to lose my virginity at fifteen, and had sex with several other girls before I graduated High school. \n\nIf what you say is true, then how did I have so much success? Obviously my acne was not enough to scare off the women. ",
            "author": "Mange-Tout",
            "created_utc": 1405772633.0,
            "replies": []
        },
        {
            "name": "t1_cj1ql17",
            "parent_id": "t3_2b3p94",
            "body": "Just an anecdote, but I think moderate acne can be hot.",
            "author": "kuury",
            "created_utc": 1405773439.0,
            "replies": [
                {
                    "name": "t1_cj1thx2",
                    "parent_id": "t1_cj1ql17",
                    "body": "Well hi there",
                    "author": "pitbullpride",
                    "created_utc": 1405783680.0,
                    "replies": [
                        {
                            "name": "t1_cj1u0k6",
                            "parent_id": "t1_cj1thx2",
                            "body": "Wink wink, nudge nudge.\n\nSeriously, though, it's kinda like freckles but red. Super cute.",
                            "author": "kuury",
                            "created_utc": 1405785070.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cj1sn28",
            "parent_id": "t3_2b3p94",
            "body": "at school i had a crush on someone with acne...",
            "author": "Flower-Hour",
            "created_utc": 1405781171.0,
            "replies": []
        },
        {
            "name": "t1_cj1ta76",
            "parent_id": "t3_2b3p94",
            "body": "When we started dating, my boyfriend had acne! I thought he was super hot, not only because of his looks and personality, but because he didn't care what other people tought about it! It's not like he could've done something to make it disappear right away (besides accutane-like treatments of course). That made me look beyond it. Actually, I didn't even see it anymore! And now, it's better so... hang in there! :)\n\nedit: words",
            "author": "MrsRox",
            "created_utc": 1405783080.0,
            "replies": []
        },
        {
            "name": "t1_cj1taks",
            "parent_id": "t3_2b3p94",
            "body": "I'm 24, have moderate acne (used to be severe, but I've grown out of the worst of it, however I have PCOS so my acne is extraordinarily difficult to deal with - I've been going to the dermo since I was about 11), and I'm getting married in September.  For example, [here are some photos](http://imgur.com/a/eSCT1) I took of my acne last winter, but note that I actually have tinted moisturizer on in this photo so it cuts down on the redness a bit.  This is about an average day for me, although slightly unusual in that there aren't any huge pimples (I've usually got at least one).  I'd take some photos now, but I've already put on makeup for the day.\n\nNow, I'm not saying I'm uber beautiful, but my fiance evidently finds me attractive, even in the morning with bad breath, no makeup, and awful hair.  He thinks I'm sexy, and that's awesome.",
            "author": "KestrelLowing",
            "created_utc": 1405783109.0,
            "replies": []
        },
        {
            "name": "t1_cj1tjm0",
            "parent_id": "t3_2b3p94",
            "body": "I had terrible acne as a teenager. I had girls all over me for my sense of humor, personality, and strength in character. I was in leadership in high school marching band. Not every girl was interested in me, but I gave them reasons to like me. They saw through my acne for the guy they wanted to bang.\n\nI didn't actually lose my virginity until I was like 23 (long after it cleared up) but that is neither here nor there. LOL What I am saying is that it is but one aspect and can be overcome.",
            "author": "actualsnow",
            "created_utc": 1405783808.0,
            "replies": []
        },
        {
            "name": "t1_cj1w1xf",
            "parent_id": "t3_2b3p94",
            "body": "It gets better. Hang in there! Try Accutane. \n\nAnd my boyfriend finds me attractive. I also dated other people before meeting my boyfriend years ago. All of them seemed to find me plenty attractive; they said so anyway. Yet I had really bad acne, and only Accutane helped.\n\nFinally... what about *your momma*?? In general, you've heard the term \"my mom thinks I'm special.\" Well you didn't specify -- so moms tend to always think their kids are attractive. ",
            "author": "[deleted]",
            "created_utc": 1405790264.0,
            "replies": []
        },
        {
            "name": "t1_cj20rt3",
            "parent_id": "t3_2b3p94",
            "body": "Seal was married to Heidi Klum. Delta please.\n\n**edit** oh fuck, that was lupus.",
            "author": "[deleted]",
            "created_utc": 1405801851.0,
            "replies": []
        }
    ]
}