{
    "name": "t3_2eyfoa",
    "title": "CMV: [SPOILERS] I think all the hate towards Arvo in The Walking Dead Game is overblown.",
    "body": "SPOILERS FOR ANYONE WHO HASN'T PLAYED EPISODES 4 AND 5 of THE WALKING DEAD GAME SEASON 2. SERIOUSLY DON'T READ THIS IF YOU HAVEN'T PLAYED IT.\n\n---  \n\nSo, to those of you who played the latest episodes, you know who Arvo is. He's the Russian kid whose group you get into a shootout with. Clementine ends up shooting his reanimated sister, much to his horror. He's then led around by an abusive Kenny who beats him *twice*. The first time in the woods was completely unnecessary, and the second time was too (he didn't lie about the food or the house - and Luke's death was gonna happen anyways).  \n\nBy that point in the game, *everyone* was afraid of Kenny. He was clearly teetering on the edge of sanity, and Jane even mentions how Clementine may be the only one who can bring him back before he totally loses it.  \n\nSo when he shoots Clementine, *everybody lost their shit.* IIRC he was voted the most hated character this season, even moreso than Carver. [There's even a whole sub dedicated to his hate now.](http://www.reddit.com/r/fuckarvo) A lot of it is just circlejerking, but reading the discussion of these latest episodes on the net shows that a lot of people really did hate the kid for it.  \n\nBut I think they're missing something really important...something Telltale Games seemed to spent a really long time trying to hammer into our heads.  \n\nAfter Clementine was shot and started dreaming about the RV ride with Lee, Clementine asks Lee \"why Lilly shot Carley (or Doug, depending on your playthrough)\" and Lee mentions how Lilly \"was sad.\" \"That can make people angry sometimes.\"  \n\nOne of the responses is \"have you ever been that angry?\" To which Lee responds \"one time.\" Presumably he's referring to when he murdered a state senator for sleeping with his wife, which was undoubtedly a crime of passion. Lee even mentions how people's actions might not make sense, \"because bad things happen to everybody.\"  \n\nSo I think with all the bad things that happened to Arvo, him shooting Clementine doesn't warrant all the hate he's getting. We all love Lee even though he did something just as bad; we can't judge Arvo for what little we've seen of him especially in his state.  \n\n**tl;dr: convince me to join the \"Fuck Arvo\" train**\n\n",
    "author": "IAmAN00bie",
    "num_comments": 13,
    "created_utc": 1409349130.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2eyfoa/cmv_spoilers_i_think_all_the_hate_towards_arvo_in/",
    "comments": [
        {
            "name": "t1_ck46dt5",
            "parent_id": "t3_2eyfoa",
            "body": "It's not just him shooting Clem, though. He did ambush them and try to kill the entire group long before Kenny starts being abusive to him. A big problem that people have with Arvo is also that, aside from Kenny and possibly Clem, everyone in the group is sympathetic with Arvo regardless of the fact he tried to kill everyone (and depending on your earlier choices, that *would not be justifiable*).\n\n\n\"Fuck Arvo\" is a two-fold statement. Fuck Arvo, the character, and fuck the way that Telltale wrote and handled him.",
            "author": "MisanthropeX",
            "created_utc": 1409352509.0,
            "replies": [
                {
                    "name": "t1_ck46x43",
                    "parent_id": "t1_ck46dt5",
                    "body": "&gt; He did ambush them and try to kill the entire group long before Kenny starts being abusive to him.  \n\nIn the context of a zombie apocalypse, that doesn't seem that bad. Plus Jane almost killed him and threatened to rob him (and did if you let her).  \n\n&gt;everyone in the group is sympathetic with Arvo regardless of the fact he tried to kill everyone  \n\nI think that's only true because of how Kenny acted.  \n\n&gt;fuck the way that Telltale wrote and handled him.  \n\nWhat's wrong with the way he was written?",
                    "author": "IAmAN00bie",
                    "created_utc": 1409353741.0,
                    "replies": [
                        {
                            "name": "t1_ck4715t",
                            "parent_id": "t1_ck46x43",
                            "body": "&gt;In the context of a zombie apocalypse, that doesn't seem that bad. Plus Jane almost killed him and threatened to rob him (and did if you let her).\n\nIn the context of the zombie apocalypse, ambushing and attempted murder aren't bad, but punching someone is?\n\n&gt;I think that's only true because of how Kenny acted. \n\nThe problem was they took the Arvo ambush plot and tied it in to the \"Kenny is dangerously unstable\" plot when one does not organically lead into the other. Kenny's actions towards Arvo after the attempted murder were not unstable but perfectly reasonable.\n\n&gt;What's wrong with the way he was written?\nHe was given undue sympathy and trust from the group despite having no reason to be endeared to them?",
                            "author": "MisanthropeX",
                            "created_utc": 1409353965.0,
                            "replies": [
                                {
                                    "name": "t1_ck473q2",
                                    "parent_id": "t1_ck4715t",
                                    "body": "&gt;In the context of the zombie apocalypse, ambushing and attempted murder aren't bad, but punching someone is?  \n\nBut it wasn't just him. We don't know if he was tracking you down or if you were stumbling onto their area or whatever. Plus the way the other Russians were treating him made it clear like he wasn't in charge or anything.  \n\n&gt;Kenny's actions towards Arvo after the attempted murder were not unstable but perfectly reasonable.  \n\nHow so? You could say the same about Carver. Carver was a dick who had to be dealt with, but Kenny took it way too far.\n",
                                    "author": "IAmAN00bie",
                                    "created_utc": 1409354110.0,
                                    "replies": [
                                        {
                                            "name": "t1_ck47es2",
                                            "parent_id": "t1_ck473q2",
                                            "body": "&gt;But it wasn't just him. We don't know if he was tracking you down or if you were stumbling onto their area or whatever. Plus the way the other Russians were treating him made it clear like he wasn't in charge or anything. \n\nArvo implies their base was in that old half-finished house, hence them having supplies there. That was many a day's walk from where the group runs into the Russians. Arvo came to get Clem's group, they didn't stumble onto him.\n\n&gt;How so? You could say the same about Carver. Carver was a dick who had to be dealt with, but Kenny took it way too far.\n\nCarver needed to be killed, and his brain had to be destroyed to ensure he wouldn't rise again as a walker. How did Kenny go \"too far\"?",
                                            "author": "MisanthropeX",
                                            "created_utc": 1409354774.0,
                                            "replies": [
                                                {
                                                    "name": "t1_ck496qz",
                                                    "parent_id": "t1_ck47es2",
                                                    "body": "&gt;Arvo came to get Clem's group, they didn't stumble onto him.  \n\nMaybe they were scavenging in the area? I mean, he had that medicine stuffed in a trash can.  \n\n&gt;How did Kenny go \"too far\"?  \n\nUh, did you stay and watch what he did? He didn't just kill him enough to stop him becoming a walker, he viciously beat him several times until his head turned into pulp.",
                                                    "author": "IAmAN00bie",
                                                    "created_utc": 1409358938.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_ck498fu",
                                                            "parent_id": "t1_ck496qz",
                                                            "body": "&gt;Uh, did you stay and watch what he did? He didn't just kill him enough to stop him becoming a walker, he viciously beat him several times until his head turned into pulp.\n\nIt's very clear that he died after the first few blows. What's the harm in hitting a piece of meat with a crowbar? It's not like him staying put the group in any danger.",
                                                            "author": "MisanthropeX",
                                                            "created_utc": 1409359055.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ck46us6",
            "parent_id": "t3_2eyfoa",
            "body": "I think the root of the frustration and hate people feel towards Arvo is the lack of choice the game gives you. From the perspective of the characters, Arvo is a known liar, clearly hostile, has tried to escape, and has tried to have your group killed. It just doesn't make sense that so many of the characters go out of their way to help him. \n\nNevertheless, despite all the actions Arvo has taken against the group, they still try to help him. Arvo responds by shooting Clem. Now I think it's important to note that depending on your choices, at the time Clem was shot she would have been completely innocent.\n\nTaking my play through as an example:\n\n* Clem didn't steal from him\n* Clem didn't attack him\n* Clem had put her gun down when she was shot.\n\nArvo shot a little unarmed girl just because he was sad? Doesn't cut it for me.\n\n&gt;  Lee mentions how Lilly \"was sad.\" \"That can make people angry sometimes.\"\n\nFirst off, I don't think we can overlook the fact that Lee was talking to an 8 year old. It seemed very obvious to me that he was sugar coating it a bit.\n\nRegardless, that isn't an excuse, and there are plenty of examples out there that show Arvo was a relatively bad person. \n\nChrista had more of a reason to blame Clem for Omid's death than Arvo had a reason to blame Clem for anything. She didn't take it out on her, or shoot her, she attempted to move and even took care of Clem.\n\n&gt; We all love Lee even though he did something just as bad; we can't judge Arvo for what little we've seen of him especially in his state.\n\nIt is implied that Lee's crime involved people really close to him, which led to a sense of betrayal and overreaction. It's definitely bad, but not the same as Arvo.\n\nWhat I think you are forgetting is that Arvo was a terrible person BEFORE all the bad stuff happened to him, and that he took out his anger on an innocent bystander.\n\nThe entire catalyst to his shitty situation was him putting Clem's group in mortal danger based on a lie.\n\nI'd even go one step further and say Kenny was right. It seemed really obvious that Arvo was going to try and kill someone. Had the group just been reasonable and listened to Kenny to begin with, then all the deaths in E5 could have been avoided.\n",
            "author": "Speed-Wolf",
            "created_utc": 1409353601.0,
            "replies": [
                {
                    "name": "t1_ck47ebr",
                    "parent_id": "t1_ck46us6",
                    "body": "∆ okay, that part about the lack of choices towards Arvo makes sense. MisanthropeX touched on that, but you did a better job explaining why Arvo's actions towards you don't make as much sense depending on Clem's actions (poor storytelling on Telltale's part?).  \n\nBut I'm still not convinced he's a terrible person.  \n\n&gt;Arvo shot a little unarmed girl just because he was sad? Doesn't cut it for me.  \n\nNot \"sad\", more \"angry.\" Kind of like Lilly.  \n\n&gt;Christa had more of a reason to blame Clem for Omid's death than Arvo had a reason to blame Clem for anything. She didn't take it out on her, or shoot her, she attempted to move and even took care of Clem.  \n\nChrista also had history with Clem, so she knows that Clem didn't intend for Omid to die.  \n\n&gt;It is implied that Lee's crime involved people really close to him, which led to a sense of betrayal and overreaction. It's definitely bad, but not the same as Arvo.  \n\nBut in Arvo's case, strangers (who almost robbed and killed him), killed his entire group and beat him up several times. He didn't hate Mike or Bonnie; only Kenny (for obvious reasons) and Clementine (who killed his sister, and though even as you mentioned she didn't necessarily do anything wrong towards him afterwards, you never really got to make up with him like others did - thanks Telltale!).  \n\n&gt;What I think you are forgetting is that Arvo was a terrible person BEFORE all the bad stuff happened to him  \n\nHe did unto you what you basically did to him.   \n\n&gt;Had the group just been reasonable and listened to Kenny to begin with  \n\nReally? I think everyone was reasonable to fear Kenny by that point. Except leaving the house with all your supplies was a dick move, but not trusting Kenny anymore wasn't wrong. Only Clementine (and the player) knows that Kenny wasn't all that bad.\n",
                    "author": "IAmAN00bie",
                    "created_utc": 1409354746.0,
                    "replies": [
                        {
                            "name": "t1_ck47g7n",
                            "parent_id": "t1_ck47ebr",
                            "body": "Confirmed: 1 delta awarded to /u/Speed-Wolf. ^[[History](/r/changemyview/wiki/user/Speed-Wolf)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][[Subreddit](http://www.reddit.com/r/DeltaBot/)]",
                            "author": "DeltaBot",
                            "created_utc": 1409354867.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_ck49upt",
                    "parent_id": "t1_ck46us6",
                    "body": "It's a lot like everything with Kenny and Lilly in season 1. If you side with Lilly over and over, it seems like bullshit when she betrays you, because you've been taking her side. With Arvo, if you steal his meds and aren't nice to him, everything he does is bullshit. I didn't take the meds and I put down the gun, so in my playthrough Arvo is a dick. If I'd threatened him with the gun and stole his meds, maybe it would make more sense. The fact that the game is on rails makes it so one path seems natural and the others seem stupid.",
                    "author": "DangerAwar",
                    "created_utc": 1409360589.0,
                    "replies": [
                        {
                            "name": "t1_ck4kq73",
                            "parent_id": "t1_ck49upt",
                            "body": "This is exactly it, don't get me wrong I enjoyed the two series but the game gives you nothing but the illusion of choice, everything all gets wrapped up the same way and you have to go through these set plot events that don't really make sense depending on which choices you made just so there's no real branching paths in a game supposedly about storytelling and the like.",
                            "author": "Barxist",
                            "created_utc": 1409402597.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ck4jqhn",
            "parent_id": "t3_2eyfoa",
            "body": "If anyone deserves the hatred, it's Bonnie. She rips into Clem after the drowning and says something snide (at least in one option, I'm not sure about both) that \"it must be nice to be a pretty girl and not have to do anything\".\n\nBitch, are you high? Ever since you met Clem she's done all the work. Breaking you out of Carver's grasp, for one. What the hell did *Bonnie* offer?\n\nSo what does Bonnie do? Betray Clem and co at the earliest opportunity. And when their escape plan goes awry and Clem is shot, Mike doesn't know what to do, and Bonnie persuades him to bail. You know, Clem's bleeding out right there, but fuck it, Bonnie wants to leave.\n\nArvo didn't owe the group anything, and they beat him, killed his sister and his friends, maybe mugged him. \n\nBonnie, though? Jeez, Bonnie stabs Clem in the back so often she probably whistles in a light breeze.",
            "author": "ComedicSans",
            "created_utc": 1409397688.0,
            "replies": []
        },
        {
            "name": "t1_ckn673s",
            "parent_id": "t3_2eyfoa",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1411166625.0,
            "replies": [
                {
                    "name": "t1_ckn67wq",
                    "parent_id": "t1_ckn673s",
                    "body": "[deleted]",
                    "author": "[deleted]",
                    "created_utc": 1411166677.0,
                    "replies": []
                }
            ]
        }
    ]
}