{
    "name": "t3_2r6aq3",
    "title": "CMV: The Alexander Bok \"Dance Dare\" was not police brutality",
    "body": "[Here's an article and video explaining the situation]. What I see when I watch this video is different than what I am finding most of the Internet sees.\n\nAt first it does look like the police are on him instantaneously for having a bit of fun. Take a closer look. Those are school safety officers and for some reason there are at least 8 of them in one place, standing on alert for something. For what, I have no idea. But, looking it up, there are just over 5,000 safety officers designated to cover an area of 1500 schools, that's ~3 officers per school. Now, since it was Christmas eve maybe they had more officers about but seeing 8+ officers in one place is not normal unless responding to some kind of call or other duty. I imagine if there were that many officers on the scene that something else was going on. I would bet money on there being even more officers around than those seen on the camera.\n\nIf the officers were looking for suspicious persons his suddenly pretending as though he wasn't dancing behind the officer when he was obviously doing something moments ago would seem awfully suspicious and their instantaneous response should be lauded not written off as brutality. The only thing I saw that might have been overkill is throwing him to the pavement but to be perfectly honest I didn't see his attempt to explain himself, I just had his testimony to go on.\n\nAnd personally I think the way people jump on the \"police brutality\" bandwagon anytime an officer reacts physically in a video is ridiculous, I have yet to see anything that looks like brutality since the Rodney King videos.\n\n\nSo change my mind, explain to me how this was brutality.\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "Larry-Man",
    "num_comments": 2,
    "created_utc": 1420259984.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2r6aq3/cmv_the_alexander_bok_dance_dare_was_not_police/",
    "comments": [
        {
            "name": "t1_cncxi7f",
            "parent_id": "t3_2r6aq3",
            "body": "In my opinion, it wasn't brutality, it was police idiocy. \n\nNow before you jump me, I have to say I agree with the fact that we have his testimony to go by, but even so, in parts of the actual video on his YouTube channel, you can hear him explain \"I'm just dancing\" and the cop replies \"why you dancing on the street for?\"\n\nThe fuck?\n\nHe's surrounded by 3 cops all cornering him to the vehicle and getting up in his face, and when he walks away, he gets unceremoniously pushed.\n\nFor the people saying its brutality, its really not, its just enforcing the power that some bad people unfortunately have.\n\nI know my statement isn't really clear and all but I'm on mobile and had a bit to drink.",
            "author": "misunderstoodONE",
            "created_utc": 1420265931.0,
            "replies": []
        },
        {
            "name": "t1_cnczw88",
            "parent_id": "t3_2r6aq3",
            "body": "Nobody is calling the police questioning him \"police brutality.\"  It's all the physical intimidation and pushing him on the ground.",
            "author": "kabukistar",
            "created_utc": 1420273384.0,
            "replies": []
        }
    ]
}