{
    "name": "t3_2k76ok",
    "title": "CMV: Edward Rooney was not in the wrong and should not be viewed as the antagonist in \"Ferris Bueller's Day Off\".",
    "body": "For those who are unaware/too young to know who I'm talking about, *Ferris Bueller's Day Off* follows high school senior Ferris Bueller, who decides to skip school and spend the day in downtown Chicago. Accompanied by his girlfriend Sloane and his best friend Cameron, he creatively avoids his school's Dean of Students Edward Rooney. Now don't get me wrong, as a kid I was totally on Team Ferris. Objectively speaking though, Bueller was a dick and Rooney was the good guy. This is based on two points:\n\n* Rooney is the Dean of Students for Shermer High School (let's assume it's the same high school John Hughes frequently used). This means his job, quite literally, is to prevent students from doing precisely what Ferris Bueller is doing. All Rooney is doing is what he gets paid, through taxpayer's dollars, to do for the school district. In fact, he goes above and beyond to do his job. Shit, that's pretty admirable for a public school employee.\n\n* Rooney was right. He wasn't going on a wild goose chase for nothing. Ferris wasn't sick. Sloane's grandmother wasn't dead (or at least didn't die that day). Bueller lied to his parents about being sick. Bueller lied to the school about a beloved family member dying. Bueller stole, and then destroyed, Mr. Frye's car. Bueller is nothing more than a snobby rich kid who gets away with and thinks he's owed everything because he's awesome and special. Rooney knows this too, and all he wanted was, for once, to have Bueller suffer the consequences for his narcissistic actions, which in my opinion is well-deserved.\n\nAt the end of the day, Edward Rooney was just doing his job, and by no means whatsoever is he the \"bad guy.\"\n\n**EDIT**: Change \"protagonist/antagonist\" to \"good guy or hero/bad guy or villain.\"\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "JM8818",
    "num_comments": 19,
    "created_utc": 1414161539.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2k76ok/cmv_edward_rooney_was_not_in_the_wrong_and_should/",
    "comments": [
        {
            "name": "t1_clijfti",
            "parent_id": "t3_2k76ok",
            "body": "According to Merriam-Webster, an antagonist is \"one that contends with or opposes another\", and in a literary setting the \"another\" refers to the protagonist. So strictly speaking, he fits the definition of the movie's antagonist, by opposing Ferris Bueller.\n\nBut I think your ultimate point was that Rooney holds the moral high ground in the movie for trying to stop Bueller from skipping class. While that is his job, keep in mind that he did commit a felony of breaking and entering the Bueller home and went way overboard.",
            "author": "coho18",
            "created_utc": 1414162727.0,
            "replies": [
                {
                    "name": "t1_clijqr7",
                    "parent_id": "t1_clijfti",
                    "body": "For literary purposes, change \"protagonist**/**antagonist\" to \"good guy or hero**/**bad guy or villain.\"\n\nAnd both Bueller *and* Rooney committed felonies throughout the movie (Bueller hacked into the school's computer systems to erase/alter records).",
                    "author": "JM8818",
                    "created_utc": 1414163329.0,
                    "replies": [
                        {
                            "name": "t1_clik16y",
                            "parent_id": "t1_clijqr7",
                            "body": "protagonist and antagonist have nothing to do with who's evil or not, the antagonist can be a good guy , wouldn't change the dynamics\n\n\nalso, he went to far by going above and beyond, he could have simply questioned his mother the day after with a phone call to pay condolences, the whole chase was unnecessary.\n\n",
                            "author": "jumpup",
                            "created_utc": 1414163895.0,
                            "replies": [
                                {
                                    "name": "t1_clisa1b",
                                    "parent_id": "t1_clik16y",
                                    "body": "Also, interestingly enough protagonist doesn't have to be the main character.  It has to be the character that initiates action and thereby is responded to by the antagonist.  For example, you can argue in Die Hard the protagonist is Hans Gruber and John McClane is the antagonist.\n\nThis interpretation isn't universal however, but I've heard it a few times and matches with the etymology of the words.",
                                    "author": "EtherCJ",
                                    "created_utc": 1414179068.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "name": "t1_cliyf98",
                            "parent_id": "t1_clijqr7",
                            "body": "That lingo is an artifact of most movies being about the good guy, but it isn't universal. Violent criminals are the protagonists in the Godfather movies. The Fugitive (note, I've only seen the movie adaptation, not the show, but I understand its the same) doesn't really have a clear badguy (the fugitive himself didn't do it, the marshal is trying to bring an escapee to justice, a prisoners claims to innocence have little evidence value), but the fugitive is clearly the protagonist and the marshal the antagonist.",
                            "author": "XXCoreIII",
                            "created_utc": 1414191665.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cliz81a",
                            "parent_id": "t1_clijqr7",
                            "body": "Ferris Bueller was written in 1985 and released in June 1986. The Computer Fraud and Abuse Act was not passed until 1986, but I cannot pinpoint exactly when it went into effect. However, as written, Ferris Bueller committed no felony by hacking into his school's computer.",
                            "author": "almightySapling",
                            "created_utc": 1414193566.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_clijjup",
            "parent_id": "t3_2k76ok",
            "body": "School is not prison, and students are not prisoners.  One small portion of the job of a Dean of Students is indeed to promote attendance.  But if a Dean is to act in the students' interests rather than as their jailer, he must promote attendance by making school desirable rather than by punishing students for choosing to use their time in other ways.  \n\nDean Rooney appears to be putting minimal effort into improving the school and making it a better place.  He appears to be \"after\" Bueller, squandering his on-the-clock time on a personal vendetta aimed at punishing Bueller specifically.  This is bad not only because he's wasting too much time on one student but also because he doesn't seem as interested in helping that student as in punishing him.\n\nBeyond this complete waste of his time and taxpayer money, Rooney commits trespassing and poisons Bueller's dog.  This exposes the school district to significant liability risk.  The potential legal damages far exceed any possible benefits even if the home invasion really were motivated by some (off-camera) concern with his student's best interests.",
            "author": "GnosticGnome",
            "created_utc": 1414162947.0,
            "replies": []
        },
        {
            "name": "t1_clik784",
            "parent_id": "t3_2k76ok",
            "body": "Rooney put far too much effort into capturing Bueller which worked counter to the goal of his position. Promoting attendance is one small portion of a job with many facets. He was not a truancy officer, he was a dean and had responsibilities outside of making sure one kid came back to school.\n\nI worked for a pool company a few years back and due to the large amount of money being worked with, it wasn't uncommon that we would have clients that were sometimes a couple of hours away because it still made financial sense.\n\nAll the time we'd get calls about a leaky pipe and a guy would volunteer to drive 2 hours out and 2 hours back on the clock so he could take 2 seconds to twist a valve and be done with it.\n\nWhile still a necessary component of a good worker's job, it would make much more sense for them to simply schedule the fix around the next time they were required to go out there.\n\nThis is essentially the equivalent of Rooney's thinking. It's practically a day off for him, shirking his otherwise more demanding responsibilities to act as a truancy officer going on a house visit and still get paid to do it.\n\nIt's not uncommon for students to miss a day and even if that does happen, the appropriate response is to send a truancy officer to check it out if you believe there to be a situation, not to lay everything else on your plate aside to go fix one tiny problem. What happens on a day where 5 or 6 students call in sick. Does he spend the first half of his day banging down doors making sure they're telling the truth? That's absurd.",
            "author": "vl99",
            "created_utc": 1414164216.0,
            "replies": []
        },
        {
            "name": "t1_clikadz",
            "parent_id": "t3_2k76ok",
            "body": "But you're missing one key point: Ferris's absence was excused--his mother called and said that he was sick.  Rooney has jurisdiction to crack down on unexcused absences, but does not have the right to override a parent's determination of whether a child is sick or not. ",
            "author": "CallMePlissken",
            "created_utc": 1414164380.0,
            "replies": []
        },
        {
            "name": "t1_clil0zh",
            "parent_id": "t3_2k76ok",
            "body": "He broke into the home when he became suspicious of the doorbell system glitch. He could have just waited in his car until the parents came home and busted him on that evidence alone. Completely over the line and it should rightfully cost him his job. \n\n",
            "author": "bnicoletti82",
            "created_utc": 1414165773.0,
            "replies": []
        },
        {
            "name": "t1_clio77z",
            "parent_id": "t3_2k76ok",
            "body": "This would be true about Rooney for maybe the first half of the movie, but by the end he clearly goes far beyond what his job could reasonably require or even allow him to do. He even breaks into the Buellers' house at one point, which means he broke the law. It's clear that by the end of the film he crosses ethical and professional lines in an attempt to win a personal vendetta against one of his own students.\n\nTo give you an analogy, if your neighbor was a tax auditor and you caught him breaking into your house searching for money he knows you haven't reported to the government, I'm willing to bet you wouldn't say he's just doing his job, nor would you commend him for going above and beyond. Is it even of any consequence to his behavior if he happens to be right?",
            "author": "Glory2Hypnotoad",
            "created_utc": 1414171628.0,
            "replies": []
        },
        {
            "name": "t1_clioeq3",
            "parent_id": "t3_2k76ok",
            "body": "Rooney wanted to spoil Ferris's graduation plans and hold him back a year. For what? Bueller didn't make it personal, he just recognized how absurd it was to attend school on such a perfect day. Life moves pretty fast, if you don't stop and look around once in a while, you might miss it. Rooney never stopped to look around, Ferris did.",
            "author": "eye_patch_willy",
            "created_utc": 1414172006.0,
            "replies": []
        },
        {
            "name": "t1_clipfjz",
            "parent_id": "t3_2k76ok",
            "body": "Did you never stay home from school just because?  My parents had no problem with it when I was of high school age.  And if someone came after me for it, they would have been pissed.",
            "author": "vettewiz",
            "created_utc": 1414173882.0,
            "replies": []
        },
        {
            "name": "t1_clipv72",
            "parent_id": "t3_2k76ok",
            "body": "Bueller officially had an excused absence as his mother called in. He had no legal or moral authority to do anything after that point in time, and he did several illegal things in his pursuit of Bueller. ",
            "author": "cdb03b",
            "created_utc": 1414174668.0,
            "replies": []
        },
        {
            "name": "t1_clirrsb",
            "parent_id": "t3_2k76ok",
            "body": "Movies are geared toward very specific audiences usually.  *Ferris Bueller's Day Off* was geared toward high-school aged children.\n\nPeople that fit this demographic would love to have a \"day off\" just as Ferris did.  Every story must have an antagonist, so the most relevant one in this case is someone from the school who wants to \"stop\" his \"day off\".  The Edward Rooney character fit this bill nicely.",
            "author": "hiking1",
            "created_utc": 1414178134.0,
            "replies": []
        },
        {
            "name": "t1_cliyfh1",
            "parent_id": "t3_2k76ok",
            "body": "Rooney extremely overreacted. \n\nIt's one thing to pursue a student for being absent, it's another thing to devote his entire day to it and attempt to break into his home. ",
            "author": "GrayOne",
            "created_utc": 1414191682.0,
            "replies": []
        },
        {
            "name": "t1_cljg752",
            "parent_id": "t3_2k76ok",
            "body": "I think this is based off of a really simply misunderstanding about dramatic structure.  The antagonist is not the villain, or the protagonist the hero.  The protagonist is the central character, who we want to achieve their goals; the antagonist is the person who opposes them.\n\nFerris Bueler wants to skip school for a day.  He's funny and charming, and so we like and identify with him.  Ed Rooney wants to catch Ferris; since we want Ferris to succeed, we need Rooney to fail.  He's the antagonist.\n\nIt happens all the time: the Ocean's Eleven crew are all robbers.  But since we want them to succeed, they are the protagonists, and Terry Benedict is the antagonist.  Inside Man switches the structure, while being essentially the same movie; the protagonist is Denzel Washington, trying to prevent a bank robbery, and Clive Owen is the antagonist.\n\nTL;DR Ed Rooney is the antagonist, even if he's in the moral right.",
            "author": "Kai_Daigoji",
            "created_utc": 1414254639.0,
            "replies": []
        },
        {
            "name": "t1_cljpj1q",
            "parent_id": "t3_2k76ok",
            "body": "Your first point isn't really an argument for being a \"good guy or hero,\" or even for not being a \"bad guy or villain,\" you are simply stating that he is doing the thing that he is paid to do. Your actions aren't justified simply because your are doing them in exchange for money. I am not necessarily saying that his actions weren't justified, just that his actions being part of his job doesn't make them justified. For a more extreme example, if someone believed that doctors who performed abortions were \"bad guys or villains\" do you think a reasonable way to challenge their belief is to tell them that they are in fact the good guys because it is there job to perform abortions? ",
            "author": "XopherGrunge",
            "created_utc": 1414276785.0,
            "replies": []
        }
    ]
}