{
    "name": "t3_25s0e8",
    "title": "CMV: Korra is a better Avatar than Aang and she is unfairly judged due to a poorly written love triangle",
    "body": "This isn't an overall TLA vs LOK thread, just focusing on the characters of the Avatars. Please don't make posts about which show you think is better.\n\nI think Korra is a better Avatar than Aang. Outside of the silly love triangle, I think she is a more compelling and better written character, as well as possessing better integrity as an Avatar.\n\nThe main point I wish to make is that Aang was relatively selfish and self-serving, right up until he learns to energybend from the lion turtle. In contrast, Korra embraces her Avatar duties.\n\nAang rejecting his Avatar duties is sympathetic from a character standpoint, but I find it hard to condone it in the grand scheme of things. I'm not going to blame him for letting the Hundred Year War drag on since he had no way of knowing of the upcoming attacks, but he did selfishly run away from his duties. Throughout the first two books (where Korra is at now), he whines about how he never wanted to be the Avatar, how he's afraid of the Avatar State and firebending, and basically not wanting to do the things he is supposed to. Again, sympathetic from a character standpoint but he couldn't change the fact that he was the Avatar yet still tried to run away from it. Even in book 3 after a ton of \"character development\" (which Korra is not at yet), he tries to put off his inevitable showdown with Ozai. He puts his own personal needs ahead of an efficient solution to bring balance to the world, to the point where even Avatar Yangchen has to tell him to act more selflessly after he ran away nearly a second time. \n\nAll Korra ever aspires to be is a better Avatar. She is weak spiritually and sometimes grows impatient about it, but she doesn't refuse her duties like Aang did. She wants to master all the elements and learn about the spirits because she embraces her Avatar duties. She wants to serve the world. Aang largely seems to go along with it because everyone tells him to and he can't really say no.\n\nTo the above, you might say, \"Aang is a kid\"....but this contrasts with his many moments where I like to call him a \"mini Gandhi\" where he goes on about the monk's teachings about peace, friendship, whatever. He's grown up quickly because of his new reality, I get that, but those moments where he lectures everyone always seemed pretty forced and difficult to believe after the establishment that Aang desires to be like a normal kid. I think it is quite silly to hate on Korra because she is actually written her age (or kind of, she's above average in maturity for a 16 year old) and not this contradictory mishmash.\n\nSome of Korra's other character flaws that are commonly brought up: she's rude, impatient, and prefers to resolve problems by force. To the first point, again consider that she is written her age. She is a rebellious teenager, locked in a controlled compound by the White Lotus her entire life. She has known her entire life she is the Avatar, validated by the White Lotus constantly feeding her tales of the great destinies of the Avatars and isn't afraid to show a little pride. Who wouldn't act that way? Her pride isn't to harm others, she is happy and comfortable with who she is and wants to use it to help people. For the latter two points, Avatar Roku repeatedly states that inaction was his greatest mistake, one that Aang repeats. I prefer Korra's method of facing problems head on instead of running away from them like Aang did.\n\nAlso, yes, the love triangle with Mako and Asami is dumb...but the fact that Aang, in his selfishness, had the intent of depriving his friends of seeing their father for the first time in two years far outweighs dumb teenage drama. That was downright malicious. \n\nA point I'd rather not address: Aang settled the Hundred Year War, but Korra's story isn't anywhere near a conclusion. We don't know whether her decision to leave the portals to the Spirit World open was a wise one. But I don't think it's fair to talk about the end conclusion for one character when none exists for the other character. \n\nSorry if this is too long but tl;dr: Korra is a better Avatar when you take into account that she only has two books of development yet still manages to be more believable and less selfish. I'd also like to hear what the other side thinks, so CMV :)\n\n-----\n\nEDIT: I gave /u/hooj and /u/tuckerfrye deltas. Hooj argued on the basis that you cannot apply an adult moral compass to a child or even compare a 12 to 16 year old, even if they are the Avatar or more mature for their age. Tuckerfrye argued on basis that the Avatar's journey had very different purposes; Aang's was his acceptance of the Avatar role with a clear endgoal, while Korra's is to actually make decisions for the changing world, more akin to an adult Avatar. You can't fault Aang's lack of acceptance of being the Avatar when that is the purpose of his journey. I see the error of my arguments now; even though I still have a preference for Avatar Korra and will defend her in the future, one Avatar is not objectively better than the other.\n\nMy main error is actually addressed in the final stages of book 2 of LoK where Tenzin tells Korra, \"it is not what you are, but who you are that people will remember\" (not verbatim) when talking about what made Wan and the other Avatars great. The Avatar is still a person in many different forms, not one singular and overarching personality.",
    "author": "luladin",
    "num_comments": 18,
    "created_utc": 1400311847.0,
    "url": "http://www.reddit.com/r/changemyview/comments/25s0e8/cmv_korra_is_a_better_avatar_than_aang_and_she_is/",
    "comments": [
        {
            "name": "t1_chk6m5p",
            "parent_id": "t3_25s0e8",
            "body": "While I think they have their own strengths - I think the added age and experience does give Korra a significant advantage.  \n\nThat said - I think you are discounting the struggle that Aang faced. \n\nHe was not in any way, shape or form equipped with the elements, and Korra is practically an expert at the beginning of the series. \n\nAang only knew airbending, and he was being relentlessly pursued by Zuko, Azula and the fire nation army. \n\nHis gang was also relatively ineffective compared to Korra's until the end of the series. \n\nIn spite of this - Aang was able to soldier on and fulfil his role as Avatar. \n",
            "author": "howbigis1gb",
            "created_utc": 1400313216.0,
            "replies": [
                {
                    "name": "t1_chk6r9i",
                    "parent_id": "t1_chk6m5p",
                    "body": "Korra had many disadvantages too. I don't agree that age and experience gave Korra a significant advantage because Aang traveled around the world and had more \"real life\" experience. Korra was confined to the Southern Water Tribe and had her teachers shipped to her while she didn't know very much about the outside world. Aang was fairly spiritual and able to easily get into the Spirit World while it took Korra most of the first two books to get to that point. \n\nI don't discount the struggle, but Aang certainly made things worse for himself. He would have had an easier time had he not gone into stasis. Assuming that he would be able to fend off the attackers at the Air Temples, the Water Tribes and the Earth Kingdom were not withered by the Hundred Year War. The Fire Nation had nowhere near the foothold on a global scale as they had a hundred years later so it would be easier for Aang to bid his time and train. Compare the \"final showdowns\": the very elderly Sozin with no combat skills other than bending and his successor who was just a baby, versus Ozai in his prime and his prodigy heiress who was literally one of the best benders in the world. There would also be a larger number of firebenders more sympathetic to the Avatar willing to teach him; he has friends in the Fire Nation. Basically, his potential allies would have been stronger before his stasis than after. \n\nI strongly disagree that his gang was ineffective. Team Avatar 1 literally taught Aang the other elements. Katara taught Aang after she surpassed his skill in the NWT and Pakku had nothing else to teach her, Toph taught him earthbending, Zuko mentored him in firebending. I can hardly call them ineffective when they taught Aang. Meanwhile, comic relief Bolin and angst Mako....yuck. They couldn't even hold off Desna and Eska at the spirit portals. \n\nLastly, I argue that Aang soldiered on because he felt that he had no other choice, but not because he truly wanted to.  ",
                    "author": "luladin",
                    "created_utc": 1400313989.0,
                    "replies": [
                        {
                            "name": "t1_chk77dq",
                            "parent_id": "t1_chk6r9i",
                            "body": "Korra's journey into the spirit world was not essential to the crises she faced, while it was different for Aang. \n\nHe was forced to go into Avatar mode simply because he was incapable of being a more forceful Avatar. \n\nHis going into stasis was a complete accident, as the monks were trapping him plus he was ostracised by his friends. \n\nLike you conceded earlier - it is unfair to blame Aang for the stasis. \n\nAs you say - Ozai in his prime was a very fearsome opponent, as was Vaatu - and the Avatar state was needed in both cases.\n\nI think its unfair to fault Aang for the circumstances he found himself in. \n\nTeam Aang doesn't get good until much later in the series. Even Katara needed a waterbending master, and he took a while to learn earthbending. \n\nOnly Sokka was somewhat consistent, and while his contribution was immense, he rightly estimated that it wasn't nearly enough and trained under Piandao. \n\nDesna and Eska weren't useless, and Mako is a much better firebender than Zuko was when he joined Team Aang. \n\nAny avatar would have gone the distance, but Aang was disadvantaged in many ways Korra wasn't.\n\nShe has Tenzin, Elder Toph, Bumi, Tenzin and Asami. \n\n",
                            "author": "howbigis1gb",
                            "created_utc": 1400316699.0,
                            "replies": [
                                {
                                    "name": "t1_chkf3kt",
                                    "parent_id": "t1_chk77dq",
                                    "body": "I don't agree that it wasn't essential considering that it was through Korra's lack of spiritual training that Unalaq was able to manipulate her throughout the first part of book 2. \n\nHe made things more difficult for himself. The major difference is that Aang could have had that support if he just stayed. He had the support of his people, the EK and WTs, and most importantly, sympathetic characters within the Fire Nation who were not molded by 100 years of propaganda. He wasn't without support after stasis, since he had Sokka and Katara from the beginning and pretty much everyone but the Fire Nation, Dai Li, and the town of Chin were pretty nice to him. Quite frequently would he enter a new place and the nobility holding a feast in his honor. Remember that his 100 year stasis felt like a few days to him - so his memories of Gyatso and others were fresh. Since he was able to relatively quickly find new people to support him, he wasn't alone. \n\nKorra found herself in those exact circumstances as you describe (being trapped by White Lotus) and didn't have any friends her age until she came to Republic City.\n\nOn differing Team Avatar skills: Aang's team was quality over quantity. \n\nKatara mastered waterbending with one scroll and a couple of episodes (not really sure what the timetable was, maybe a couple of weeks?). That is remarkable progress, given that it usually takes years for the average Jane/Joe to master their element. At the end of the first book she is a master and surpasses Aang in skill in waterbending. I don't really consider that later on. She was also the emotional support and rock of the group, keeping everyone together.\n\nAang had trouble learning earthbending because it was the element most opposite of his natural element and personality. It doesn't mean anything for Toph's skill, as she was naturally gifted from the first time we meet her. Toph founded an entirely new subskill of bending and was one of the best earthbenders.\n\nZuko is less good a bender compared to his sister, but he is above average compared to the typical firebender and by no means incompetent in combat. It's entirely possible Ozai stopped giving him the best tutors (and certainly none that would tailor to his slower learning curve) as it is implied Azula (who did receive the best tutors) and Zuko did not have the same masters. As far as overall battle competence, Zuko did not need firebending as he was able to survive in the EK without it. Aang turned out to be a fine firebender in the end. I guess the main point Mako has over him is bending electricity for manual labor?\n\nNobody in Team Korra really surpasses her skill in anything. Bending was mostly used for sport and everyday activity, the only people who used them for combat were the police and gangsters. Asami is there for tech and Tenzin is obviously the better airbender, but everyone else...I'm not really sure. I guess Jinora is better attuned to the spirits? Only Tenzin, who was taught by her past life, and Jinora really has anything to teach her. Everyone else is just tagging along for the ride. Desna &amp; Eska weren't on Team Korra until the very end, but I brought them up because Mako and Bolin couldn't beat them. ",
                                    "author": "luladin",
                                    "created_utc": 1400348821.0,
                                    "replies": [
                                        {
                                            "name": "t1_chkgkyz",
                                            "parent_id": "t1_chkf3kt",
                                            "body": "Korra's overenthusiam for the spirit realm is what caused he problems in the first place. \n\nKatara didn't master waterbending until the end of Book 1, which is a fair amount of time. Katara, also if I remember correctly - already knew some waterbending. And Aang didn't learn until a while later. \n\nI didn't mean that Zuko was untalented, it was that he was a largely useless teacher until they met the dragons. \n\nWhen he joined team Aang, he was absolutely useless in terms of firebending because the source of his rage was gone. \n\nWhile Aang was treated like royalty, his help was severely restricted - he had no monks guiding him, the adult figure in his life was restricted to the uncle of the person pursuing him doggedly (Iroh), Bumi was kind of crazy. The White Lotus didn't appear until later and weren't really in a position to counsel Aang. \n\n&gt; Desna &amp; Eska weren't on Team Korra until the very end, but I brought them up because Mako and Bolin couldn't beat them. \n\nI was just saying that they were capable in their own right, and I thought the battle could have swung in either direction. \n\nBending is not the only skill Aang's friends brought to the team, and its the same with Korra. \n\nLin for example was what saved Korra in the battle with the Equalists, and Aang received little help in his battle with Azula when Zuko double crossed them, and was severely outmatched against Sparky Sparky Boom Boom man - escaping only through extreme luck thanks to Sokka's boomerang. \n\nWhile Aang could have had more support had he stayed, he wasn't planning to leave for a hundred years. \n\nPlus - if all the air nomads were massacred, there is little chance that Aang could have survived - even with the Avatar state (which I suppose he could have gone into because of the situation at hand).",
                                            "author": "howbigis1gb",
                                            "created_utc": 1400352549.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_chk6s8c",
            "parent_id": "t3_25s0e8",
            "body": "I'm not sure that I would say one is definitively better than the other, but four years at that age makes a huge difference.  While you acknowledge the age gap and Aang's age at the time, I don't think you give him the leeway that he probably deserves.  \n\nIf we look at a 12 year old versus a 16 year old in our (or at least an American context), it's night and day.  While the 12 year old is struggling through the early stages of puberty, trying to find their way in 7th/8th grade, and beginning to learn about teenage life, the 16 year old is already living it.  While a person isn't necessarily super mature at 16, they are certainly going to be more mature than any 12 year old on average.\n\nHere's a kid who is born in desperate times, and expected to save the world.  That's pretty heavy if you're an adult, much less a 12 year old child.  I look back to what I was doing when I was 12 and I can tell you I wouldn't be ready to digest the notion of saving the world in a literal sense.  \n\n&gt;Even in book 3 after a ton of \"character development\" (which Korra is not at yet), he tries to put off his inevitable showdown with Ozai.\n\nThis is because he does not want to kill, nor does he think he is capable of doing so.  I mean, he's scared too, but he doesn't know if he can beat Ozai much less kill him if he did win the fight.  Again, 12 year old.  Asking a 12 year old to perform the coup de grace is pretty gnarly.  It felt a little deus ex machina-like when the lion turtle gave him an alternate solution, but I had no trouble believing a young kid would be pretty freaked out by the implication that he had to kill someone.\n\nIn reality, Aang's whining is actually a pretty accurate portrayal of what an actual 12 year old acts like.  He has bursts of brilliance and is indeed more mature than most real 12 year olds, but his character was written extremely well.  Air nomads don't like to be held to one spot -- and by extension, I'd assume they wouldn't like to be held down by destiny.  Couple his background with his age, and you have a pretty darn good 12 year old character.\n\nIs he \"better\" than Korra? I'm not sure anyone can really settle that (not right now anyway).  However, I do think you're being a bit too harsh on Aang.",
            "author": "hooj",
            "created_utc": 1400314145.0,
            "replies": [
                {
                    "name": "t1_chk6ywu",
                    "parent_id": "t1_chk6s8c",
                    "body": "While I concede part of your first point, a 16 year old is actually going through the physical changes that come with puberty, as well as, well, being a teenager. Life is more \"complicated\" at 16 than it is at 12 and the last thing teenagers want is more noise. Bringing in anecdotal evidence, I know that I made worse and more selfish choices at 16 than I did at 12 despite having greater agency. \n\nSecondly, Aang is a 12 year old kid, yes. But considering how the rest of the \"children\" act in the series around his age, they do not possess the same mentality that typical children do, due to having to \"grow up\" and adapt quickly. He had an adjustment period learning about the world in his absence, but otherwise it seemed that he had gotten used to this world of violence: the Fire Nation persistently went after him and he learned he had to fight back to survive. \n\nIf we accept that Aang does act like a typical 12 year old child, his \"little Gandhi\" moments don't make sense. Nor do all the people complaining about Korra being written her age. \n\n&gt;Asking a 12 year old to perform the coup de grace is pretty gnarly. It felt a little deus ex machina-like when the lion turtle gave him an alternate solution, but I had no trouble believing a young kid would be pretty freaked out by the implication that he had to kill someone.\n\nToph didn't share this view, and I bring her up specifically because she didn't suffer from the war her entire life like Katara, Jet, and others his age. She was in essence in a bubble like Aang was. Again, the \"children\" in the series generally did not act like typical children. I guess the beauty of Bryke's writing is that they can show that he is and isn't aspiring to be like a normal kid, but I don't like him as a mishmash of a character either way. \n\nI do agree with your last sentence though (being too harsh on Aang, not having a point of objectivity). My view isn't changed, but I have no problem with agreeing with points that make sense :)",
                    "author": "luladin",
                    "created_utc": 1400315229.0,
                    "replies": [
                        {
                            "name": "t1_chk7ilh",
                            "parent_id": "t1_chk6ywu",
                            "body": "&gt;I know that I made worse and more selfish choices at 16 than I did at 12 despite having greater agency.\n\nBut that's precisely the point.  The difference in age of someone, say, 45 versus someone who is 49 is not going to be as vast as the difference between someone 12 and 16.  Both are 4 year age gaps, but the contrast is much sharper for the lower age pair.  Most people wouldn't bat an eye at, say, the 45 year old and the 49 year old getting into a relationship, but a 12 and a 16 year old in a relationship would be considered odd/wrong/etc.  Why?  Because a dearth in years means a lot more at that age.\n\nIt's not to say a 16 is fully mature, or isn't changing, or has nothing left to learn.  Far from it.  It just that it's even more amplified for someone even younger.  The average 16 year old would be much more mentally equipped to handle the stress and pressure of having to save the world than a 12 year old.  \n\n&gt;they do not possess the same mentality that typical children do, due to having to \"grow up\" and adapt quickly. \n\nSure -- to a point.  If, say, one of your parents pass away when you are 12, it can certainly cause you to \"grow up\" faster, but it doesn't mean you're suddenly as mature as an adult.  Indeed, kids growing up in a wartime situation are probably going to be a bit more mature than similarly aged peace time kids, but they aren't adults by any stretch of the imagination. \n\nAt the same time, kids say some poignant things from time to time, and if a kid was raised by monks I'm sure their outlook would be heavily influenced by that.  Further, he is the reincarnation of the avatar.  He has no shortage of experience to draw from, and I don't think it always has to be in some dramatic fashion when he does so.  \n\nBasically, I don't really see any major plot holes/issues by having kids that understand the urgency of an important mission but still fall prey to the inexperience of their years.  I mean, like, watch a TED talk of some 14 year old trying to do something crazy/cool like provide cheap/clean water for people in Africa.  On one hand they certainly understand the gravitas of the water situation, want to help out, etc.  On the other hand, watching them present their findings/research/product clearly shows that at the end of the day they are still a young (or relatively young) child.  I don't see cognitive dissonance when I watch TLA because I know that kids *can* be simultaneously mature and immature.  \n\n&gt;Toph didn't share this view\n\nI disagree.  Toph was very clearly demonstrated as having a rough and tumble demeanor, and yet was still sensitive and kind underneath.  Kids show writing aside, I don't believe Toph would be capable of killing someone in cold blood -- not at the age of 12 anyway.  \n\nI like Korra and the series, but I think TLA was better written.  If I had to take a stab at explaining why I think that, its that I felt TLA was more free to explore the world of Avatar, while LOK is confined to certain parameters set forth by TLA.  To me it's like the same reason fan fiction is never really as good as the original.  It doesn't mean none of it is enjoyable, but they are writing essentially a derivative work that has to fit in the confines of the existing world.  I'm sure they can certainly take some liberties, but the pioneering is largely done.  \n\nFor a more explicit example, take Harry Potter.  I'm guessing there's a good chance you've read them.  But in any event, while subsequent works can certainly be enjoyable and fun to read, any author (including Rowling herself) is bound by the original rules of the original series.  Any written work in that universe cannot (figuratively) be allowed to negate or trivialize previous struggles by inventing new stuff.  That is, if some later work introduced a new spell that would have trivialized Harry's struggles in the original 7 books, that's going to be *really* bad writing.\n\nThe same applies to LOK in my mind.  Not that it's written poorly, but now that TLA is canon, the writers have to be careful not to override anything (at least not without significant explanation/retconning).  ",
                            "author": "hooj",
                            "created_utc": 1400318807.0,
                            "replies": [
                                {
                                    "name": "t1_chkg1f1",
                                    "parent_id": "t1_chk7ilh",
                                    "body": "&amp;#8710;\n\nI am new here, can I give more than one delta in a thread?\n\nLargely because I don't have anything to say in rebuttal and you pretty much covered all the bases. The most compelling part of your argument is that 12 year olds can still say wise things, but you still cannot expect them to have the same moral agency as an adult even if they do act more mature than their age and participate in war. It's why juveniles and adults are not tried in the same courts in the real world. There are a few things here and there I don't agree with but they do not affect the integrity of your argument. I still have a personal preference for Korra the Avatar though :)\n\nNo, never really got into Harry Potter, I've only read the first and part of the fifth book and watched the first and fourth movies.",
                                    "author": "luladin",
                                    "created_utc": 1400351198.0,
                                    "replies": [
                                        {
                                            "name": "t1_chkglnp",
                                            "parent_id": "t1_chkg1f1",
                                            "body": "Confirmed: 1 delta awarded to /u/hooj. ^[[History](/r/changemyview/wiki/user/hooj)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][[Subreddit](http://www.reddit.com/r/DeltaBot/)]",
                                            "author": "DeltaBot",
                                            "created_utc": 1400352597.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_chk8gs0",
            "parent_id": "t3_25s0e8",
            "body": "It has better animation but has much worse writing. The stupid love triangle is only half the problem. It had a lot of potential, unfortunately it was wasted. I couldn't even finish it.",
            "author": "Madaxer",
            "created_utc": 1400325397.0,
            "replies": [
                {
                    "name": "t1_chke0un",
                    "parent_id": "t1_chk8gs0",
                    "body": "Literally first sentence is that the shows aren't being compared, just the characters :|",
                    "author": "luladin",
                    "created_utc": 1400346053.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_chk8ser",
            "parent_id": "t3_25s0e8",
            "body": "One of the big things that you are discounting is that Korra has had the support of family and friends for her entire upbringing.  she had actually teachers for every element who were wise experts themselves.  She had leadership and guidance through her entire upbringing and there was zero conflict for her whole upbringing. \n\nAang totally missed that element of childhood.  He is expected to be the Avatar with no training, no guidance, no nothing as a child.  \n\nIf the nature argument doesnt sway you (age), i think the nurture argument should.  He didnt have really any of the resources Korra had growing up. ",
            "author": "SpydeTarrix",
            "created_utc": 1400327448.0,
            "replies": [
                {
                    "name": "t1_chkfbo3",
                    "parent_id": "t1_chk8ser",
                    "body": "I don't agree there was zero conflict. She felt the White Lotus was confining her. All of the previous Avatars got to travel the world while she gets stuck in a compound where her life is scripted. She didn't have any friends her age until she got to Republic City whereas Aang references Kuzon, Bumi, and the other Air Nomad children. Aang wasn't confined or ostracized from his friends until he was told he was the Avatar. He doesn't know his parents as that is Air Nomad custom, but otherwise it seemed he had more of a childhood than Korra did, who was confined to her compound for training. \n\nThe scenarios are different. Aang was told he was the Avatar pretty late and he had not yet been trained. In fact, being taken away from Gyatso for Avatar training was literally the reason for running away. He didn't give it a chance. \n\nI made another comment below - Aang refused the resources given to him until he was put in dire circumstances. It's different than not having had those resources at all. ",
                    "author": "luladin",
                    "created_utc": 1400349397.0,
                    "replies": [
                        {
                            "name": "t1_chkxjvq",
                            "parent_id": "t1_chkfbo3",
                            "body": "He had a childhood, yes, but not the kind of guidance that the Avatar needs.  The Avatar is never going to have a normal childhood.  Unless he is not known to be the Avatar until later on (like aang was).  \n\nAang left because he was upset.  but he was just going out for a ride, I is not as if his intention was to incase himself in ice for a century.  \n\nWhen you are 12, and someone says that you are all of a sudden super important, and you cant be with your friends or your only father figure, that is going to be pretty tramatizing.  It was his intention to leave and cool down.  But even in the first book we see aang regreting his actions.  He did not intend to be gone long, just to cool off.  \n\nHe didnt have the resources until he made them available to himself.  He didnt have any teachers or guidance, and the world was literally against him.  He had to seek out and find earth benders and fire benders to teach him.  not an easy thing to do when the fire nation wants you dead.  \n\nKorra had that support system.  I understand that she didnt have an ideal childhood.  But if you think that being in what was basically a boarding school where you learn to use super powers is the same as being hunted by an entire nation of people, you are very wrong.  \n\nAang and Korra are also very differnt people.  Raised differently and with different mindsets and approaches to life.  I dont think one or the other is better.  I think they have different strengths and weaknesses.  I dont think Korra would have been capable of simply stopping Ozai.  And i dont think she would have been capable of learning from Zuko either.  But, i think she would have been able to learn from aang's first firebending teacher, even without mastery of earth.  \n\nSo, they are different.  But i dont think korra is better.  that isnt to say that she is worse, i just think that they are different. \n\nSome of Korra's character is wrapped around young adult love and \"who is going to take me to prom\" style stuff, but i dont think that is really who she is. so i am not really thinking about that. ",
                            "author": "SpydeTarrix",
                            "created_utc": 1400412401.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_chkbwxl",
            "parent_id": "t3_25s0e8",
            "body": "You're comparing apples to oranges here.  Aang's story arc was acceptance of his role as the avatar.  Remember he only found out he was the Avatar a few days before he fled.  He was 12, and he was faced with this overwhelming burden of fighting a war. The series ends with him being a fully realized Avatar at the age of 12/13 and fully accepting his duties because he found a way to harmonize his beliefs with his duties.  \n\nKorra's character arc is completely different.  She's already done that. She realized she was the Avatar at the age of 4.  She was raised in peace time and security. \n\nAlso, lets look at what being the avatar meant to both Korra and Aang.  For Aang it meant losing all of his friends, losing his teacher, dedicating himself to years more training when he thought he only had to master one element, and fight a looming war with the dangerous fire nation. For Korra, it meant she was instantly elevated to the level of a celebrity. He family (which was already royalty from the Northern Water Tribe) gained even more prestige. She was given the finest teachers, and basically lived in luxury from birth to the beginning of the series.  Throw on the differences in age and training and I think it's really unfair to compare the two.  ",
            "author": "tuckerfrye",
            "created_utc": 1400340267.0,
            "replies": [
                {
                    "name": "t1_chke65g",
                    "parent_id": "t1_chkbwxl",
                    "body": "&amp;#8710;\n\n(hopefully the delta applied correctly! this is my first time awarding one) While I still prefer Korra as a character, the apples and oranges comparison is spot on. It is unfair to compare the two because their circumstances and goals are completely different. You highlighted and explained that in a perfect way. To go further on that, Aang is accepting being the Avatar, while Korra is refining herself and making decisions for the world, aka being the Avatar. It is wrong to fault Aang for the very thing TLA was about. We also knew what the endgoal for Aang is all along - the massive showdown with the Fire Lord. Korra doesn't really have a defined endgoal since there is no overall villain in LOK, we are seeing her try to act in the interests of the world. She is a glimpse of what a fully realized Avatar would go around doing.\n\nAs Tenzin said, \"it is not what you are, but it is who you are that people remember\" or something around those lines. I made the mistake of the first part. ",
                    "author": "luladin",
                    "created_utc": 1400346436.0,
                    "replies": [
                        {
                            "name": "t1_chkf1if",
                            "parent_id": "t1_chke65g",
                            "body": "Confirmed: 1 delta awarded to /u/tuckerfrye. ^[[History](/r/changemyview/wiki/user/tuckerfrye)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][[Subreddit](http://www.reddit.com/r/DeltaBot/)]",
                            "author": "DeltaBot",
                            "created_utc": 1400348670.0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}