{
    "name": "t3_20qlzk",
    "title": "[CMV] I don't think Season 4 of Community was noticeably worse than any of the other seasons",
    "body": "I've watched every single episode of Community that has been aired and I think that for the most part every season is more or less equal. I've heard nothing but horrible things from critics and fans alike about Season 4, but didn't really notice any obvious differences in how the characters interacted, the quality of the scripts, or the tone/theme of the episodes. \n\nI feel as if a lot of the backlash to season 4 was created by people looking for reasons to hate the season because of their devotion to Harmon and how NBC screwed him over. While I'm not saying NBC did anything but a horrible thing to Harmon I truly don't feel like the quality of the product suffered.",
    "author": "Gryfen",
    "num_comments": 14,
    "created_utc": 1395168213.0,
    "url": "http://www.reddit.com/r/changemyview/comments/20qlzk/cmv_i_dont_think_season_4_of_community_was/",
    "comments": [
        {
            "name": "t1_cg5u35v",
            "parent_id": "t3_20qlzk",
            "body": "I have watched all of community, but I haven't really paid attention to who has been making what and the politics behind it.\n\nI definitely noticed a change that is more noticeable now that the 5th season has swung back a bit. While community has always been silly, it's had an ability to be the right amount of silly with a twist of emotion. I think season 4 lost this a little bit - the silliness was too much (the dark timeline not-a-paintball-episode-paintball-episode I think is a good example) and the emotions behind it felt kind of robotic and forced. \n\nIt feels like you could do a single episode between season 3 and season 5 where Jeff graduates and Pierce leaves and not have lost anything from season 4. The character development was minimal and the switch back to the old feeling of the show has made any development even more redundant.\n\nA good example of this is Chevy Chase leaving. He was barely in any episodes in season 4, yet this was never directly dealt with. Within the first few episodes of season 5 we've actually explored the impact of him leaving and of troy leaving - things matter again now. \n\nI think had whoever was running season 4 stayed in charge then perhaps the differences wouldn't have been so stark - but having a return to the old 'feel' of the show has, to me, further shown just how far away from 'community' season 4 actually went. \n\nBut at the end of the day, it's media, so if you liked it just as much it's hard to change you're view on that. I really didn't and had no idea of the changes behind the scenes until recently so definitely wasn't biased by that.",
            "author": "sheep74",
            "created_utc": 1395170288.0,
            "replies": [
                {
                    "name": "t1_cg5uill",
                    "parent_id": "t1_cg5u35v",
                    "body": "&gt; things matter again now\n\nAnother good example of things mattering is Chevy's goodbye episode - the polygraph episode. It was similar to Intro to Felt Surrogacy in that each character had secrets that would upset the others and all those secrets were put on the table throughout the episode. In Felt Surrogacy, the secrets they each hold are of very different magnitudes. Troy started a 50 acre fire, while Jeff bailed on a date and felt bad about it. Everyone treats their secrets as if they have the same weight to them, and at the end they have a very sappy \"aww, we can all feel better about this now\" moment. In Cooperative Polygraphy each person's secret is given the appropriate weight. There character's secrets aren't just about things they did, but things they did to each other. There isn't a final moment of sappy sitcom closure where all the harm is undone and everyone hugs. Instead they grow as people. They realize that they're not as nice as they all might think of themselves being. Things mattered this time around. ",
                    "author": "Amablue",
                    "created_utc": 1395171167.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cg5u5gl",
            "parent_id": "t3_20qlzk",
            "body": "They did an episode in Season 4 that was a homage to a Hitchcock film called Rope, but they did not do the entire episode in a single take.\n\nThat sounds nitpicky. But the whole point of the movie Rope was to do a movie in a single long take (or facsimile thereof -- the limit on the amount of film you could fit into a camera meant that Hitchcock had to disguise several cuts). If you do an homage to Rope without at least attempting to do everything in a single take, you have not Gone All the Way.\n\nAnd Community at its best is about Going All the Way. Of course, a sitcom is written and made under a tight schedule and a tighter budget, which means that pushing people and producers as hard as you need to push them to do something silly like attempt to do an entire episode in a single take, without gaffs or missed lines, takes stubbornness, exacting idealism, and also being an inconsiderate asshole. \n\nDan Harmon is all of those things. When he is in charge of Community he pushes the show to go as far into a homage or riff as you possibly can go. And he also manages to ride the line between progressive enlightenment and hipster racism/sexism almost exactly, which also requires dedication and willingness to tear apart one's own ideas.\n\nSeason 4 still had a great cast, a great set of writers, and a great crew. But it just wasn't quite the same. You could not geek out to the little references quite as deeply. You winced at the stereotypes and tropes just a little more. The puppet episode just wasn't quite as good as it could have been.\n\nWhich isn't to say that there weren't high points. The Inspector Spacetime convention episode was hilarious. But it just wasn't quite up to the standard set by earlier searsons.\n\nymmv",
            "author": "eggies",
            "created_utc": 1395170420.0,
            "replies": []
        },
        {
            "name": "t1_cg5u5za",
            "parent_id": "t3_20qlzk",
            "body": "I haven't watched season for in a few months so i can't give many specific details, but i can tell you some of the things that bugged me.\n\nlet me start by saying overall i didn't think it was as horrible as everyone made it to be.  it had some good episodes and some bad ones like every season, but i think it wasn't as good as the other seasons.  \n\nFirst off was consistency.  during the whole season people were complaining about what happened to X or Y.  the one i remember was abed finding a girl he got along with.  and then we never heard about her again.  that kind of thing really bugs fans.  \n\nthen just the type of humor.  It was simpler, more in your face etc.  Now that type of humor isn't bad, a lot of people like it, but part of why i liked community in the first place was the humor.  changing that to me makes it noticeably worse.  \n\nlastly i'll just briefly mention the tone.  a lot of it seemed more light heart-ed and not as heavy as some of the other seasons.  i remember episode one abed said \"that's the nicest thing anybody's ever said to me\" after jeff said \"i see your value now\"  while it sounds funny at first that is some dark shit.  i don't remember anything like this from the fourth season.  this might just be my selective memory of the earlier seasons at the time though.  \n\nnow there were things they did that i think were better than all the other seasons, but overall my view of it is less than the others.",
            "author": "complete_misanthrope",
            "created_utc": 1395170453.0,
            "replies": []
        },
        {
            "name": "t1_cg5u64o",
            "parent_id": "t3_20qlzk",
            "body": "I think the problems with the fourth season have definitely been blown a little out of porportion by Community's huge, very vocal fan base, but to say there *wern't* any problems is definitely pretty far from reality.\n\nI enjoyed a lot of the fourth season because even though it wasn't as great as the show had previously been, it was still Community.  My issues however stem from *how* Community the vast majority of the episodes were.  The first three seasons are a great mix of wacky, out there, conceptual episodes that the show has become known for, as well as very human, yet funny episodes where we just live life through the eyes of these interesting characters.  \n\nI feel like for the fourth season the showrunners saw episodes like \"Advanced Dungeons and Dragons\" and \"A Fistfull of Paintballs\", saw how much people truly loved those episodes and said \"this is what Community is all about\".  The first 5 episodes of the fourth season are *all* conceptual.  The writers stopped spending time with *just* the characters and instead spent all of their time putting them in wierd, wacky, conceptual situations that they figured their fan-base would fall all over themselves over.  But in the process we got things like the relationship between Troy and Britta, or the devolution of Annie into just someone who is interested in Jeff on occassion while looking like Alison Brie.  \n\nIt needs to go both ways, we need \"break\" episodes where the characters can evolve naturally instead of trying to force progression in episodes where the primary focus is the weird, meta, conceptual situation they've goten themselves into.  \n\nThe fourth season was definitely not as bad as most make it out to be, it was funny, moving, and all the other things we've come to associate with the show, just in a very watered down, confused form.  The fourth season was the version of the show that everyone *thought* they wanted, but only realized they didn't after it was all said and done.",
            "author": "Gumbee",
            "created_utc": 1395170461.0,
            "replies": [
                {
                    "name": "t1_cg5zi8r",
                    "parent_id": "t1_cg5u64o",
                    "body": "That strikes me as more of an episode order issue than anything else. I understand that gimmick episode after gimmick episode does get a little bit rough but if they had shuffled the order would we have noticed as much? Especially as you pointed out if they hadn't set out with 5 straight conceptual episodes?",
                    "author": "Gryfen",
                    "created_utc": 1395181379.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cg5vvtk",
            "parent_id": "t3_20qlzk",
            "body": "Britta and Troy's relationship.",
            "author": "mccoyed",
            "created_utc": 1395173934.0,
            "replies": []
        },
        {
            "name": "t1_cg5wtus",
            "parent_id": "t3_20qlzk",
            "body": "Flanderization. The first thing Britta did on the show was outsmart Jeff. She was meant to be intelligent and idealistic but not as knowledgeable or worldly as she fancied herself. By season four she was straight up retarded. It happened to all of them:\n\n* Abed's descent into profound autism\n\n* Troy becoming Abed mk. 2\n\n* Pierce is old and racist, right?\n\n* Fucking everything about the Dean and Chang.\n\netc.\n\nIt just got *very* one-dimensional. Plus I hated the fact that the study group never actually studied or went to any classes and spent all their time reenacting famous films.\n",
            "author": "hopeidontrunoutofspa",
            "created_utc": 1395175799.0,
            "replies": []
        },
        {
            "name": "t1_cg676fl",
            "parent_id": "t3_20qlzk",
            "body": "I'm not one of those who think there were no bad episodes in the first 3 seasons so there are plenty of bad episodes there that are really no different from S4 eps. \n\nBut try this, make a list of the top 10 episodes. What is the highest you'd have from S4? Off the top of my head from the first 3 seasons you have Paintball, the Bottle ep, the Xmas claymation, Halloween zombies, Paintball II, D&amp;D, the video game ep, and the alternate universe ep. Nothing from S4 comes to mind.\n\nOf course comedy is subjective but I don't think S4 has a single ep worthy of a top 10 and would be lucky to have one or two in the top 20. At the same time if we did a bottom 10 it wouldn't be all S4 or even half S4 so it isn't as bad as some make it. The difference is real however that S4 had no single brilliant 10/10 or even 9/10 episodes.\n",
            "author": "w41twh4t",
            "created_utc": 1395197870.0,
            "replies": [
                {
                    "name": "t1_cg67c1z",
                    "parent_id": "t1_cg676fl",
                    "body": "Personally, I thought her story of dance, the thanksgiving episode and the origin story episodes were fantastic, possibly not top 10 for me but very close. Additionally I feel that community in particular has a very difficult time being quantified into a top 10. The d and d episode, the video game episode, the goodfellas episode all are incredibly funny to me because the references of those episodes struck a chord with me that they may not have in other episodes like the scandal episode from this season. \n\nCommunity is all about the references and the ones you connect with will all be more important to you than the ones you don't connect with. It's similar to south park in that respect and I think that's why it's hard to say any one episode of community is objectively worse than any others. ",
                    "author": "Gryfen",
                    "created_utc": 1395198225.0,
                    "replies": [
                        {
                            "name": "t1_cg682wr",
                            "parent_id": "t1_cg67c1z",
                            "body": "Her story was the one ep I considered for top 10 but then I had more fun with this season's hot lava ep even though it was just a variation of the paintball ones. It sounds like we'd agree there isn't one ep in S4 that would be in either of our personal top 10s and that's where S4 is noticeably worse. The difference is between:\n\nNice-eh-nice-eh-WOW-nice-nice-eh-WOW \nNice-eh-nice-eh-eh-nice-nice-eh-nice. \n\nTake away the top 10 Community episodes and S4 is not different but take away the top 10 and Community is just another forgettable sitcom. If Herstory, Thanksgiving, and the origin were the best episodes of the entire series would you care if the show got cancelled? Would you think the future would miss out on all-time classics that rank with the best of South Park, MASH, Seinfeld, Cheers, Simpsons, etc or would you put the series somewhere several notches under 30 Rock, Big Bang, and The Office?",
                            "author": "w41twh4t",
                            "created_utc": 1395199962.0,
                            "replies": [
                                {
                                    "name": "t1_cg6891i",
                                    "parent_id": "t1_cg682wr",
                                    "body": "I think what I was trying to say that the gap between the top 10 episodes, the next 10 episodes, and all other episodes just isn't that significant in terms of quality",
                                    "author": "Gryfen",
                                    "created_utc": 1395200368.0,
                                    "replies": [
                                        {
                                            "name": "t1_cg69bpa",
                                            "parent_id": "t1_cg6891i",
                                            "body": "If this is the equivalent of 'Red is my favorite color' there is no way to change your view. We can say the top eps average a 9 out of 10 ranking and the next group average an 8 and the next average a 7 and there isn't a big difference between a 9 and a 7 but that's missing the point isn't it?\n\nIf you had a job to make 1000 people laugh using Community episodes we've already agreed the ones to use are from S1-3 and not from S4. If you want to convince 1000 people to start watching Community because it isn't a typical sitcom, you aren't going to play anything from S4. That's the noticeable difference in quality.\n",
                                            "author": "w41twh4t",
                                            "created_utc": 1395203017.0,
                                            "replies": []
                                        },
                                        {
                                            "name": "t1_cg7vk1o",
                                            "parent_id": "t1_cg6891i",
                                            "body": "Stumbled across this today\n\nhttp://graphtv.kevinformatics.com/tt1439629\n\n",
                                            "author": "w41twh4t",
                                            "created_utc": 1395362368.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}