{
    "name": "t3_2dbi54",
    "title": "CMV: I don't think Robin Williams is funny",
    "body": "I never understood why people find him funny. I love absurdist comedy but I have always been turned off by Williams' manic energy and uninsightful comedy.  He was great in his serious roles, such as Good Will Hunting and Awakenings, but his frantic antics and characters never resonated with me.  He always just seemed like a hyperactive child starved for attention.  It always makes me more sad than happy to see him do comedy. I realize that he has suffered from mental illness and addiction, but you shouldnt have to take that into account when you see him dressed as Ms. Doubtfire on the screen.\n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "DerpaNet",
    "num_comments": 4,
    "created_utc": 1407832434.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2dbi54/cmv_i_dont_think_robin_williams_is_funny/",
    "comments": [
        {
            "name": "t1_cjnx04f",
            "parent_id": "t3_2dbi54",
            "body": "Do you want people to change your view on what you find funny? ",
            "author": "placebo-addict",
            "created_utc": 1407833220.0,
            "replies": [
                {
                    "name": "t1_cjnx0sk",
                    "parent_id": "t1_cjnx04f",
                    "body": "no, I want to understand the appeal",
                    "author": "DerpaNet",
                    "created_utc": 1407833316.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cjo1q0q",
            "parent_id": "t3_2dbi54",
            "body": "I'm guessing that people like him mostly because they were young children when they first saw him, and have a certain sense of nostalgia when they think of him. \n\nI'm old enough that I first saw him as a guest star on Happy Days, and as a child I though that he was pretty funny. Once I got into my teens, he still had a lot of \"good will\" left over from when I first knew him so that I gave him a pass even though he was beginning to grate on me. As I got older, it became obvious that I didn't like him at all, and I found him to be untalented and annoying. \n\nAside from that, there are probably a lot of people who are predisposed to think good of him because of his politics. He would often speak a Democratic fundraisers, and was sympathetic to left-wing causes. \n\nSo while I don't think that I could ever convince you that he is actually funny, I think that those are some reasons why other people do (or at least *say* that they do). ",
            "author": "Snedeker",
            "created_utc": 1407852203.0,
            "replies": []
        }
    ]
}