{
    "name": "t3_21yr8u",
    "title": "CMV: I'm committing the middle",
    "body": "To be frank, I was a little intimidated coming into this. Barca is the best general the Poeni have, and he's already defeated us at Trebia and Trasimene. The man is clearly a master. But me and Paullus are at the field now, and I can't see how the man earned his reputation. We outnumber him by at least thirty thousand men. He clearly hasn't prepared for us. This is the largest army the Res Publica has ever raised. \n\nBut he's not trying anything. Our scouts are reporting that his middle is made of of the weakest soldiers in his army! Turncoat Gauls and cheap Iberi mercenaries! The legions could punch through them like a hot knife through butter. \n\nSo that's it. Paullus doesn't like it, but I'm committing our middle. We'll punch through the Poeni, and leave Barca stranded in Apulia, without assistance or an army. \n\nThe only conceivable problem is the superior quality of the Poeni cavalry, but even that will be overcome when we rout the body of the army. \n\nThat's the plan, anyway. CMV\n\n_____\n\n&gt; *Hello, people of the past. This is a footnote from the moderators of this 'internet forum'. I'm afraid to say that some wannabe scientist, while looking into time travel, has caused a temporal distortion field. It should dissipate in the next 24 hours. In the mean time, feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)*** *about a view you hold while you're visiting the present, and remember to have a look through* ***[our rules](http://www.reddit.com/r/changemyview/wiki/rules)***.",
    "author": "GaiusTerentiusVarro",
    "num_comments": 2,
    "created_utc": 1396392225.0,
    "url": "http://www.reddit.com/r/changemyview/comments/21yr8u/cmv_im_committing_the_middle/",
    "comments": [
        {
            "name": "t1_cghq6uu",
            "parent_id": "t3_21yr8u",
            "body": "Yoo, you should totally not do that and just attack Carthage, ya'know? Because, seriously, their two best generals, the Barca bros, already left the city with most of their army in tow. They're basically defenseless right now so...yeah?\n\nI told my friend Scipio and he said he was down to do it if y'all were so committed on this \"middle\" thing.",
            "author": "elev57",
            "created_utc": 1396394805.0,
            "replies": []
        }
    ]
}