{
    "name": "t3_2i1f34",
    "title": "CMV: Kurt Cobain committed suicide",
    "body": "Here we have an outspokenly depressed drug addict who was admitted to rehab and had a failed suicide attempt two months prior to dying. He had even asked his friend to purchase the shotgun he used months before carrying out his suicide. Plus in [this](http://wac.450f.edgecastcdn.net/80450F/ultimateclassicrock.com/files/2014/04/kurt-cobain-suicide-scene.jpg) (NSFW) picture you can see the blister on his thumb as a result of the kick from a pump action shotgun. Not to mention the [note](http://i.imgur.com/rKPBKW8.jpg) that Kurt wrote himself before doing the deed.\nTo assume that anyone (ESPECIALLY Courtney Love) would be smart enough to carry out the murder of someone as famous as Kurt Cobain was at the time is just giving them way too much credit. Especially when you reiterate the fact that Kurt struggled with severe depression his entire life and had pretty much become exactly what he didn't want to be in life by the age of 27; a commercially successful drug addict.\n\n_____\n\nAll pictures found on Google Images. ",
    "author": "Gogohax",
    "num_comments": 60,
    "created_utc": 1412205211.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2i1f34/cmv_kurt_cobain_committed_suicide/",
    "comments": [
        {
            "name": "t1_ckxypxs",
            "parent_id": "t3_2i1f34",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1412208469.0,
            "replies": [
                {
                    "name": "t1_ckxyt2w",
                    "parent_id": "t1_ckxypxs",
                    "body": "Sorry Bashi_Hart, your comment has been removed: \n\n&gt; Comment Rule 1\\. \"Direct responses to a CMV post must challenge at least one aspect of OP’s current view (however minor), unless they are asking a clarifying question. Arguments in favor of the view OP is willing to change must be restricted to replies to comments.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)  \n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Removed+Comment+Rule+1+Post+Appeal&amp;message=Bashi_Hart+would+like+to+appeal+the+removal+of+[his/her+post](http://www.reddit.com/r/changemyview/comments/2i1f34/cmv_kurt_cobain_committed_suicide/ckxypxs\\))",
                    "author": "hacksoncode",
                    "created_utc": 1412208667.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_ckxzlnz",
            "parent_id": "t3_2i1f34",
            "body": "Is there some common view that he didn't kill himself? Could you provide some information about it?",
            "author": "banjist",
            "created_utc": 1412210423.0,
            "replies": [
                {
                    "name": "t1_ckxzrws",
                    "parent_id": "t1_ckxzlnz",
                    "body": "Here is the link to the detective's web page: http://cobaincase.com/index.htm\n\nHe makes a case that Cobain did not kill himself, but rather that his wife and the male nanny living with them conspired to murder him.",
                    "author": "gugam99",
                    "created_utc": 1412210810.0,
                    "replies": []
                },
                {
                    "name": "t1_ckxzyeu",
                    "parent_id": "t1_ckxzlnz",
                    "body": "There is a surprisingly large number of people who actually believe that Courtney Love orchestrated his death. I can't really link anything cause I'm on mobile but the conspiracy theory is huge if you just google it. There's entire books and documentaries dedicated to it.",
                    "author": "Gogohax",
                    "created_utc": 1412211209.0,
                    "replies": [
                        {
                            "name": "t1_cky1afp",
                            "parent_id": "t1_ckxzyeu",
                            "body": "I've heard a few people with the theory that Dave Grohl was involved. Follow the money etc...",
                            "author": "Lifon",
                            "created_utc": 1412214162.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cky06e5",
                    "parent_id": "t1_ckxzlnz",
                    "body": "There is a conspiracy theory that it was a murder made to look like a suicide. Most people accept it was a suicide, though.\n\nThere's also the notion that if Courtney Love and other friends/family had been more attentive to him and his condition, it never would have happened.",
                    "author": "bsrk7",
                    "created_utc": 1412211698.0,
                    "replies": []
                },
                {
                    "name": "t1_cky58js",
                    "parent_id": "t1_ckxzlnz",
                    "body": "Read \"Love and Death: The Murder of Kurt Contain.\" There's some compelling arguments there.",
                    "author": "sinbysilence",
                    "created_utc": 1412223366.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cky08qq",
            "parent_id": "t3_2i1f34",
            "body": "I'm sorry, but there are simply too many things that don't add up:\n\n**The Note**: The note has always been suspect. Many people (myself included) believing that it was a letter to his fans explaining why he was leaving the music industry, and not a suicide note. Not to mention that handwriting analysts are split on whether or not it's even Kurt Cobain's hand writing. \n\n**The Drugs**: There was an Mtv News report on this back in the 90s (I can't find the video for it, I'm still looking and will edit if I find it), where they talked to a panel of medical examiners and cops. The ME's were all in agreement that given the heroin he allegedly took, he would've been almost immediately incapacitated, and not able to shoot himself. When asked if he could've injected himself and then shot himself before the \"drugs kicked in\", they said that it wasn't possible because the level of heroin in his bloodstream was too high.\n\n**The Cops**: The cops showed up to a musician's home: a well known heroin addict who had just left rehab early, was found with drugs, a suicide note, a shotgun, and a head wound. They never investigated any other possibility other than suicide; hell, they didn't check the gun for prints till nearly a month later, and then- surprise surprise,  they didn't find any. So after allegedly injecting a fatal dose of heroin, and shooting himself, Kurt Cobain managed to wipe the prints off the gun?\n\n&amp;nbsp;\n\nI'm not going to go so far as to say that Courtney Love pulled the trigger, but there is bullshit in that story.\n\n\n&amp;nbsp; \n\n(The Mtv news special was hosted by Kurt Loder and Kennedy.)\n\nEdit: I forgot a word.",
            "author": "Whitmans_Ghost",
            "created_utc": 1412211842.0,
            "replies": [
                {
                    "name": "t1_cky0d05",
                    "parent_id": "t1_cky08qq",
                    "body": "&gt; So after injecting a fatal dose of heroin\n\nso he *did* kill himself",
                    "author": "bugzrrad",
                    "created_utc": 1412212102.0,
                    "replies": [
                        {
                            "name": "t1_cky0fhe",
                            "parent_id": "t1_cky0d05",
                            "body": "Sorry, I a word. ",
                            "author": "Whitmans_Ghost",
                            "created_utc": 1412212253.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cky0hj9",
                    "parent_id": "t1_cky08qq",
                    "body": "My biggest issue, and this is even more true after having lived with a heroin junkie and seeing how they are in person... his heroin gear was neatly put away ~~and his sleeve rolled down.~~\n\nSo someone wants me to believe that he shot up a MASSIVE fucking dose, kept the tourniquet on his arm while he attempted to put away his gear and roll down his sleeve, then let it loose just as he pulled the trigger? No. That's not how this goes down in the real world.\n\nNo usable prints from the gun either. Even none from him handling it himself prior to the shooting.",
                    "author": "TheDevilsAdvocat",
                    "created_utc": 1412212375.0,
                    "replies": [
                        {
                            "name": "t1_cky2oax",
                            "parent_id": "t1_cky0hj9",
                            "body": "His sleeves are rolled up in OP's picture.",
                            "author": "Scruggs",
                            "created_utc": 1412217227.0,
                            "replies": [
                                {
                                    "name": "t1_cky2xto",
                                    "parent_id": "t1_cky2oax",
                                    "body": "In many reports people speak of his sleeves being rolled down.\n\n&gt; Wallace: “The forensic pathologist that we spoke to said that there's no way this guy could have injected a triple lethal dose of heroin into his system, then rolled down his sleeve, put away the drug kit, picked up the shotgun and shot himself. He would have been incapacitated within seconds.\n\nNow I'm trying to find a legit source that says whether or not the police were the ones to roll up his sleeves for the pictures\n\nEdit: The police report doesn't say the body was disturbed so for the time being, until I find a reputable source, I will now disregard the sleeves issue and assume it's bullshit.",
                                    "author": "TheDevilsAdvocat",
                                    "created_utc": 1412217814.0,
                                    "replies": []
                                },
                                {
                                    "name": "t1_ckybda8",
                                    "parent_id": "t1_cky2oax",
                                    "body": "What I find strange is that his pocket seems turned inside out, hanging out of his jeans as if somebody went through his pockets.",
                                    "author": "SolomonKull",
                                    "created_utc": 1412251211.0,
                                    "replies": [
                                        {
                                            "name": "t1_ckzm1sy",
                                            "parent_id": "t1_ckybda8",
                                            "body": "I have big hands and this happens to me often when i'm just getting something out of my pocket, could have happened to him and he obviously wouldn't care to sort it out if he was killing himself.",
                                            "author": "UnidanIsACunt",
                                            "created_utc": 1412363714.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cky132a",
                    "parent_id": "t1_cky08qq",
                    "body": "&gt;**The Note**: The note has always been suspect. Many people (myself included) believing that it was a letter to his fans explaining why he was leaving the music industry, and not a suicide note. Not to mention that handwriting analysts are split on whether or not it's even Kurt Cobain's hand writing. \n\nThat's *very* circumstantial. If it could be conclusively proved that the handwriting wasn't his then that might be a different story.\n\n&gt;**The Drugs**: There was an Mtv News report on this back in the 90s (I can't find the video for it, I'm still looking and will edit if I find it), where they talked to a panel of medical examiners and cops. The ME's were all in agreement that given the heroin he allegedly took, he would've been almost immediately incapacitated, and not able to shoot himself. When asked if he could've injected himself and then shot himself before the \"drugs kicked in\", they said that it wasn't possible because the level of heroin in his bloodstream was too high.\n\nFirst of all, MTV news is about as far away from a credible source as it's possible to be. We should be particularly suspicious of anything they said since they had a vested interest in controversy and hype around the circumstances of his death. \n\nSecondly, medical experts can only interpret the data with something like a heroin overdose. \"That amount of heroin *should* kill a person\". By all medical standards, Keith Richards *should* be dead and yet here he is. The man is a genuine medical miracle. It doesn't seem particularly crazy that a seasoned heroin addict could take significantly more heroin than is deemed safe.\n\n&gt;**The Cops**: The cops showed up to a musician's home: a well known heroin addict who had just left rehab early, was found with drugs, a suicide note, a shotgun, and a head wound. They never investigated any other possibility other than suicide; hell, they didn't check the gun for prints till nearly a month later, and then- surprise surprise,  they didn't find any. So after allegedly injecting a fatal dose of heroin, and shooting himself, Kurt Cobain managed to wipe the prints off the gun?\n\nAs far as I'm aware, there aren't always finger prints. A substance on someone's hands can mask prints, sometimes prints just aren't left and sometimes crime scenes aren't handled properly. In the case of the latter, the police certainly aren't going to admit to it. \n\nWhich seems more likely? An elaborate plot to murder one of the most famous musicians in the world (which they got away with?!) or a heavily depressed drug addict killed himself? ",
                    "author": "Xtianpro",
                    "created_utc": 1412213702.0,
                    "replies": [
                        {
                            "name": "t1_cky1xa3",
                            "parent_id": "t1_cky132a",
                            "body": "&gt;That's very circumstantial. If it could be conclusively proved that the handwriting wasn't his then that might be a different story.\n\nThe burden is on the police to do at least some investigation into the matter, especially given the fact that, at the time, it was widely reported that he and Courtney Love were separating and that he was going to be filing for divorce.  \n\nAre rumors and tabloid stories evidence? Of course not, but they're more than enough to warrant some additional scrutiny. \n\n\n&amp;nbsp;\n&gt;First of all, MTV news is about as far away from a credible source as it's possible to be. We should be particularly suspicious of anything they said since they had a vested interest in controversy and hype around the circumstances of his death.\n\nBack in the 90s, Mtv News was as credible a source on the matter as any of the mainstream media who only covered the \"official version\" of the story. \n\n&amp;nbsp;\n\n&gt;Secondly, medical experts can only interpret the data with something like a heroin overdose. \"That amount of heroin should kill a person\". By all medical standards, Keith Richards should be dead and yet here he is. The man is a genuine medical miracle. It doesn't seem particularly crazy that a seasoned heroin addict could take significantly more heroin than is deemed safe.\n\nWe're not talking about him taking a dose that \"should've killed him\", we're talking about him allegedly taking a dose that was something like three times the amount that would kill ***anybody***. And we're not just talking about him allegedly taking a fatal dose, we're talking about him taking a fatal dose, and then still being able to fire a shotgun. Even the medical examiners who disagree with the notion of him being immediately incapacitated, still admit that it's highly unlikely he'd have been able to shoot himself. \n\n\n\n\n&amp;nbsp;\n&gt;As far as I'm aware, there aren't always finger prints. A substance on someone's hands can mask prints, sometimes prints just aren't left and sometimes crime scenes aren't handled properly. In the case of the latter, the police certainly aren't going to admit to it.\n\nI'm not a forensics expert, so I'm not going to argue this point other than to say it was a month *before they even checked for prints*.\n\n&amp;nbsp;\n&gt;Which seems more likely? An elaborate plot to murder one of the most famous musicians in the world (which they got away with?!) or a heavily depressed drug addict killed himself?\n\nYou're right, because a spouse facing divorce- particularly one that stood to lose millions of dollars, has never killed/arranged for someone to be killed. \n\nCome on now. Wives have had their husbands killed for far less.",
                            "author": "Whitmans_Ghost",
                            "created_utc": 1412215566.0,
                            "replies": [
                                {
                                    "name": "t1_cky3tdz",
                                    "parent_id": "t1_cky1xa3",
                                    "body": "&gt; We're not talking about him taking a dose that \"should've killed him\", we're talking about him allegedly taking a dose that was something like three times the amount that would kill ***anybody***.\n\nI don't know where you're getting this from but it's wrong. There's essentially no upper limit to opiate dosing. It's typical for addicts with a heavy tolerance to take doses that would be fatal for the average person.",
                                    "author": "deltadopamine",
                                    "created_utc": 1412219782.0,
                                    "replies": [
                                        {
                                            "name": "t1_cky59bf",
                                            "parent_id": "t1_cky3tdz",
                                            "body": "&gt; I don't know where you're getting this from but it's wrong. There's essentially no upper limit to opiate dosing. It's typical for addicts with a heavy tolerance to take doses that would be fatal for the average person.\n\n\n\n\"It would be inaccurate, however, to simply state that Cobain took a triple lethal dose of heroin. In fact, according to the medical literature,*the dose he took was approximately seventy-five times the lethal dose for the average person*. What's crucial is that it was *triple the lethal dose for even the most* ***severe*** *addict.*\"\n\n[Source](http://books.google.com/books?id=i91LvMDYs_AC&amp;printsec=frontcover#v=onepage&amp;q&amp;f=false)\n\n&amp;nbsp;\n\nAgain, we're not talking about a \"larger than average dose\" here, we're talking about a dose that would've been fatal *no matter who was taking it*. People get hung up on the \"he was a junkie, he'd built up a tolerance\" argument when it simply isn't an issue here. No matter your tolerance for a substance, at a certain point, it becomes fatal; [even water is fatal](http://en.wikipedia.org/wiki/Water_intoxication) at a high enough dose. \n",
                                            "author": "Whitmans_Ghost",
                                            "created_utc": 1412223424.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cky65zj",
                                                    "parent_id": "t1_cky59bf",
                                                    "body": "The counterpoint to that argument is Ozzy Osbourne; [his genes are different, and he has done enough drugs that he *should* be dead.](http://abcnews.go.com/Health/Wellness/genetic-mutations-ozzy-osbourne-party-hard/story?id=12032552) Ditto Keith Richards. You're oversimplifying toxicology. The commonly stated \"should be fatal\" thing is assuming that there are no genetic differences that make them more resistant to toxins, and such a thing is certainly precedented.\n\nWhat's further, almost every example of this sort of high drug tolerance and possible (and sometimes confirmed) genetec variance is found very often specifically in famous musicians. Take basically any rock star: Steve Tyler, Nikki Sixx, Tommy Lee... all hard-partying rock gods, and I'd be willing to assign a higher-than-50% probability that if they had their genome sequenced, they'd find variants in the genes that dealt with processing drugs and alcohol.\n\nAll this to say: toxicology is way more complicated than you're making it out to be. Every person is different, and even if the dosage that Kurt Cobain took would've been lethal to 99.9% of humans if they took it, that isn't evidence that it would've killed him, unless it actually did.",
                                                    "author": "Mavericgamer",
                                                    "created_utc": 1412226161.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cky6iut",
                                                            "parent_id": "t1_cky65zj",
                                                            "body": "Ozzy is an extreme outlier, not a counterpoint. That's why people study his drug use. Every other rock star who partied like him is dead. There are tolerances and genetics, and then there is Ozzy.  ",
                                                            "author": "snakeoilHero",
                                                            "created_utc": 1412227350.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_ckyceyn",
                                                                    "parent_id": "t1_cky6iut",
                                                                    "body": "And Keith Richards, and Nikki Sixx, and a whole host of people who are in rough shape but still alive. He's an outlier only because he's the only one to get his genome sequenced.",
                                                                    "author": "Mavericgamer",
                                                                    "created_utc": 1412254748.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_ckyel0b",
                                                                            "parent_id": "t1_ckyceyn",
                                                                            "body": "Finding this whole thread very interesting.\n\nJust thought I'd add that Nikki Sixx has been legally dead at least once before being brought back. Motley Crue's ['Kickstart My Heart'](https://www.youtube.com/watch?v=1PJOHbzQwGw) was inspired by the incident.\n\nHis book, 'The Heroin Diaries', is a fascinating read.\n\nhttp://www.rollingstone.com/music/news/week-in-rock-history-nikki-sixx-declared-dead-for-two-minutes-20111219",
                                                                            "author": "arowberry",
                                                                            "created_utc": 1412260063.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "name": "t1_ckyuqre",
                                                                            "parent_id": "t1_ckyceyn",
                                                                            "body": "He is an outlier because of the honesty and verifiable amounts of usage in self reporting, surviving, and fame. And out of the thousands (millions?) who have OD'd your examples of more famous people using drugs can be simply more outliers.  For every one Ozzy there are 1000 Amy Winestead's who aren't famous.  There isn't a news story for the dead addict.  \n\nIf I name a whole host of famous people who are dead that wouldn't be persuasive either. There is an actuary table for drug use leading to death. Ozzy is so far on one side of that he is statistically an outlier. Far more people have OD'd and are dead then those that are alive. Which is by definition, an outlier. \n\nUnless your position was that people do not die from massive drug use, which is silly. Or that Ozzy didn't use that many drugs, also silly. ",
                                                                            "author": "snakeoilHero",
                                                                            "created_utc": 1412290879.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_ckyy8l8",
                                                                                    "parent_id": "t1_ckyuqre",
                                                                                    "body": "Again: you have no proof that Kurt Cobain wasn't an outlier; the fact that he was a heavy addict points towards the idea that he very well may have been.\n\nAlso, from what I know about drug testing and opiates, they stay and accumulate in your system for a decently long time. They know how much was in there when they examined him, not how much of it was recently injected.\n\nAll that aside, I still put the occam's razor solution in the court of \"this guy who was massively depressed killed himself\"; any theories that aren't somehow more simple deserve a complexity penalty.",
                                                                                    "author": "Mavericgamer",
                                                                                    "created_utc": 1412298332.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_cky49sl",
                                    "parent_id": "t1_cky1xa3",
                                    "body": "so while we are talking about things that don't add up... in your world there was an elaborate plot to kill the guy, and the killer(s) didn't think to put his hands on the gun?     \n\nand yes, spouses have killed for less... is that now evidence in every suicide?   \n\nsorry, but the \"come on now\" needs to come right back at you.   \n\nenjoy the story... he is missed after all, but I hope you don't actually believe this crap.",
                                    "author": "notmyrealnam3",
                                    "created_utc": 1412220866.0,
                                    "replies": [
                                        {
                                            "name": "t1_cky4g8p",
                                            "parent_id": "t1_cky49sl",
                                            "body": "&gt; so while we are talking about things that don't add up... in your world there was an elaborate plot to kill the guy, and the killer(s) didn't think to put his hands on the gun?\n \nKurt Cobain was found gripping the gun, so I'm not sure what you're talking about. \n\n\n\n&amp;nbsp;\n&gt; and yes, spouses have killed for less... is that now evidence in every suicide?\n \n&gt; sorry, but the \"come on now\" needs to come right back at you.\n\nI was replying to a comment that implied that it would be unheard of for one spouse to kill another. ",
                                            "author": "Whitmans_Ghost",
                                            "created_utc": 1412221310.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cky71v5",
                                                    "parent_id": "t1_cky4g8p",
                                                    "body": "So wait, he was found gripping his gun, but no prints were found? Something doesn't add up here.",
                                                    "author": "mievaan",
                                                    "created_utc": 1412229245.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cky8pjm",
                                                            "parent_id": "t1_cky71v5",
                                                            "body": "Sometimes fingerprints aren't left. The gun was found in his hands so he was clearly holding it. But if you just hold something for a moment there's often none. The curious part is that there were no finger prints on any part of the gun. This makes it seem like the gun was entirely cleaned off. Which wouldn't make sense if someone put him in that position.",
                                                            "author": "Godcantfly",
                                                            "created_utc": 1412236688.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_cky7neb",
                                    "parent_id": "t1_cky1xa3",
                                    "body": "&gt; We're not talking about him taking a dose that \"should've killed him\", we're talking about him allegedly taking a dose that was something like three times the amount that would kill anybody.\n\nThat's not how heroin tolerance works. Tolerance increases dramatically over the course of an addiction. It's not just that a seasoned heroin addict can *tolerate* a dose that would kill most people, it's that they can easily get to the point where a \"normally fatal dose\" is not even enough for them to *feel.*",
                                    "author": "TehRedBaron",
                                    "created_utc": 1412231662.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "name": "t1_cky7m2t",
                            "parent_id": "t1_cky132a",
                            "body": "&gt; It doesn't seem particularly crazy that a seasoned heroin addict could take significantly more heroin than is deemed safe.\n\nIn fact, that will *always* be the case. That's how tolerance works with opiates.",
                            "author": "TehRedBaron",
                            "created_utc": 1412231501.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cl0z8pc",
                            "parent_id": "t1_cky132a",
                            "body": "Opiate tolerance can be built up a LOT.  Nobody can say if someone would have fallen out as soon as the dope hit him.  The amount that can kill one person might just keep another from getting sick.",
                            "author": "evilpinkfreud",
                            "created_utc": 1412517835.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cky1ag7",
                    "parent_id": "t1_cky08qq",
                    "body": "&gt;The ME's were all in agreement that given the heroin he allegedly took, he would've been almost immediately incapacitated\n\nI just watched Kurt Cobian's documentary on Netflix and they had doctors saying the same. He had a huge amount that would leave him motionless. At that time, they didn't know how much he was used to, but they said for most hard heroin users it was enough to render you out of it.\n\n",
                    "author": "AluminumMonsterrr",
                    "created_utc": 1412214163.0,
                    "replies": []
                },
                {
                    "name": "t1_cky46fh",
                    "parent_id": "t1_cky08qq",
                    "body": "&gt;Many people (myself included) believing that it was a letter to his fans explaining why he was leaving the music industry, and not a suicide note. Not to mention that handwriting analysts are split on whether or not it's even Kurt Cobain's hand writing    \n\nconspriacies are fun.  A) the letter was from him but NOT a suicide not and B) the note may not have been from him.   \n\nsomeone looking for a conspiracy says and sees these two points as two check marks on the \"conspiracy\" side of the ledger.   \n\nhowever, they are butt heads with each other and really drive the point hime that people are grasping at straws.  If someone else wrote the note, why would they not write a more clear one that no one could say was about leaving the music biz?  Why ignore the depression and drug addiction that so often play a role in suicide?   \nconspiracy \"enthusiasts\" WANT it to be more... they form an opinion and since there is no evidence to back that opinion, they cherry pick little talking points.   \n\nanother example was \"he was too high to kill himself\"  - the ME has NO idea how much tolerance one has built to a certain drug over the years and speaks only in averages",
                    "author": "notmyrealnam3",
                    "created_utc": 1412220631.0,
                    "replies": [
                        {
                            "name": "t1_cky4raj",
                            "parent_id": "t1_cky46fh",
                            "body": "&gt;If someone else wrote the note, why would they not write a more clear one that no one could say was about leaving the music biz? Why ignore the depression and drug addiction that so often play a role in suicide?\n\n&gt; conspiracy \"enthusiasts\" WANT it to be more... they form an opinion and since there is no evidence to back that opinion, they cherry pick little talking points.\n\nThat's the whole point: there is just as much evidence for murder as there is for suicide, and it's the evidence that's largely at issue here.  \n\n\n\n\n&amp;nbsp;",
                            "author": "Whitmans_Ghost",
                            "created_utc": 1412222088.0,
                            "replies": []
                        },
                        {
                            "name": "t1_ckzoj6g",
                            "parent_id": "t1_cky46fh",
                            "body": "&gt; conspriacies are fun. A) the letter was from him but NOT a suicide not and B) the note may not have been from him.\n\n&gt;someone looking for a conspiracy says and sees these two points as two check marks on the \"conspiracy\" side of the ledger.\n\n&gt;however, they are butt heads with each other and really drive the point hime that people are grasping at straws.\n\nI think you have it a little unclear. To clarify, the note has an addition, after the words \"I'll be at your altar\", which is written larger, sloppier, in a different penstroke thickness, and with a different amount of pressure. The conspiracy theory is that Courtney or an accomplice found a note that was a farewell to public life, murdered Kurt, and added the last lines to make a dark note seem like a suicide note.",
                            "author": "Toynbee1",
                            "created_utc": 1412368555.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cky73ic",
                    "parent_id": "t1_cky08qq",
                    "body": "I can't give you a point by point rebuttal, but you should read Charles Cross' biography of Kurt. I was as convinced as you were, by the same points as you are and he convinced me otherwise.",
                    "author": "nappythrill22",
                    "created_utc": 1412229426.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cky1y4x",
            "parent_id": "t3_2i1f34",
            "body": "In addition to things brought up by /u/whitmans_Ghost and /u/TheDevilsAdvocat, I'll link to [this excerpt](http://books.google.com/books?id=i91LvMDYs_AC&amp;pg=PA92&amp;lpg=PA92&amp;dq=cadaveric+spasm+cobain&amp;source=bl&amp;ots=b9cKqgJ-NB&amp;sig=vmNikFNjj0BldpCIfd1zxO-f4Cw&amp;hl=en&amp;sa=X&amp;ei=wa8sVLrlCdGnyATMoIDIAw&amp;ved=0CDAQ6AEwAw#v=onepage&amp;q=cadaveric%20spasm%20cobain&amp;f=false) from  the book *Love and Death: The Murder of Kurt Cobain*. \n\nI haven't read the whole book (full disclosure), but I've known people to bring up the cadaveric spasm as a compelling final point in what could have been a decently comprehensive frame-up. The blister you mention on his thumb doesn't necessarily mean he pulled the trigger entirely on his own.\n",
            "author": "fucking_hell_man",
            "created_utc": 1412215618.0,
            "replies": []
        },
        {
            "name": "t1_cky21r0",
            "parent_id": "t3_2i1f34",
            "body": "The documentary on Netflix on Kurt goes into great detail about Courtney. It leans to the side of murder, which, we obviously don't know for sure happened. However, her father, which she hasn't spoken to since 15 is convinced she did it. He's written down events and things she has done that were aggressive and scary, but does that make her a murderer? no.\n\nHowever, interviewing different men throughout the years that knew Courtney from shows and tours we PETRIFIED of her. I mean, some didn't want to even speak on camera. Women spoke of her walking up to them and dragging them out of bars because she wanted the seat. Or punching them. \n\nI really only thought of her as a junkie broad with a mental illness but seeing what people say and the fear, even 20 years later, that they have really made me question. She is a very smart and calculating person if you see her interviews. She is highly intelligent which is seen from interviews and went to Portland State University, studying English and philosophy.\n\nHer father was a publisher and mother a psychiatrist. It wouldn't surprise me if she learned certain techniques from her mother and found a way to mindfuck people. \n\nFinally, the handwriting on the note changes. The top it is addressed to his childhood imaginary friend, then is written totally different and at the end mentions Courtney and Frances as a goodbye in the same random handwritting. \n\nAlso, the marking on his thumb could be from a pipe. I don't think there is enough evidence that we have to suggest one or the other. \n\nJust to add, in [this](http://dailyentertainmentnews.com/music/never-before-seen-photos-of-kurt-cobain-suicide-scene-revealed/) article about the crime scene, his left hand was wrapped around the barrel. He was left handed. ",
            "author": "AluminumMonsterrr",
            "created_utc": 1412215843.0,
            "replies": [
                {
                    "name": "t1_cky2u3y",
                    "parent_id": "t1_cky21r0",
                    "body": "^(The link \"this\" points to http://dailyentertainmentnews.com/music/never-before-seen-photos-of-kurt-cobain-suicide-scene-revealed/)\n",
                    "author": "TheLinkBot",
                    "created_utc": 1412217590.0,
                    "replies": []
                },
                {
                    "name": "t1_cky6lbd",
                    "parent_id": "t1_cky21r0",
                    "body": "He was ambidextrous if I am not mistaken. He only played the guitar using his left hand to strum.",
                    "author": "LordBluetooth",
                    "created_utc": 1412227595.0,
                    "replies": [
                        {
                            "name": "t1_cky9oqt",
                            "parent_id": "t1_cky6lbd",
                            "body": "I'm ambidextrous, and if he really was too then I don't see any real conspiracy as to where his hand was either.\nI write with my left, use scissors with my right, as with my phone, I'm left footed, use a bat with my right and would strum a guitar with my left.\nI'd also use my right hand on a gun.",
                            "author": "Nihilistic-Fishstick",
                            "created_utc": 1412242505.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cky2yhy",
            "parent_id": "t3_2i1f34",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1412217856.0,
            "replies": [
                {
                    "name": "t1_cky35w5",
                    "parent_id": "t1_cky2yhy",
                    "body": "There's people who believe it was a staged suicide and that others were involved in his death. Particularly Courtney Love and Dave Grohl. I'm pretty sure it was a genuine suicide but its interesting hearing other peoples reasoning for the opposing opinion.",
                    "author": "Gogohax",
                    "created_utc": 1412218309.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cky3f7y",
            "parent_id": "t3_2i1f34",
            "body": "I thought the commonly accepted explanation is that he *did* commit suicide?",
            "author": "IAMARobotBeepBoop",
            "created_utc": 1412218873.0,
            "replies": [
                {
                    "name": "t1_cky3u07",
                    "parent_id": "t1_cky3f7y",
                    "body": "I dont know how common either opinion is but both are very ubiquitous. I believe he did in fact commit suicide. But regardless of what really happened his death was tragic and very unfortunate.",
                    "author": "Gogohax",
                    "created_utc": 1412219821.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cky44de",
            "parent_id": "t3_2i1f34",
            "body": "The title of your post made me think that you wanted convincing that mentally ill or depressed people killing themselves counts as suicide and shouldn't deserve pity. However, I'll add in a point of view that shows that others are responsible or at least complicit in aiding the death of Kurt Cobain.\n\nDepression or drug use:\n\nIf an old person is at the top of a set of stairs walking down and her leg or hip breaks due to calcium deficiency. Because of this, she falls down the stairs and dies from the injuries. One would not say that the old person committed suicide. Blaming the death on the fall also not precise. It was the injury that should be blamed much as if another person pushed her down the stairs would be blamed.\n\nNow, instead of an old person its a person with depression. They're at the top of the stairs looking down and their mind breaks too much at that moment and they toss themselves forward. The injuries from the fall leads to his death. Do you blame the person, the fall or the mental injury?\n\nIt's the above reasons that insurance companies pay out for suicide so long as the policy is two years or older. We assume that taking out a policy just prior to suicide makes the act a conscious thought with hopes that the death leads to a cash reward to others. However, suicide as a result of mental illness is not considered a rational choice and death from that is considered as much an accident as falling down the stairs due to a physical injury. \n\nConsidering the above, you could say that killing one's self due to depression is not suicide but death due to illness. As such, given the evidence with Kurt Cobain, he did not commit suicide.\n\nEnabling:\n\nIf a person is depressed and taking illicit drugs and alcohol that exacerbates the problem, it can be deadly. Now, what about the people that know about that person's issues and callously ignores them and even offers to provide substances or enables the destructive behavior? I would argue that falls under reckless endangerment, and given the mental illness factor could be criminal in nature. \n\nWhile Courtney loved Kurt (actually, I don't know, but let's just assume so), her lifestyle continued to pull Kurt further and further down till his mind snapped to the point that he killed himself. She was the one that provided the push, and if she was not mentally ill herself can be responsible for the death of Kurt.\n\nConspiracy:\n\nNot touching that path. ",
            "author": "Nukemarine",
            "created_utc": 1412220491.0,
            "replies": [
                {
                    "name": "t1_cky9unp",
                    "parent_id": "t1_cky44de",
                    "body": "I really like your argumentation, as it provides a completely different view than all the other posts here.\n\nAlthough you did not change my view, you certainly broadened it :)",
                    "author": "shinji_",
                    "created_utc": 1412243509.0,
                    "replies": []
                },
                {
                    "name": "t1_ckyb83j",
                    "parent_id": "t1_cky44de",
                    "body": "&gt; It's the above reasons that insurance companies pay out for suicide so long as the policy is two years or older.\n\nNothing to do with Cobain, but I have to disagree a little on that particular point.  The reason suicide after a few years does not invalidate the insurance is because life insurance is a form of investment.  It is fundamentally different from all other forms of insurance because it is guaranteed to eventually pay out in the end.  Also, the more you put into it over the years, the more it pays out.\n\nSo the only thing that prevents pay out is if the beneficiary is responsible for the insured person's death (for pretty much obvious reasons.)  But I seriously doubt the highly considered and enlightened view of suicide being the result of an illness was ever part of the consideration.  Unlike other forms of insurance, if you flat out lie on a life insurance claim, they still have to pay out after that 2 or 3 year period.  It has a lot less to do with suicide specifically and a lot more to do with the general nature of the insurance, that as an investment device there is an expected payout at the end.",
                    "author": "heelspider",
                    "created_utc": 1412250620.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cky8t0k",
            "parent_id": "t3_2i1f34",
            "body": "In the note there is clearly something off. The first part is all about preforming and its even signed at the bottom impling that the note ended. But then it continues, suddenly in different(ish) handwriting, suddenly about his family, suddenly rushed, and suddenly about dying. Why did he put so much time into talking to his fans and so little to his family? \n\nAlso, there is a blister on his thumb but that just means he was holding a gun, not that he was the one who arranged his death. ",
            "author": "Godcantfly",
            "created_utc": 1412237207.0,
            "replies": [
                {
                    "name": "t1_ckylfmb",
                    "parent_id": "t1_cky8t0k",
                    "body": "the guy was so wacked/depressed/hooked that he put a gun in his mouth and pulled the trigger, wiping himself from existence.    \n\nthere are many, many \"why\" questions.  why he spoke to his fans more than his family.... is number 467 on that list    \n\nedit - him is now himself ",
                    "author": "notmyrealnam3",
                    "created_utc": 1412273197.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cky99fb",
            "parent_id": "t3_2i1f34",
            "body": "When it happened I didn't question it, I assumed Kurt did himself. Then I saw  [this episode](https://www.youtube.com/watch?v=r-jgd_0uomk) of Unsolved Mysteries. Too many things that don't add up.",
            "author": "ShantaramMarley",
            "created_utc": 1412239865.0,
            "replies": []
        },
        {
            "name": "t1_ckyblqs",
            "parent_id": "t3_2i1f34",
            "body": "I believe it was a case of assisted suicide. No one knows how he got back home from the rehab centre with no money and bank accounts frozen. A friend picked him up or he hitchiked and then this person agreed to help him commit suicide maybe in exchange for some heroin or something. I understand this is a dark view but we live in a crazy world.",
            "author": "Iamnotbroke",
            "created_utc": 1412252097.0,
            "replies": []
        },
        {
            "name": "t1_ckydk5a",
            "parent_id": "t3_2i1f34",
            "body": "Overall, why do you care? Were you two close friends?\nHe's gone. The world is still spinning. Why dwell on it? Nothing can change it.",
            "author": "Falconpunch3",
            "created_utc": 1412257763.0,
            "replies": []
        },
        {
            "name": "t1_ckzjvee",
            "parent_id": "t3_2i1f34",
            "body": "Courtney Love and Kurt Cobain had a rocky marriage and a prenuptial agreement. At the time of the marriage, Love's career seemed to be destined to be greater than Cobain's, but at the time of Cobain's death, Courtney would be facing a huge downshift in lifestyle with a divorce, and probably the end of her career as Cobain's ex. Cobain had also just walked away from a $9.5m contract, and Love was trying to exert control in Cobain's now larger career. Well before Cobain's death, there was a pattern of Love working to discredit Cobain's mental stability and capacity. Yes, Cobain might very well have been on the road to killing himself someday, but I think Courtney Love contrived to make that eventuality as certain and advantageous to herself as possible.\n\n&gt; Here we have an outspokenly depressed drug addict who was admitted to rehab and had a failed suicide attempt two months prior to dying.\n\n Dr. Oslavo Galletta, who treated Cobain after his so-called \"first attempt\", said that it truly seemed like an overdose, not a suicide attempt. In fact, it was reported as an overdose until Love, much later, said that she had found a suicide note (but had burned it).\n\n&gt; He had even asked his friend to purchase the shotgun he used months before carrying out his suicide.\n\nThe reason Kurt Cobain had a friend (Dylan Carlson) purchase the gun was because four guns had recently been confiscated by the police, on two occasions, after fights with Courtney Love. The first time, three guns were taken and then returned- the second time, four guns were confiscated because Love claimed that he was suicidal and had locked himself away with all the guns in the house.\n\nWhy would you need four guns to kill yourself? Why not one, or three? Why every gun in the house, locked away from Love, only to be peaceably turned over to the police as soon as they arrive?\n\nWhy would you buy a shotgun to kill yourself? Why not use a high caliber handgun? Why not just use three times the lethal dose of heroin? Why make a close friend an accessory in your suicide, when you have every legal right to purchase a gun yourself?\n\nMaybe you want a 20-Gauge shotgun, the standard setup for home protection, for home protection. Maybe you have your friend buy it so your spouse doesn't find out you've recently purchased protection when she thinks you have been disarmed. Maybe you want a friend to know about the weapon being in the house.\n\n&gt;you can see the blister on his thumb as a result of the kick from a pump action shotgun. \n\nThose photos were not only released 20 years after the incident, they remained \"undeveloped\". Why?\n\nEven if it is evidence that Cobain fired the gun, it is not evidence that he fired the gun at himself.\n\n&gt; Not to mention the note that Kurt wrote himself before doing the deed.\n\nHere's [another picture](http://www.justiceforkurt.com/investigation/documents/handwriting_practice.shtml) of a handwriting practice sheet found in Courtney Love's backpack the week of Cobain's death.\n\n[Love also claims to have forged the \"Bitch with Zits\" note found in Cobain's wallet](http://www.nme.com/news/nirvana/77193), in imitation of his handwriting. She also possessed a stolen prescription pad to write herself prescriptions, which she was arrested for, and cleared of when the doctor came forward later and said he had \"forgotten\" the pad in her hotel room. So not only was she a practiced handwriting forger, she had been forging Cobain's handwriting specifically. \n\n&gt;To assume that anyone (ESPECIALLY Courtney Love) would be smart enough to carry out the murder of someone as famous as Kurt Cobain was at the time is just giving them way too much credit.\n\nSociopaths don't become sociopaths because they are intelligent enough, they become sociopaths because manipulating people is the only way to survive with their other shortfalls in capacity. There's a lot of suspicious behavior that we overlook BECAUSE Love is so otherwise unhinged we just chalk it up to eccentric, junky behavior. \n\nIf you have ever been close to an addict, you learn that it doesn't take anything but a singular driving desire to turn someone into a Lex Luthorian mastermind. A person could be losing job after job, burning through relationships, failing to manage very simple things in their life, but they never stop getting their fix until they die.\n\nCourtney Love isn't an idiot. Have you ever listened to Hole? She managed to get that shit on the air and printed on records. She wasn't \"discovered\", she clawed her way, creating, using, and destroying relationships with people in the music industry the whole way up.\n\n&gt;... the murder of someone as famous as Kurt Cobain...\n\nFame also affords privacy. And [a private detective who was sent on wild goose chases and coverup attempts ever since he was hired to find Cobain after he left rehab \\(who now privately funds his own investigation\\).](http://www.cobaincase.com/events.htm)\n\nWhat protection is fame, when your fame had been for years curated and carefully crafted by your murderer? When your public perception has been distorted, when you have been pushed to use your talents for something you never wanted to use them for by someone you have made yourself most vulnerable to?",
            "author": "Toynbee1",
            "created_utc": 1412359476.0,
            "replies": []
        },
        {
            "name": "t1_cl0is9b",
            "parent_id": "t3_2i1f34",
            "body": "I didn't realize this was disputed by anyone but conspiracy nuts.",
            "author": "deaconblues99",
            "created_utc": 1412461538.0,
            "replies": []
        }
    ]
}