{
    "name": "t3_2nck53",
    "title": "CMV: I believe that Darren Wilson is likely to have killed Mike Brown in what he reasonably believed was self-defense from imminent danger.",
    "body": "The title says most of what I want to say, but to elaborate a bit, there seems to be a lot of outrage over the fact that Darren Wilson was not indicted, not just among members of the community but abroad, and I'm not quite sure where it's coming from.  Initially, it seemed as though Brown may well have been fleeing from the scene and was shot without posing a threat, but as new information has been released that seems less and less to have been the case.  Part of me thinks the outrage is largely due to the fact that people have associated Mike Brown with a greater (and admittedly perfectly legitimate) problem, namely that of police targeting of black youth.  Now that he's so strongly associated with that problem, it seems like people don't want to admit that perhaps Brown did at least reasonably seem to pose a threat because it would feel like they're betraying a cause they care a lot about, even if to admit that would be the more reasonable position to take.\n\nChange my view.",
    "author": "Technologenesis",
    "num_comments": 111,
    "created_utc": 1416897569.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2nck53/cmv_i_believe_that_darren_wilson_is_likely_to/",
    "comments": [
        {
            "name": "t1_cmcen1x",
            "parent_id": "t3_2nck53",
            "body": "Please explain what danger Darren Wilson was in from a person who was more than 100 feet away from him and running in the opposite direction.",
            "author": "down2a9",
            "created_utc": 1416898884.0,
            "replies": [
                {
                    "name": "t1_cmcfad1",
                    "parent_id": "t1_cmcen1x",
                    "body": "Please don't spread false information\n\nShot in the front\n\n&gt; Mr. Brown, 18, was also shot four times in the right arm, he said, adding that all the bullets were fired into his front.\n\n[source wiki](http://en.wikipedia.org/wiki/Shooting_of_Michael_Brown#Autopsies)\n\n[source nytimes](http://www.nytimes.com/2014/08/18/us/michael-brown-autopsy-shows-he-was-shot-at-least-6-times.html?_r=0)\n\nShot from close range\n\n&gt; According to Baden, all of the rounds were fired from a distance of at least one to two feet.\n\n[source la times](http://www.latimes.com/nation/nationnow/la-na-nn-ferguson-michael-brown-20140817-story.html)",
                    "author": "pppppatrick",
                    "created_utc": 1416901143.0,
                    "replies": [
                        {
                            "name": "t1_cmcgc3h",
                            "parent_id": "t1_cmcfad1",
                            "body": "From the LA Times link \n&gt;Baden said his examination suggested that none of the six bullets was fired at point-blank range\n\nHmm... I figure \"at least one to two feet\" because of the lack of residue. One to two feet sure sounds point-blank to me.\n\n&gt;In the announcement, McCulloch revealed Wilson fired at Brown 12 times: twice from a car, then a further ten times in the street from 125 yards away. Six or seven bullets struck the teenager.\n\n[source](http://www.dailymail.co.uk/news/article-2848279/I-followed-training-followed-law-Officer-Darren-Wilson-issues-statement-following-decision-not-indict-s-revealed-shot-Michael-Brown-12-times.html)",
                            "author": "young_x",
                            "created_utc": 1416905514.0,
                            "replies": [
                                {
                                    "name": "t1_cmcuo78",
                                    "parent_id": "t1_cmcgc3h",
                                    "body": "That's strange that Darren's attorney would say the shots were fired from that distance when the St. Louis County and former Chief Medical Examiner of New York both came to the finding they were shot at close range.\n\nAs far as sources go, I'd pick the medical examiners over the dailymail.",
                                    "author": "TeBree",
                                    "created_utc": 1416943738.0,
                                    "replies": [
                                        {
                                            "name": "t1_cmcyukx",
                                            "parent_id": "t1_cmcuo78",
                                            "body": "The correct distance is the longer one.  The medical examiners' reports do not mean that the shots were fired from within 1-2 feet.  Rather, the reports mean that the shots were fired from a distance greater than 1-2 feet, i.e., far enough that there was no residue on the body.\n\nFor an analysis of the distance between the vehicle and the body, which is more consistent with the statement attributed to Wilson's attorney, see the linked article.  (And even if you are skeptical of the source, refer to the photos contained therein which illustrate the conclusion quite well in my view.)  http://www.dailykos.com/story/2014/11/20/1346374/-BREAKING-VIDEO-Police-Lied-Mike-Brown-was-killed-148-feet-away-from-Darren-Wilson-s-SUV# ",
                                            "author": "chicago_bunny",
                                            "created_utc": 1416950760.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cmdaz4s",
                                                    "parent_id": "t1_cmcyukx",
                                                    "body": "Eh,\n\nWhile those individuals made have lied, I'm not following the article's claim that he was killed 148 feet away. Darren got out of the SUV and perused Brown for a distance.\n\nDarren didn't just get out of his car and shot Brown as the article appears to allude too.",
                                                    "author": "TeBree",
                                                    "created_utc": 1416976167.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cmdh59o",
                                                            "parent_id": "t1_cmdaz4s",
                                                            "body": "Who are you saying lied?  I'm explaining how you reconcile the statements that you think are contradictory.\n\nThe medical examiners did not say that Wilson was shot from 1-2 feet, just that the distance was greater than that, providing no outer boundary.  *Wilson's* attorney gives a longer distance that is consistent in general terms with the conclusion reached in the article I linked.",
                                                            "author": "chicago_bunny",
                                                            "created_utc": 1416999445.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cmdk707",
                                                                    "parent_id": "t1_cmdh59o",
                                                                    "body": "Please quote the conclusion in the article, I'm not getting where you're getting these statements.",
                                                                    "author": "TeBree",
                                                                    "created_utc": 1417011843.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_cmcyo3d",
                                    "parent_id": "t1_cmcgc3h",
                                    "body": "Wasn't it 115 yards away *from the car*?",
                                    "author": "warmshower",
                                    "created_utc": 1416950454.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cmcfx2p",
                    "parent_id": "t1_cmcen1x",
                    "body": "The physical evidence shows that he was not turned around and that he was moving toward the police officer. \n\nYou can't argue with physical evidence. ",
                    "author": "Talpostal",
                    "created_utc": 1416903619.0,
                    "replies": [
                        {
                            "name": "t1_cmckzsq",
                            "parent_id": "t1_cmcfx2p",
                            "body": "You can't argue with physical evidence, but you can argue with someone's interpretation of the physical evidence.\n\nAs an aside, is there an explanation for why the body was found so far from the vehicle if the initial conflict and shooting took place in the vehicle and all the rounds were fired from close range? Not a rhetorical question, genuinely asking here.",
                            "author": "thebestwes",
                            "created_utc": 1416925646.0,
                            "replies": [
                                {
                                    "name": "t1_cmcnokp",
                                    "parent_id": "t1_cmckzsq",
                                    "body": "The other guy is mistaken that all shots occurred at close range. ",
                                    "author": "Talpostal",
                                    "created_utc": 1416931515.0,
                                    "replies": [
                                        {
                                            "name": "t1_cmcpv6l",
                                            "parent_id": "t1_cmcnokp",
                                            "body": "Ok, that makes sense. Thanks!",
                                            "author": "thebestwes",
                                            "created_utc": 1416935397.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_cmfxe5g",
                            "parent_id": "t1_cmcfx2p",
                            "body": "The evidence on his body is only from bullets that hit him. Some of the bullets missed. One of them grazed his arm and could have come from either direction.\n\nIt's not surprising that Wilson was only able to hit Brown after he had stopped running away, turned around with his hands up and begun to walk back towards the police SUV where Wilson was.\n\nThe witness testimony that I read generally agreed that Brown was being shot at as he ran away. That would also explain why he stopped running.\n",
                            "author": "courtenayplacedrinks",
                            "created_utc": 1417240116.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cmcetow",
            "parent_id": "t3_2nck53",
            "body": "It's entirely possible that Wilson believe himself to be in danger. That doesn't excuse anything,  nor should it have been relevant. The goal of police training and procedure is twofold;  to not place themselves in positions where they might need to fire to defend themselves,  and to help reduce the risk of incorrectly identifying some non dangerous situation as dangerous. \n\nIf I punch you in the face,  I may have reason to worry that you may then hurt me; this is not justification for shooting you. Wilson screwed up. Maybe he screwed up honestly believing he was in danger,  but he put himself there,  against proper procedure,  then overreacted. That's not to say he didn't think he was in danger - but he had the responsibility not to screw up the way he did.",
            "author": "davidmanheim",
            "created_utc": 1416899514.0,
            "replies": [
                {
                    "name": "t1_cmcf7ri",
                    "parent_id": "t1_cmcetow",
                    "body": "I think whether Wilson *reasonably* believed himself to be in danger is a key issue.  I also think that the actions Wilson is alleged to have taken in the moments following their altercation in the car were reasonable.  The officer pursued the two boys as they ran from his car, which I think is a perfectly reasonable thing for a police officer to do, and shot Brown at some point after he'd turned around.\n\nWhat Brown was actually doing after he turned around is under dispute, but the fact that there's a reasonable chance Brown was behaving in a way that would have appeared life-threatening to Wilson is, I think, sufficient legal justification for the action Wilson took.  My belief isn't even that Wilson was acting purely in self defense; my position is that it is *sufficiently likely* that Wilson was acting in self-defense, and that as a result he should not be put in jail.",
                    "author": "Technologenesis",
                    "created_utc": 1416900882.0,
                    "replies": [
                        {
                            "name": "t1_cmcfbgi",
                            "parent_id": "t1_cmcf7ri",
                            "body": "I'm confused. Is it ok for the police to use procedures that require them to kill in self defense,  instead of ones that are more effective, less discriminatory,  and accidental plausibly racial homicide free? \n\nBecause, to clarify,   you are saying that he acted in a way that police are trained not to do - they are supposed to cover the suspect from a safe distance. More than that, they stay far enough back to get backup before am altercation. If an officer fails to follow proper procedure, who else can you blame for the death? ",
                            "author": "davidmanheim",
                            "created_utc": 1416901257.0,
                            "replies": [
                                {
                                    "name": "t1_cmcfjhb",
                                    "parent_id": "t1_cmcfbgi",
                                    "body": "I mean I had been under the impression that Wilson was pretty far back at the time of the shooting, so it seems like he did stay fairly far back. If he was rushed at, which as far as I'm aware is a perfectly reasonable possibility, shooting would have been the right thing to do despite the fact that he had tried to maintain a reasonably safe distance.\n\nIf you're talking about the altercation at the car, I don't think that's fair at all. An officer can't be expected to stay 50 feet away from absolutely everyone he confronts.\n\nActually though I see something here that might change my view.  What do you think the proper protocol was?  How should Wilson have handled the situation?  As far as I could see, Wilson was taking the most reasonable options available to him, or at least there's reason to believe he may well have been.  If I see something else that was more reasonable, though, I think I would change my view.",
                                    "author": "Technologenesis",
                                    "created_utc": 1416902085.0,
                                    "replies": [
                                        {
                                            "name": "t1_cmcgspm",
                                            "parent_id": "t1_cmcfjhb",
                                            "body": "\"My main goal was to keep eyes on him and just to keep him contained until I had people coming there,\" he testified.\n\n\"Keep him contained\" doesn't sound like what you want to do to de-escalate. Once he was physically attacked,  when other officers were on the way,  chasing Brown closely was escalating. \n\nWas Wilson guilty for ignoring procedures that would have prevented the death of brown? No.  Police don't need to follow procedure in order to be allowed to use their weapons. But was it his fault?  Absolutely. ",
                                            "author": "davidmanheim",
                                            "created_utc": 1416907774.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cmcn89s",
                                                    "parent_id": "t1_cmcgspm",
                                                    "body": "I think /u/z3r0shade's comment changed my view, but you definitely contributed to that, so thanks for the thoughtful responses!  I figure for all the effort you put forward you certainly deserve one of these, because your comments helped reveal that there were aspects of the shooting I hadn't been aware of.  &amp;#8710;",
                                                    "author": "Technologenesis",
                                                    "created_utc": 1416930648.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cmcoc3o",
                                                            "parent_id": "t1_cmcn89s",
                                                            "body": "Confirmed: 1 delta awarded to /u/davidmanheim. ^[[History](/r/changemyview/wiki/user/davidmanheim)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][[Subreddit](http://www.reddit.com/r/DeltaBot/)]",
                                                            "author": "DeltaBot",
                                                            "created_utc": 1416932726.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "name": "t1_cmctjrg",
                                                    "parent_id": "t1_cmcgspm",
                                                    "body": "You're suggesting he should have just let brown go to de-escalate? ",
                                                    "author": "ilikewc3",
                                                    "created_utc": 1416941872.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cmddi26",
                                                            "parent_id": "t1_cmctjrg",
                                                            "body": "Why not?",
                                                            "author": "Raborn",
                                                            "created_utc": 1416982964.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cmddpyb",
                                                                    "parent_id": "t1_cmddi26",
                                                                    "body": "Because brown had assaulted a police officer? ",
                                                                    "author": "ilikewc3",
                                                                    "created_utc": 1416983670.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_cmde47f",
                                                                            "parent_id": "t1_cmddpyb",
                                                                            "body": "And assault justifies murder..... where? If he's afraid for his life, let him go seems like the correct response.",
                                                                            "author": "Raborn",
                                                                            "created_utc": 1416985011.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_cmde6il",
                                                                                    "parent_id": "t1_cmde47f",
                                                                                    "body": "So just to be clear.... your stance is that if an officer is assaulted he should de-escalate/ let the suspect go rather than attempt an arrest? It obviously doesn't justify murder but if the suspect becomes aggressive and dangerous the officer should just... run away? Tell the suspect it's all good just go home?  \n\nYou don't see any problem with that stance? ",
                                                                                    "author": "ilikewc3",
                                                                                    "created_utc": 1416985239.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "name": "t1_cmeg0mb",
                                            "parent_id": "t1_cmcfjhb",
                                            "body": "&gt; How should Wilson have handled the situation? \n\nHe could have just rolled his window up.",
                                            "author": "AliceHouse",
                                            "created_utc": 1417095404.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_cmcmrsu",
                            "parent_id": "t1_cmcf7ri",
                            "body": "&gt; but the fact that there's a reasonably chance Brown was behaving in a way that would have appeared life-threatening to Wilson is, I think, sufficient legal justification for the action Wilson took.\n\nIf nothing else, this is a question that should be explored and answered *at a trial* not a grand jury hearing and thus the point of hte outrage over the lack of indictment. ",
                            "author": "z3r0shade",
                            "created_utc": 1416929731.0,
                            "replies": [
                                {
                                    "name": "t1_cmcn4c4",
                                    "parent_id": "t1_cmcmrsu",
                                    "body": "Fuck it, you know what, that's actually a really good point.  He should have been taken to trial so the sequence of events could have been explored more thoroughly.  View changed.  Let me go look up how to award one of them delta thingies.\n\n&amp;#8710; There.  Hopefully that works!",
                                    "author": "Technologenesis",
                                    "created_utc": 1416930438.0,
                                    "replies": [
                                        {
                                            "name": "t1_cmcnb1u",
                                            "parent_id": "t1_cmcn4c4",
                                            "body": "Huzzah! :) Thanks.",
                                            "author": "z3r0shade",
                                            "created_utc": 1416930796.0,
                                            "replies": []
                                        },
                                        {
                                            "name": "t1_cmcod2r",
                                            "parent_id": "t1_cmcn4c4",
                                            "body": "Confirmed: 1 delta awarded to /u/z3r0shade. ^[[History](/r/changemyview/wiki/user/z3r0shade)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][[Subreddit](http://www.reddit.com/r/DeltaBot/)]",
                                            "author": "DeltaBot",
                                            "created_utc": 1416932774.0,
                                            "replies": []
                                        },
                                        {
                                            "name": "t1_cmculcq",
                                            "parent_id": "t1_cmcn4c4",
                                            "body": "Hey OP - [this article](http://www.vox.com/2014/11/25/7281165/darren-wilsons-story-side) speaks to the reason you gave that delta. Very good analysis of Wilson's side of the story and comes to the same conclusion that you have. You might find it worth reading! \n\n",
                                            "author": "Super_Duper_Mann",
                                            "created_utc": 1416943611.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cmhuo9v",
                                                    "parent_id": "t1_cmculcq",
                                                    "body": "Why would he rob a liquor store? Why would he assault a clerk then return to intimidate said clerk? He was a aggressive idiot ",
                                                    "author": "deadmankw",
                                                    "created_utc": 1417440058.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_cmcswx6",
                                    "parent_id": "t1_cmcmrsu",
                                    "body": "This ignores the purpose of a grand jury. ",
                                    "author": "RYouNotEntertained",
                                    "created_utc": 1416940799.0,
                                    "replies": [
                                        {
                                            "name": "t1_cmcsys2",
                                            "parent_id": "t1_cmcswx6",
                                            "body": "How? The grand jury's purpose is **not to make findings of fact** it is solely to determine if there is enough evidence to warrant a trial. Whether or not Brown was behaving in a way that would have appeared life-threatening to Wilson is something that was in dispute and not an established fact and as such should be determined at trial and not at the grand jury.",
                                            "author": "z3r0shade",
                                            "created_utc": 1416940887.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cmctbr7",
                                                    "parent_id": "t1_cmcsys2",
                                                    "body": "&gt;Whether or not Brown was behaving in a way that would have appeared life-threatening to Wilson\n\nThe grand jury believed there was not enough evidence to even make this worth examining. In other words, the physical evidence is fairly stacked in favor of the officer, so a trial would be a waste of time. \n\nThe prosecutor could choose to go to trial anyway, but this helps them establish if there's even a case to be made. \n\nEdit: \n&gt;is something that was in dispute \n\nTo be more clear, the grand jury helped the prosecutor establish that this was NOT actually in dispute. Well, in a legal sense. In dispute on social media, different story. ",
                                                    "author": "RYouNotEntertained",
                                                    "created_utc": 1416941502.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cmcuacl",
                                                            "parent_id": "t1_cmctbr7",
                                                            "body": "&gt; The grand jury believed there was not enough evidence to even make this worth examining. In other words, the physical evidence is fairly stacked in favor of the officer, so a trial would be a waste of time.\n\nAgain, you're assuming this. You're ignoring the possibility of juror bias against prosecuting a cop, or prosecutorial bias affecting the way the grand jury was presented evidence. You're ignoring the fact that the prosecutor never even suggested a charge and just told the jury to figure it out themselves. Just because the grand jury in this case declined to give a writ, does not mean it was because there was *actually* not enough evidence to make it worth examining.\n\n&gt; The prosecutor could choose to go to trial anyway, but this helps them establish if there's even a case to be made.\n\nWhat? If the grand jury doesn't indict, they cannot choose to go to trial. \n\n&gt; To be more clear, the grand jury helped the prosecutor establish that this was NOT actually in dispute. Well, in a legal sense. \n\nSee above about the assumptions you're making here.",
                                                            "author": "z3r0shade",
                                                            "created_utc": 1416943101.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cmcvtgd",
                                                                    "parent_id": "t1_cmcuacl",
                                                                    "body": "The prosecutor didn't recommend a specific charge but listed several charges from murder to involuntary manslaughter then the jury would have to pick one of those to indict on or not indict.\n\nOf course, the jury could be biased or the prosecutor purposely picked certain evidence but I haven't seen anything indicating that this had occurred.",
                                                                    "author": "TeBree",
                                                                    "created_utc": 1416945676.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_cmhz6zz",
                                                                            "parent_id": "t1_cmcvtgd",
                                                                            "body": "The prosecutor called on Wilson to make his testimony.  In a proceeding that's supposed to determine if there is enough evidence to indict, why would Wilson be called on unless the prosecutor was seeking to not indict?",
                                                                            "author": "Harold_Smith",
                                                                            "created_utc": 1417451920.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_cmj8lod",
                                                                                    "parent_id": "t1_cmhz6zz",
                                                                                    "body": "That may hold some weight but I don't see how having Wilson testify is inherently bad or good but seems awfully neutral.",
                                                                                    "author": "TeBree",
                                                                                    "created_utc": 1417555178.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "name": "t1_cmcwaqt",
                                                                    "parent_id": "t1_cmcuacl",
                                                                    "body": "There are two conversations going on here, one about the purpose of a grand jury *in general,* and another about the grand jury *in this case.* You're right that I'm making assumptions about the grand jury in this case -- this was to illustrate the point in my original post about the purpose of a grand jury in general.\n\nIt's weird to me to say, \"This case needs to go to trial so we can examine the evidence,\" when the purpose of a grand jury is to see if there's enough evidence to examine in the first place. *In general,* if a grand jury doesn't indict, it means there is insufficient evidence.  The reason this is rare is because prosecutors won't typically waste their time with cases that would be difficult to get an indictment.  They just drop them.\n\nIn this case in particular, yes, I worry about pro-police bias, etc.  Officer Wilson aside, it also raises some important questions about police procedures in general.\n\n&gt;What? If the grand jury doesn't indict, they cannot choose to go to trial.\n\nYes they can, they just have to go through a judge:\n\nhttp://criminal.findlaw.com/criminal-procedure/how-does-a-grand-jury-work.html",
                                                                    "author": "RYouNotEntertained",
                                                                    "created_utc": 1416946497.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_cmcz2h1",
                            "parent_id": "t1_cmcf7ri",
                            "body": "I just read two full testimonies, one by Darren Wilson and one by Michael Brown's friend, who was with him at the time. It's hard to read either account without noting that Wilson did not make it clear to the men what was taking place before initiating the altercation. Wilson had yelled from his window for the two to stop walking in the street, and was upset when they didn't immediately change course. He reversed to them, tried to open his door, but it shut back on him because he didn't have room to open it. So, Wilson grabbed Brown by the neck from his window and started lecturing him, though no one is sure of their conversation, this is when the scuffle started.\n\nThis cop didn't use his speaker or lights or follow any normal police procedures to let these guys know what was going on. I don't dispute that Brown scared him at some point, but he approached this in a way that escalates situations, not defuses them as police are trained to do. Had Brown not died, it's more likely he would have received punishment for how poorly this situation was handled.",
                            "author": "theslowwonder",
                            "created_utc": 1416951130.0,
                            "replies": [
                                {
                                    "name": "t1_cmdmp56",
                                    "parent_id": "t1_cmcz2h1",
                                    "body": "That wasn't the case, Brown shut the door on Wilson twice. He then proceed to punch Wilson on the face 2 . Wilson try to  the  with his right hand and threaten to shoot Brown. Brown than replied with \"you're to much of a pussy to shoot \". They than struggle and you know  rest.",
                                    "author": "JoesephKerr",
                                    "created_utc": 1417017488.0,
                                    "replies": [
                                        {
                                            "name": "t1_cmdpt23",
                                            "parent_id": "t1_cmdmp56",
                                            "body": "This is Wilson's version of the story. That's why I'm encouraging people to read the other testimony of the only other person that saw the whole thing. When you merge the stories, the truth starts to look more obvious. Two big guys in a confusing, but needless situation, both unsure if the other guy was trying to kill him. That's my take away.",
                                            "author": "theslowwonder",
                                            "created_utc": 1417024170.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cmehocs",
                                                    "parent_id": "t1_cmdpt23",
                                                    "body": "By the other guy you mean Brown's friend testimony or witness #14? I'm sorry but I haven't yet to believe any other statement besides Wilson's (but yes, I have read it) because of the contradictions between other eye witness that backups Brown's friend statement, some of them even admitted that they never actually see the incident, just hear about it from another people. It's really hard to believe when people backing up that story constantly tells lies about it.",
                                                    "author": "JoesephKerr",
                                                    "created_utc": 1417101028.0,
                                                    "replies": []
                                                },
                                                {
                                                    "name": "t1_cml4no6",
                                                    "parent_id": "t1_cmdpt23",
                                                    "body": "What about witness #10? You act like Brown's friend is the ultimate source for correct information and beyond bias, but his friend was just shot. Witness #10 was completely neutral and his story backed Wilson's.",
                                                    "author": "cjacobson22",
                                                    "created_utc": 1417716559.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cml5ds9",
                                                            "parent_id": "t1_cml4no6",
                                                            "body": "To act like the person on trial is 100% honest and free of bias is the height of ignorance.",
                                                            "author": "theslowwonder",
                                                            "created_utc": 1417717786.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cml5jb9",
                                                                    "parent_id": "t1_cml5ds9",
                                                                    "body": "&gt;To act like **anyone** is 100% honest and free of bias is the height of ignorance.\n\nWhy trust Browns friend over Wilson or witness #10?",
                                                                    "author": "cjacobson22",
                                                                    "created_utc": 1417718047.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_cml5ri5",
                                                                            "parent_id": "t1_cml5jb9",
                                                                            "body": "The nature of eye witness accounts is that none of them are fully reliable. Dorian Johnson's testimony is compelling because it puts negative light and responsibility on both Michael Brown and Darren Wilson. Combined with Wilson's testimony it paints a more believable story of two people contributing to a confusing and dangerous situation.",
                                                                            "author": "theslowwonder",
                                                                            "created_utc": 1417718430.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cmcg1sw",
                    "parent_id": "t1_cmcetow",
                    "body": "Asking someone to not walk in the road is not proper procedure?  ",
                    "author": "nrjk",
                    "created_utc": 1416904200.0,
                    "replies": [
                        {
                            "name": "t1_cmdn3uc",
                            "parent_id": "t1_cmcg1sw",
                            "body": "What he's saying is that Wilson should have just keep an eye  Brown until backup arrive, not rolling down his window and confronted Brown",
                            "author": "JoesephKerr",
                            "created_utc": 1417018295.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cmclswv",
                    "parent_id": "t1_cmcetow",
                    "body": "Being punched in the face can be deadly and justifies the use of lethal force.",
                    "author": "Last_Jedi",
                    "created_utc": 1416927610.0,
                    "replies": [
                        {
                            "name": "t1_cmcnu78",
                            "parent_id": "t1_cmclswv",
                            "body": "For so long as the person who punched you continues their assault, perhaps. Once they have begun to run away, that justification is gone.",
                            "author": "TBFProgrammer",
                            "created_utc": 1416931811.0,
                            "replies": [
                                {
                                    "name": "t1_cmco6tc",
                                    "parent_id": "t1_cmcnu78",
                                    "body": "If you punch a police officer, you don't get to \"just run away\". You get arrested. When Wilson attempted to go after Brown to arrest him, Brown allegedly turned around to continue his assault. This is corroborated by the fact that Brown was shot from the front, not from the back as he was running away.",
                                    "author": "Last_Jedi",
                                    "created_utc": 1416932454.0,
                                    "replies": [
                                        {
                                            "name": "t1_cmcp8ut",
                                            "parent_id": "t1_cmco6tc",
                                            "body": "The punch remains irrelevant to whether lethal force was justified later on.\n\nAs to the assertion that Brown was shot from the front, at least two of his wounds could only have been sustained from the front if his arms were raised in surrender. Since the hand wound was sustained in the fight in the car, during which only two shots were fired, only one of the two inner arm wounds could have been sustained during that altercation.\n\nEither Brown attempted to surrender or he was shot from behind.",
                                            "author": "TBFProgrammer",
                                            "created_utc": 1416934312.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cmcqyzn",
                                                    "parent_id": "t1_cmcp8ut",
                                                    "body": "&gt; at least two of his wounds could only have been sustained from the front if his arms were raised in surrender\n\nDo you have any source for this?",
                                                    "author": "Last_Jedi",
                                                    "created_utc": 1416937285.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cmcuc2d",
                                                            "parent_id": "t1_cmcqyzn",
                                                            "body": "The corner couldn't determine if his hand were raised when he was shot. \n\nNone of the witnesses stories were consistent. Some say he had his hands by his side, some down or in a fight position.",
                                                            "author": "TeBree",
                                                            "created_utc": 1416943178.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "name": "t1_cmd7hnf",
                                                    "parent_id": "t1_cmcp8ut",
                                                    "body": "[deleted]",
                                                    "author": "[deleted]",
                                                    "created_utc": 1416968194.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cmdxdee",
                                                            "parent_id": "t1_cmd7hnf",
                                                            "body": "You cannot legally shot anyone in the back even if you're cop unless they're present immediate danger to someone. Example, about to stab or shoot someone but if I rob a bank and I'm running away with no weapon you have to chase me down. I can't just be shot.",
                                                            "author": "TeBree",
                                                            "created_utc": 1417038751.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cmedpvb",
                                                                    "parent_id": "t1_cmdxdee",
                                                                    "body": "Not true. They just have to reasonably believe that someone else is in danger to shoot you in the back. They are also allowed to shoot you in the back to prevent you from escaping if they suspect you of a violent felony (even if they don't believe anyone else is in danger). I don't agree with the law, but that is the law. Wilson just had to say that he was concerned that Brown might attack another cop coming from the other direction and he had covered himself. http://www.vox.com/2014/11/24/7175967/darren-wilson-charges-michael-brown-ferguson",
                                                                    "author": "vertov",
                                                                    "created_utc": 1417083458.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_cmcpg05",
                            "parent_id": "t1_cmclswv",
                            "body": "Giving someone a quad-stacker from Burger king can be deadly, and justifies the use of lethal force.\n\nHaving open heart surgery can be deadly, and justifies the use of lethal force.\n\nSecond hand smoke can be deadly, and justifies the use of lethal force.\n\nOr is the officer a trained professional, whom should be able to react in ways above and beyond the average person?",
                            "author": "nintynineninjas",
                            "created_utc": 1416934656.0,
                            "replies": [
                                {
                                    "name": "t1_cmcs6r1",
                                    "parent_id": "t1_cmcpg05",
                                    "body": "Have someone punch you and see how 6 months of training does you. Not everyone is a martial arts master than can subdue an assailant with non-lethal force. Give us some options instead of giving a a vague \"he dun bin a trained proffessional.\"",
                                    "author": "emotional_panda",
                                    "created_utc": 1416939531.0,
                                    "replies": [
                                        {
                                            "name": "t1_cmcue6k",
                                            "parent_id": "t1_cmcs6r1",
                                            "body": "Please.\n\nWithout so much professional training as it is on the job experience, take a look at the life of someone who takes care of 21+ year old autistic adults as caregivers.\n\nI have seen the wounds. I've lived through lawsuits and lifechanging injuries. I've seen bite marks. Bite. Marks. Not only can you not up and shoot them, not only can you not use chemical sedation, you have to use simple physical restraint by one or more people to put them in a supine and hope help gets there before you get overpowered. \n\nGet a chair thrown at you. Get bitten and be not allowed to scream or react at all. Have someone 50lbs your senior and 80 IQ points your inferior come at you like a raging bull. \n\nIf people can be trained and briefed on how to take down unarmed (or melee equipped) people with no concept of injury or harm in a blind rage without any collateral damage to the subject, he damn well could have handled it better.\n\nI'm not saying the officer had to react THAT severely, but he had full ability to get to non-lethal before jumping up to shooting him 12 times. If THAT was his reaction to THAT scenario, he is unfit to be an officer of the law with a lethal weapon capacity. I expect that my tax dollars do not go to hiring glorified town guards. I expect my tax dollars go to highly trained officers equipped with mental training to de-escalate violent situations and use the least amount of lethality in their responses. \n\n",
                                            "author": "nintynineninjas",
                                            "created_utc": 1416943276.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cmcztsw",
                                                    "parent_id": "t1_cmcue6k",
                                                    "body": "Then I guess you really do want to live a world of nonsense and facism. The two situations you've compared are so laughably different that I know that you must be ignorant by choice. \"I work with a staff of people specifically trained and put in close proximity to me so that 5 of us can physically subdue 1 person. Obviously, cops are the same because criminals and autists function on the same level and officers always have backup ready.\" What you propose is laughable because you seem to value life for no apparent reason. Situation come up where it is more convenient to kill someone than to risk getting hurt or killed. If you can't accept that then maybe you should lead by example and try to physically restrain a criminal that is intent on killing you.",
                                                    "author": "emotional_panda",
                                                    "created_utc": 1416952382.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cmd0418",
                                                            "parent_id": "t1_cmcztsw",
                                                            "body": "&gt; Then I guess you really do want to live a world of nonsense and facism.\n\nCant wait to see how this ties in.\n\n&gt; The two situations you've compared are so laughably different that I know that you must be ignorant by choice. \"I work with a staff of people specifically trained and put in close proximity to me so that 5 of us can physically subdue 1 person.\n\nYeah... 5 staff per client. I'm waiting to hear about the day that happens. Half the time in the situations explained to me, you're lucky if you get 1::1 coverage. At times, it's just you and your client, and if he goes batshit you're hitting the panic button and praying the response time is shorter than 10 minutes. Oh, and one insanely strong person.\n\n&gt; What you propose is laughable because you seem to value life for no apparent reason.\n\nMust be confirmation bais... as I am alive. Sorry, but you're going to deal with someone here who deems that everyone alive deserves to not be killed. Now, I'm not Vash the Stampede, I'm not going to say that there are no situations where killing is not the better option, but it's never the best option, and such situations still have killing as a last resort. I'm sorry you seem to think some lives are inherently worth more than others.\n\n\n&gt; Situation come up where it is more convenient to kill someone than to risk getting hurt or killed. If you can't accept that then maybe you should lead by example and try to physically restrain a criminal that is intent on killing you.\n\nThis isn't about me, it's about someone who is trained to react to any situation involving fear with lethal responses. Just because some poorly trained cop gets scared, does not give him the right to take the life of another human being. \n\nOh, I guess that whole fascism thing you opened with didn't pan out. Imagine that.",
                                                            "author": "nintynineninjas",
                                                            "created_utc": 1416952875.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cmdfadm",
                                                                    "parent_id": "t1_cmd0418",
                                                                    "body": "Admittedly the facism thing was just bullshit. But here are some points we can move along on. \n\n1)Cops are trained to subdue people. This is true, but they are also trained to be physically fit, courteous/professional, and competent in the law. However, most cops rarely get more than 6 months of training. Taking into account that 6 months of doing anything puts the average person at a skill level of just above novice, we have to know what their abilities are. Cops will not be able to stop an assailant without causing serious injury or death. Just like anyone else, they are entitled to kill if an assailant presents them with the intent to harm/kill them. Police do not magically have the ability to subdue criminals.\n\n2)Killing someone is rarely the best option. But we hardly choose our circumstances, especially when our assailants force those circumstances on us. We have to recognize that police officers being attacked can not change circumstances simply because they have been trained. They are just like any other average person. And so they should be given the right to defend themselves just like any other average person.\n\n3)If cops should/ought to be the type of people to be able to prevail over these kinds of circumstances then we need to either extend the rights of the average citizen as to make the service of police obsolete or we need to extensively reconstruct the way we train police officers. I think that in order to satisfy your standard of what an officer should be able to do, we need to train them to be on par with special military forces. The problem with that is that we give the government a paramilitary force in small towns. \nImagine if you will: Police are trained to a standard such that they can physically subdue someone 100lbs heavier than them. Do we really want every police officer in our town to have that much power? Do we want government giving orders to such people? Police forces are already corrupt but now they have the physical power to act with impunity. I guess this is where my facism thing ties in.\n\nIn short, we either need to give more rights to citizens so that police are obsolete and we can avoid police brutality or we must train police to be on par with the military and risk giving government and police too much power.\n\n",
                                                                    "author": "emotional_panda",
                                                                    "created_utc": 1416989577.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_cmdipw7",
                                                                            "parent_id": "t1_cmdfadm",
                                                                            "body": "1) Seems like you agree with me that cops are glorified town guards unless they take it upon themselves (or previous military/ABA training) to get the extra skills that are required to be a good cop. As it stands, you're handing glass cannon (easily made useless, but irresponsibly powerful) omniphobes a gun and pushing green cops onto dangerous streets. \n\n2) Training is there to give you agency when your frontal cortex just cant get the time to react rationally. We train them to stay alive, but not how to deal with the people they're there to serve and protect. \n\nAnd I agree with all of it until the \"just like any other average person\". Regardless of it's source, \"with great power comes great responsibility\" is so true here it hurts. They have the power to walk around with lethal weapons, and we trust that they use them to defend the innocent and especially as a tool to de-escalate a situation already out of control. Even from his own counts, Brown was at one point running from his car and he decided to get out. What had happened if instead of just missing him with the first shot (Wilson's own account), that he'd hit someone else on the street? Is taking down one robbery suspect worth that? He was confident enough in his own aim to miss bystanders and hit Brown. He was wrong on one account. Thankfully it wasn't worse.\n\n3) \n&gt; or we need to extensively reconstruct the way we train police officers.\n\nYou hit the nail on the head, but bend it later on.\n\nNot only do officers need such training that they can subdue a person 100 lbs their gravitational superior, but behavioral and psychological training to not only pick out the assholes, but gain the ability to swallow their pride if it means everyone walks away unharmed.\n\nYou know what though, I realize what I'm looking for in a cop after all this. I'm looking for what I was taught cops were when I was a kid: heroes in blue. The men and women who put their lives on the line to keep safe the people of the town they protect. Instead, we get glorified town guards with itchy trigger fingers and a penitent for bullying unsatisfied since high school. Is it actually that clear cut? No, of course not, but the pendulum has swung further towards \"deuchbadge\" than \"officer hero\".",
                                                                            "author": "nintynineninjas",
                                                                            "created_utc": 1417007215.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_cmdtn63",
                                                                                    "parent_id": "t1_cmdipw7",
                                                                                    "body": "I think we have more common ground than we thought. Essentially, yes, cops are town guards with itchy trigger fingers. I don't think we'll ever see them trained to any standard of competence. We have to stop worrying about cops and start talking about giving citizens the rights to defend themselves. At least when citizens defend themselves they are held liable to the full extent of the law. In this way, we can create a culture where it is understood that assaulting someone has deep consequences but that defending your life also has some restrictions.",
                                                                                    "author": "emotional_panda",
                                                                                    "created_utc": 1417031237.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "name": "t1_cmeg54f",
                                                                            "parent_id": "t1_cmdfadm",
                                                                            "body": "&gt; we need to train them to be on par with special military forces.\n\nFunny thing that, part of being spec ops is being *part of the community*. You have to actually get to know people by name and speak their language. Could you imagine if Darren Wilson wasn't a stranger and was a part of the community enough that him and Mike Brown were two people who knew each other and got along?\n\nThat would be pretty sweet.",
                                                                            "author": "AliceHouse",
                                                                            "created_utc": 1417095896.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_cmenx3z",
                                                                                    "parent_id": "t1_cmeg54f",
                                                                                    "body": "That would be great.",
                                                                                    "author": "emotional_panda",
                                                                                    "created_utc": 1417115288.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cmcucv0",
                    "parent_id": "t1_cmcetow",
                    "body": "What do you think Wilson should have done differently to avoid that dangerous situation? My understanding is that he merely asked Brown to leave the road, parked in middle of the street when Brown refused, and was attacked before he left his car.",
                    "author": "marcopolo22",
                    "created_utc": 1416943215.0,
                    "replies": []
                },
                {
                    "name": "t1_cmd6eq8",
                    "parent_id": "t1_cmcetow",
                    "body": "So when a suspect wishes to evade police, the police should just let the criminal go? Darren Wilson allegedly initially told Michael Brown to get out of the middle of the road and soon after realized he may be a suspect in a convenience store robbery, which Brown had indeed just committed.",
                    "author": "matthedev",
                    "created_utc": 1416965788.0,
                    "replies": [
                        {
                            "name": "t1_cmdamo2",
                            "parent_id": "t1_cmd6eq8",
                            "body": "\"The American legal system is founded on the idea that it is better to let a guilty man go free than convict an innocent man\"\n\nThis seems to be the converse; it's better to escalate and kill a potentially innocent suspect, rather than let a single potentially guilty suspect go.",
                            "author": "davidmanheim",
                            "created_utc": 1416975326.0,
                            "replies": [
                                {
                                    "name": "t1_cmdupvw",
                                    "parent_id": "t1_cmdamo2",
                                    "body": "In the encounter between Michael Brown and Darren Wilson, things were not at trial, which is where this standard of innocence until proven guilty applies. Obviously police cannot arbitrarily search people and places without a warrant or proper suspicion, which is part of our system of due process.\n\nHowever, if an individual is innocent and happens to match the profile of a suspect that just fleed the scene of a crime nearby, running away or tussling with the cop is not the appropriate response. There is a legal process to handle this. If someone just robbed a bankor a convenience storefor example, the police should not just give up because the suspect isn't going to play nice and submit to questioning or arrest. If this happened, criminals would always just run away, and the police would be powerless because to do anything more would be to \"escalate.\"\n\nMichael Brown did not want to go to jail for what he had just done, I would imagine. In all likelihood, if he had submitted to arrest, he would have been in jail for a few hoursor a few days max until he was bailed outand then given a fine, community service, and probation (of course he may have feared he'd spend the next six months in jail); his crime was not the most serious. Unfortunately, if the testimony and gunshot evidence is indeed all accurate, he doubled down on the stupid and decided to fight back against the police officer.",
                                    "author": "matthedev",
                                    "created_utc": 1417033625.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cmdx8vk",
                    "parent_id": "t1_cmcetow",
                    "body": "Wait how did Wilson screw up?  He was dealing with a suspect behaving irrationally, he had just taken 2 punches to the face, and he was in too close to use mace.  When he drew his gun to deter the suspect, the suspect grabbed his gun and began to overpower him. He had two choices 1) let the suspect overpower him or 2) shoot the suspect.\n\nAs a 15 year old kid in New Orleans, I had a cop pull his gun on me when he saw me with a bb gun.  I have no double that if I had so much as made a grab for that cop's gun I would have been shot.  Its simple common sense.  You go for a cop's gun, you get shot, race has nothing to do with it. \n\nThe only way Wilson screwed up is if his story is a complete lie and he just shot the kid for nothing.",
                    "author": "culgar165",
                    "created_utc": 1417038503.0,
                    "replies": []
                },
                {
                    "name": "t1_cml4gcq",
                    "parent_id": "t1_cmcetow",
                    "body": "It is under the law, so yeah it kind of matters to a jury. Brown was charging him according to several witnesses. Considering the conflict in the car, that alone gives him reason to believe he was in danger. In what way are you suggesting that Wilson put himself in the situation?",
                    "author": "cjacobson22",
                    "created_utc": 1417716205.0,
                    "replies": [
                        {
                            "name": "t1_cmlgiy7",
                            "parent_id": "t1_cml4gcq",
                            "body": "Proper procedure would be to wait for backup and try tomake sure a violent suspect doesn't create a situation where your life is in danger.\n\nClearly after walking away,  Wilson did something to cause Brown to turn around - why was he confronting him alone in close quarters? And if it wasn't close quarters,  why did he feel threatened enough to keep shooting?",
                            "author": "davidmanheim",
                            "created_utc": 1417737112.0,
                            "replies": [
                                {
                                    "name": "t1_cmlh163",
                                    "parent_id": "t1_cmlgiy7",
                                    "body": "Walking away? He ran from the car. He was being confronted because he hit a cop. The cop then pursued him. He kept his distance and didn't fire. Then brown, probably because Wilson was following him, charged at Wilson. Only then did Wilson shoot the man. ",
                                    "author": "cjacobson22",
                                    "created_utc": 1417738084.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cmcst1p",
            "parent_id": "t3_2nck53",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1416940611.0,
            "replies": [
                {
                    "name": "t1_cmd6qw2",
                    "parent_id": "t1_cmcst1p",
                    "body": "Police brutality and targeting of minorities may be a real problem, but you can't punish Darren Wilson for this. You need to look at the particulars of the case, not broad-stroke generalities that sound good in editorials.\n\nMichael Brown had just robbed a convenience store. Minutes later, he was walking down the middle of the street with his friend/accomplice. Darren Wilson's side is something like he initially told him to get out of the middle of the street and then realized he fit the suspect profile for the robbery, so he confronted the pair again which is when Brown became aggressive.\n\nMy initial knee jerk was that this sounded like another example of police brutality towards minorities, but after following the story over the past few months, I became increasingly convinced Wilson was probably justified. In a perfect society, Michael Brown's death would not have occurred, but then again, in a perfect world, Michael Brown would not have robbed the store and then fought with Darren Wilson for his gun.",
                    "author": "matthedev",
                    "created_utc": 1416966532.0,
                    "replies": [
                        {
                            "name": "t1_cmd8nf9",
                            "parent_id": "t1_cmd6qw2",
                            "body": "[deleted]",
                            "author": "[deleted]",
                            "created_utc": 1416970783.0,
                            "replies": [
                                {
                                    "name": "t1_cmd9bwo",
                                    "parent_id": "t1_cmd8nf9",
                                    "body": "&gt; I might not, but people punish each other for far less than this all the time.\n\nOf course we can let mob justice be the order of the day. If indictment and conviction is the desired outcome, no, it looks like we cannot indict Darren Wilson for murder just to make people feel better.\n\n&gt; This is a dishonest rhetorical tactic. Society need not be perfect to be better....\n\nOkay then, in a \"better society,\" to use the words from your grandparent post, Michael Brown would not have robbed a convenience store and then responded aggressively to a police officer.\n\n&gt; Particularly if we presume Brown's guilt regarding the robbery....\n\nWell, there is video evidence, and I think even the Brown family has conceded this point.",
                                    "author": "matthedev",
                                    "created_utc": 1416972324.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cmfx2yt",
            "parent_id": "t3_2nck53",
            "body": "From reading all the witness testimonies that would open in my browser and other evidence there seemed to be a general agreement that:\n\n* There was a scuffle in the car and Brown was shot\n* Michael Brown got free and ran a significant distance away (50 yards)\n* Darren Wilson shot at Brown as he was running away, but didn't hit him (one bullet might have grazed him)\n* Brown turned around, put his hands up and started walking back, lowering his head\n* Wilson continued to shoot at Brown and finally killed him with a shot to the head\n\nThe whole encounter apparently lasted roughly a minute.\n\nIt seems unlikely to me that Wilson made up much of the distance during that time. He probably got out of the car and started shooting from where he was. I doubt he can shoot and run at the same time. If he was running after Brown he would have to holster his gun or run with his gun drawn, both of which would make him run more slowly than Brown who had a head start and probably in fear for his life.\n\nI believe the testimony that Wilson was shooting at Brown while he was running away, because it's the most reasonable explanation for why Brown turned around and put his hands up.\n\nSo from what I can piece together, Wilson was probably 30-40 yards away from Brown and Brown with his hands up, walking a few paces forward. If these are the facts then Wilson, a trained police officer, was clearly not in imminent danger.\n",
            "author": "courtenayplacedrinks",
            "created_utc": 1417239217.0,
            "replies": []
        },
        {
            "name": "t1_cminaza",
            "parent_id": "t3_2nck53",
            "body": "I was watching the news that day. I think it was CNN that showed a video of the attack and shooting. This is what I saw. Mike was attacking the officer inside the police cruiser. He was using his bulk to hold the officer in place. The other guy was holding the officers leg so the officer could not move. The other guy jumped up and ran away. Mike pushed himself off of the officer and stood up. He pulled up his pants, turned, and ran away.\n\nThe officer stood up. He was holding the left side of his face. He went to walk towards Mike but staggered to the left and then to the right. His right hand swayed back and forth with gun in hand. His arm swayed up as if to aim but did not stop. Not sure if he fired.\n\nMike stopped running, turned around, and ran towards the officer. The officer shot two times. Mike went down slowly and fell on his side. The officer staggered over to Mike and shot three times. End of video\n\nThe video was shown many times over the next hour and then went poof. Never to be seen again. That was between 1PM to 2PM Cen USA.\n",
            "author": "KELLIRet",
            "created_utc": 1417499324.0,
            "replies": []
        },
        {
            "name": "t1_cmiuzle",
            "parent_id": "t3_2nck53",
            "body": "Fact: Multiple witnesses attested that Brown was struggling with Wilson inside of Wilson's police car\n\nFact: Brown was shot in the thumb from 6 to 9 inches away and skin from Brown's wound was found inside of Wilson's police car. The Brown family hired medical examiner did not dispute these facts.\n\nFact: The areas where blood was found support the evidence that Brown was moving towards Wilson as Wilson was firing. \n\nFact: Witness 10 who saw the entire altercation from a safe distance testified that Brown charged Wilson not once but twice. \n\nFact: Previous surveillance video indicated that Brown was already in an aggressive state of mind when he physically grabbed the store owner after stealing cigars. ",
            "author": "itguy336",
            "created_utc": 1417530617.0,
            "replies": []
        }
    ]
}