{
    "name": "t3_2x4qkh",
    "title": "CMV:PSU football coach Joe Paterno deserves to have a more tainted legacy than baseball player Alex Rodriguez",
    "body": "At the end of his life, Joe Paterno was infamously and unavoidably tied to the horrific allegations made against his long time assistant coach Jerry Sandusky. In a very public trial, Sandusky was convicted of 52 counts of sexual abuse against children. Investigations into the behaviors and attacks made by Sandusky revealed that much of the sexual abuse occurred over a long period of time often at and inside the University's facilities. Graduate assistant coach Mike McQuery even reported to Paterno that he had witnessed Sandusky anally raping a boy. In time Paterno did forward the report to his higher ups however the situation was almost completely kicked under the rug. \nAs the unheralded leader of the Penn State campus it was Joe Paterno's joint responsibility to address the Sandusky issue and report it to the proper police authorities. For whatever reason he did not do this. There is no conceivable way that Paterno was completely in the dark in regards to Sandusky. He created a lot of good during his lifetime however in my mind he is guilty of a heinous crime that vastly overshadows any NET good he may have created.\n\nBaseball player Alex Rodríguez on the other hand is notoriously known for his use of Performance Enhancing Drugs. With the help of these drugs he became a powerhouse of an athlete capable of putting up incredible batting statistics. Rodríguez and other players' use of PEDs were undeniably responsible for tarnishing the legacy of the sport.\n\nI believe both men deserve maligned legacies. However Paterno's actions were the worser of two evils. He was considered an ethical leader to thousands of people. Rodríguez hurt a sport were as Paterno allowed for the actual physical and mental hurt of children and when given a chance to make amends he failed to do so. ",
    "author": "Lasagnafesta",
    "num_comments": 6,
    "created_utc": 1424885358.0,
    "url": "http://www.reddit.com/r/changemyview/comments/2x4qkh/cmvpsu_football_coach_joe_paterno_deserves_to/",
    "comments": [
        {
            "name": "t1_cowvjpu",
            "parent_id": "t3_2x4qkh",
            "body": "I disagree with your thesis that Alex Rodriguez has a more tainted reputation than Joe Paterno.  AROD is basically just a douche that people don't like who also used steroids like hundreds of other baseball players.  JoePas has a stain that overshadows everything he has done for 50+ years.  So I don't know where you are getting this argument because I don't think anyone actually believes that to be the case, unless you live in State Collage, PA.",
            "author": "who-boppin",
            "created_utc": 1424887058.0,
            "replies": []
        },
        {
            "name": "t1_coww0r9",
            "parent_id": "t3_2x4qkh",
            "body": "As someone who really couldn't care one whit for professional athletics, I immediately recognize the name of Alex Rodriguez but require context before recognizing the name of Joe Paterno. This is only one anecdotal data point, but there is some reason to believe that a star player in a professional league will be more famous than the coach of a college team.\n\nSo is Rodriguez's infamy greater because people think less of him, or is it simply that more people bother to care who he is? I'm betting on the latter.",
            "author": "TBFProgrammer",
            "created_utc": 1424887798.0,
            "replies": []
        },
        {
            "name": "t1_cowwrle",
            "parent_id": "t3_2x4qkh",
            "body": "Why do you want your opinion changed?\n\n",
            "author": "learhpa",
            "created_utc": 1424888965.0,
            "replies": []
        },
        {
            "name": "t1_cowyuji",
            "parent_id": "t3_2x4qkh",
            "body": "Your synopsis is close, but not entirely accurate - at least not according to the testimony and reports that exist in the matter.\n\nHere's what's not questonable - that the system failed multiple victims at multiple times. People that had a responsibility to report the incident (including Paterno) arguably did not do enough to 1) ensure that these incidents were properly investigated and 2) ensure that Sandusky did not continue to have unfettered access to victims.\n\nHowever, let's talk about the things that are questionable. People that arguably had the same (or a greater) requirement to report the incident in question were contacted by McQuery both before and after he met with Paterno. \n\nNow, let's talk about some things that weren't largely addressed in the media. Sandusky was not acting as a University official at the time of the incidents - he was acting as an official for the Second Mile, a charity organization that he himself founded. He used his access to the University to further the goals of this organization, but he was not a University employee - Paterno was not his boss and neither was Tim Curley. Despite this, both Paterno and Curley contacted superiors in regards to the incident (Paterno met with Curley the day after McQuery met with him; Curley met with Univeristy President Graham Spanier the day after that). \n\nCurley banned Sandusky from University facilities and also contacted the CEO of the Second Mile - the man who **was** Sandusky's boss, and comprised him of the incident. His response? He told Sandusky to wear shorts in the shower.\n\nNow, let's talk about the fact that *multiple people did not report the incident to law enforcement, despite a requirement to do so*. Within the entire chain, there are at least a dozen individuals who were apprised of a potentially criminal incident that should have contacted authorities, and yet they didn't. \n\nAt least three of Paterno's supervisors, Sandusky's boss at the Second Mile, and two board members from that organization had been informed about the incident.\n\nBut that's not all - a totally separate incident that went through an entirely separate chain of supervision (OPP - the division of the University responsible for maintenance) *had the same result.*\n\nDoesn't this point to a more systematic problem? One that perhaps goes beyond a single football coach? Isn't it possible that Paterno did what he thought was his responsibility, just like a dozen other people that were made aware of the incident?",
            "author": "iCUman",
            "created_utc": 1424892176.0,
            "replies": []
        },
        {
            "name": "t1_cowzfm3",
            "parent_id": "t3_2x4qkh",
            "body": "[Mike McQueary’s eyewitness testimony, which is the key element in determining what Paterno knew and when he knew it, has been all over the place each time he’s given it, and that the victim from this incident never came forward or testified at Sandusky’s trial. ...McQueary claims he was never sexually graphic with Paterno when he initially reported the incident, and he actually played in golf tournaments for Sandusky’s charity multiple times after the shower incident. The three administrators who handled the 2001 report actually informed the president of Sandusky’s charity about the incident, and that one of the administrators told attorney Wendell Courtney about McQueary’s report the day after it was received in a three-hour phone call ...Sandusky was investigated in 1998 by the campus police but the district attorney decided not to pursue charges due to lack of evidence. ...the 1998 incident was reported to both the Department of Public Welfare and Children and Youth Services ...the three Penn State administrators implicated in this case have yet to face trial and are being charged based on a handful of emails, neither of which states any degree of ill-intent or decision to cover up the incident.](http://onwardstate.com/2015/01/20/an-open-letter-to-keith-olbermann/)\n\nI could go on, but the evidence to date is overwhelmingly indicating that Joe Paterno had next to no knowledge of what was going on and the knowledge that he did have was passed on to the proper authorities. I'd highly encourage you to read the entire linked article and to do a little research about the Sandusky case which has been horribly misreported by main stream media. ",
            "author": "MistressFey",
            "created_utc": 1424893065.0,
            "replies": []
        },
        {
            "name": "t1_cox9nvu",
            "parent_id": "t3_2x4qkh",
            "body": "Your view seems to depend on a lot of factual inaccuracies. \n\nAccording to court testimony, Paterno was first made aware of the situation in 2002 which was several years after Sandusky had retired from the university. You can say that \"he had to know\", but that is not substantiated in any way. While you are right that  there were incidents of abuse that occurred at campus facilities, none occurred after Paterno was told about the situation. \n\nYou say \"in time\" Paterno forwarded the information, implying that he waited. In fact he was told of the incident on a Saturday, and reported it on Sunday.\n\nYou say \"Graduate assistant coach Mike McQuery even reported to Paterno that he had witnessed Sandusky anally raping a boy.\" That is not true. McQuery was intentionally vague when he described the incident. From the preliminary hearing transcript:\n\n     9      Q    Would you have ever used the term sodomy\n    10   with Coach Paterno?\n    11      A    No, never.\n    12      Q    Would you have ever used the term anal \n    14   intercourse with Coach Paterno?\n    14      A    Never.\n\nYou make a general accusation that he did not report the incident to the proper authorities, but he reported it immediately to both his superior and the head of the campus police. \n\nI would suggest that you actually read the [Freeh report](http://progress.psu.edu/assets/content/REPORT_FINAL_071212.pdf). Skip the \"executive summary\" because that has been completely discredited. Instead, read the contents of the actual report and see if you still hold your view after you have seen the facts.",
            "author": "Snedeker",
            "created_utc": 1424909048.0,
            "replies": []
        }
    ]
}