{
    "name": "t3_28o7uj",
    "title": "CMV: Prepubescent children cannot have crushes. People who claim to have had crushes when they were that young are lying to themselves.",
    "body": "In a recent AskReddit thread, one of my pet peeves came up - someone \"admitting\" that they had a crush in third grade, or some comparable age.\n\nI told myself that I had \"crushes\" on several girls throughout elementary school, I acted really strangely around them, I told people that I had these crushes, the whole shebang. But then puberty hit, and as I turned out to be gay, all of these crushes I thought I had on girls ended up not being genuine. I was wrong about what a crush was then, because I was 10.\n\nSo it truly does irk me that people say that they \"had their first crush in third grade\" or when Google makes an advertisement for their new tablet involving an 11 year old wanting to \"ask out a girl\". They don't know what a crush is. They don't even know if they're interested in people of that gender, not at that age.\n\nI would love not to feel this way, as it would save me a lot of unnecessary anger toward people who don't mean to offend me. If you feel that you had a genuine crush before puberty, I would love to hear your point of view. Thanks!\n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "zombiebeethoven",
    "num_comments": 18,
    "created_utc": 1403297633.0,
    "url": "http://www.reddit.com/r/changemyview/comments/28o7uj/cmv_prepubescent_children_cannot_have_crushes/",
    "comments": [
        {
            "name": "t1_cictrrb",
            "parent_id": "t3_28o7uj",
            "body": "I think you're making an unnecessary comparison between pre and post puberty attractions. Children are obviously not sexually developed, so their crushes don't have much to do with sexual attraction. They have crushes in that they have someone of the opposite sex that makes them smile and they like to talk to or think is pretty, and they play-act some romantic behaviors with like holding hands. The connotation of the word crush totally changes after puberty, so I don't think saying kids can't have crushes really makes a lot of sense. ",
            "author": "setsumaeu",
            "created_utc": 1403299770.0,
            "replies": []
        },
        {
            "name": "t1_cictv9x",
            "parent_id": "t3_28o7uj",
            "body": "Our idea of love changes as we age and our romantic desires and needs change. Puppy love is very different from adult, sexual, romantic love, but that doesn't make it *not love,* it's just different. My grandparents told me that the love they had for each other at age 80+, after more than 50 years of marriage, wasn't anything like the love they had for each other when they were younger either. That doesn't mean that they weren't in love when they got married, nor does it mean that they weren't in love at age 80.\n\nI definitely feel that I had a crush before puberty. I'm a boy, and grew up with a girl as my best friend. I kindof always assumed we'd get married (I guess I thought that was how it worked for everyone). She and I grew apart as most childhood friends do, but I definitely \"liked\" her in that awkward little-kid way.",
            "author": "potato1",
            "created_utc": 1403299984.0,
            "replies": []
        },
        {
            "name": "t1_cictvps",
            "parent_id": "t3_28o7uj",
            "body": "&gt; genuine crush \n\nIsn't the whole point of calling something a \"crush\" instead of love that a crush isn't genuine love, but is a much more generic term that includes multiple different feelings?",
            "author": "GnosticGnome",
            "created_utc": 1403300011.0,
            "replies": []
        },
        {
            "name": "t1_cicu5de",
            "parent_id": "t3_28o7uj",
            "body": "An eight year old boy says \"When I grow up, I want to be an astronaut.\"\n\nOf course, from his perspective, he genuinely means it. He's seen an astronaut in a movie, maybe, and thinks it looks cool. He has no actual understanding of what an astronaut does, or how rigid and dangerous is. He has no idea that when he turns 12 he's going to discover how much he  actually hates the boring work of astronomy and physics, and that he's not really into working out and prefers writing poetry. By the time he's an adult, being an astronaut is the LAST thing he wants to be.\n\nBut that doesn't mean it's not 'genuine' when he said it as a kid. Kids are nothing if not genuine. What it means is that he said it in the way kids say all things: uninformed, mostly emotional, imitating adult behaviors and media depictions with little real understanding. From his perspective, he really does want to be an astronaut, and from an adult perspective, we know that's cute precisely because it's such a child's understanding of the world; that's why we say \"Awww\".\n\nChildhood crushes are the same way. Of course they're absolutely nothing like adult crushes. Of course kids have none of the vital information (like, say, their sexual preferences) that will shape their adult desires. A childhood crush is much more like \"play\", but to kids, play has all the emotional weight of real action. It's incredibly different from an adult crush, but that doesn't make it false or worse, lying to oneself.",
            "author": "genericname23",
            "created_utc": 1403300611.0,
            "replies": []
        },
        {
            "name": "t1_cicu6hc",
            "parent_id": "t3_28o7uj",
            "body": "ooooooh interesting question. I felt like I had a lot of crushes when I was a kid. I did the same things--the acting strangely, the telling good friends I had a crush on x, etc etc etc. I also remember obsessing about the crush object and imagining out all sorts of weird narrative scenarios where I have to rescue them or we both realize we're in love through some improbable situation. Strangely at the time it felt a lot like a medieval courtly love, like abelard and heloise--a feeling of intense devotion and obsession, the sense that material signs of love like kissing or dates would \"ruin\" it. So in that sense I agree with you, I think. I even worked up the nerve to tell one girl I liked her in 7th grade, after spending months building up to it, and when I finally did she said \"yeah, I know\" and my mind went blank and I had literally NO IDEA what to do next. Nothing happened and we continued being normal friends. \n\nBut even now (I'm 25 now) and I can get sort of obsessive about certain girls in the same way--just idealizing them and thinking about how great they are all the time and how they complete me. It's a mode of attraction which makes for a lot of unrequited love and, also, makes me act like an ass. This happens ESPECIALLY if I wait a really long time to make a move on someone I like. The way I see it, a crush is like an investment of hope. You dump some imagination into what it would like to be with that person, and then that image feeds you a certain shining. Even though it can slow action, because the reality of what that idealized person actually IS breaks through the illusion which sustains you for so long. ANYWAYS this is all to say while you're right that children don't have any sexual component to their crushes, the fantasy and imagination to evoke romantic feelings can still work. Kids develop those kinds of feelings early on through parental behavior, through culture, etc etc etc. What do you think?",
            "author": "dogtim",
            "created_utc": 1403300681.0,
            "replies": []
        },
        {
            "name": "t1_cicuxmk",
            "parent_id": "t3_28o7uj",
            "body": "If your definition of ''crush'' includes sexual desire, then yes, by definition, a pre-sexual child cannot have sexual desire, therefore cannot have your definition of a ''crush'' ... but many other people don't include sexual desire in their own definition of ''crush'' - it's more of an inexplicable and intensely emotional fascination.\n\nAccording to the Oxford English Dictionary, ''crush'' means '' A brief but intense infatuation for someone, especially someone unattainable''\n\nWhere ''infatuation'' is defined as ''An intense but short-lived passion or admiration for someone or something''\n\nSo there's no mention of sexual desire in the dictionary.",
            "author": "moonflower",
            "created_utc": 1403302426.0,
            "replies": []
        },
        {
            "name": "t1_cicvbnk",
            "parent_id": "t3_28o7uj",
            "body": "&gt; They don't know what a crush is.\n\nSo then if it isn't a crush, what do we call it? The child clearly feels differently and more strongly about the so-called \"crush\", but if you don't want to use that term, then what is the correct term?\n\n&gt; They don't even know if they're interested in people of that gender, not at that age.\n\nDo you really believe that? Many gay people state that they knew they were gay at a very young age (I only point out gay people because straight people generally don't say they \"realized\" they were straight.) Are you saying individual who said they knew they were gay prior to puberty is lying?\n\nAlso, why is it not possible for you have had a crush on a girl when you were 10? Just because you are gay does not mean that you can never be attracted to a woman ever. Is it not possible you were genuinely attracted to that person? How would you qualify your feelings towards her if not as a crush? I don't think being gay negates feelings you had when you were younger.",
            "author": "fanningmace",
            "created_utc": 1403303351.0,
            "replies": []
        },
        {
            "name": "t1_cicwglh",
            "parent_id": "t3_28o7uj",
            "body": "How could we even change your mind?  The only evidence we could provide would be self reported, which you've already indicated would contain only lies.\n\nEDIT: also\n\n&gt;They don't know what a crush is.\n\nHave you ever heard someone says \"You don't know what love is\"?  Neither one is a relevant argument because \"crush\" and \"love\" mean different things to people who are 10, 16, 25 and 45 years old.",
            "author": "ghotier",
            "created_utc": 1403306094.0,
            "replies": []
        },
        {
            "name": "t1_cicwkus",
            "parent_id": "t3_28o7uj",
            "body": "&gt;They don't even know if they're interested in people of that gender, not at that age.\n\nas another gay man who had crushes on girls in elementary school i think you aren't understanding what a crush usually means.  it doesn't mean sexual attraction, it doesn't mean love, it doesn't mean relationships.  \n\n\"a brief but intense infatuation for someone\"\n\ndoesn't mention love or sex in there.  its just \"omg i want that person to know me, i want to know everything about them, i want to follow them everywhere\" not \"i wanna have babies and a future with them\"  that can be part of a crush but it isn't necessary.  ",
            "author": "complete_misanthrope",
            "created_utc": 1403306387.0,
            "replies": []
        },
        {
            "name": "t1_cicwthx",
            "parent_id": "t3_28o7uj",
            "body": "You can't judge everyone else's experiences based solely off of your own. When you say that somebody **can't** experience a crush because **you** didn't, it would be as mistaken as me saying that men **can't** be attracted to other men because **I'm** not. ",
            "author": "MageZero",
            "created_utc": 1403306982.0,
            "replies": []
        },
        {
            "name": "t1_cicybo5",
            "parent_id": "t3_28o7uj",
            "body": "&gt;If you feel that you had a genuine crush before puberty, I would love to hear your point of view.\n\nI started loving early and strongly.\n\nIn preschool I asked a girl to marry me. She had long golden hair, and it was always done in fancy braids. I thought she was really pretty. She said yes, and for a whole week we shared a coat rack and always played together at recess. Then one day she came and said that we were divorced now and that she was marrying another boy instead. I literally went home and cried for hours. I was devastated. I felt broken and lonely. I was 5 years old.\n\nYour argument is based on having realized you were gay when you hit puberty. But sexual desire does not make a crush. In preschool I was too young to have sexual feelings about that girl, but that didn't make my feelings any less legitimate. I felt drawn to her, to her personality, and I wanted to be near her, and when she rejected me it hurt me deeply. (Interesting side note story, that girl turned out to be the daughter of one of my dad's old college friends. I met her again when I was 16 and she was my first kiss)\n\nI had a crush on at least one girl in every single year of school after that. In kindergarten it was katie. She had long brown hair and a funny laugh. We rode the bus together. She was super nice to me on the bus but mean to me at school which made me sad.\n\nIn first and second grade it was Selina. She had such pretty coffee colored skin and curly hair. She was Jehovah's witness, which made me really sad because when I brought cookies to school for my birthday she wouldn't take any. I always chose her when we played heads up seven up, and whenever she chose me during duck duck goose my heart skipped a beat.\n\nIn 3rd grade it was Hillary. She was beautiful but wouldn't give me the time of day. In 4th and 5th grade it was Kate Fairmen. She ended up being my first girlfriend and that's about when I hit puberty, so I guess my stories should stop there.\n\nI loved everyone of those girls as much as I could for the given age I was. I thought about them every day. I wanted to play with them at recess. I fell asleep wishing we could watch a movie under the same blanket. I was just a romantic little kid. I don't know why. But that's my story.",
            "author": "Mongoosen42",
            "created_utc": 1403310881.0,
            "replies": [
                {
                    "name": "t1_cid0cpv",
                    "parent_id": "t1_cicybo5",
                    "body": "I was pretty much the same way. I'm still friends with my kindergarten and first grade \"girlfriends\" They both turned out to be beautiful. One of them is a little high maintenance. In hindsight should have stuck with the second one...\n\n",
                    "author": "Bob_Zyerunkel",
                    "created_utc": 1403316429.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cicyc4t",
            "parent_id": "t3_28o7uj",
            "body": "Sexuality is fluid, and there are multiple types of attractions.  Furthermore, things in the present don't negate what happened in the past.\n\nTo explain the first part:  When I was in 8th grade (and I hit puberty at the ripe old age of 9, so this qualifies as post-puberty attraction), I was only attracted to other girls.  I wasn't sexually or romantically interested in anyone who wasn't a girl, and I would make out with one of my (girl) friends all the time.  In fact, kissing that friend was pretty much the first and only time I ever felt a tingle from a kiss.\n\nWhen I got to high school, I found out that I was also interested in boys.  Does that mean me only being interested in girls when I was in 8th grade was fake?  No, it just means that in 9th grade, I found out I also liked boys.  Does that mean that maybe being lesbian was just a phase?  Maybe, but is there anything wrong with something just being a \"phase\"?  I really liked Barbies when I was little but now I don't care about them at all; does that mean I didn't really like the Barbies when I was little and I was just faking my interest?  No.  So some peoples' sexualities change.  I still like people of all genders, but sometimes I'm more attracted to one or another.  Some people's sexualities never change.  That's legit too.\n\nSecond part:  There are many kinds of attraction, including sexual, romantic, and aesthetic attraction, but there's more than those.  Have you ever looked at someone and thought, \"wow, that person's really good-looking\"?  But, at the same time, you didn't necessarily feel like having sex with them or starting a romantic relationship with them.  That would be aesthetic attraction.  Similarly, maybe you were romantically attracted to girls at some point, but you didn't feel sexual attraction toward them.  That can happen.  Maybe you'd still be able to love a girl romantically, but not be interested in having sex with her, which is legitimate.  Maybe now you're only romantically and sexually interested in men, which happens too.  And I personally don't believe that labels such as \"gay\" are rigid; if someone identifies as gay and makes an exception for someone, they don't magically stop being gay.  I really, really hate eating tomatoes, but I'm okay with one slice of tomato on a burger, and only then can I eat a tomato.  Doesn't mean I hate tomatoes any less.  Just means there's one very specific instance in which I might eat a tomato willingly.\n\nAll that said, however you feel now, it doesn't make things in the past any less real.  Just as you can fall in love, you can fall out of love.  Just because you're no longer in love with someone doesn't mean that the times you did love them didn't mean anything—they meant something to you *at that time*, so they still have *some* sort of meaning.  The duration of it doesn't make it any less true.\n\ntl;dr people can change; attraction is fluid; things in the past aren't less real because they're not there in the present.  I hope this wasn't too rambly, and I gotta go now, but I'm open to challenges and stuff.",
            "author": "xenoamorist",
            "created_utc": 1403310915.0,
            "replies": []
        },
        {
            "name": "t1_cid082o",
            "parent_id": "t3_28o7uj",
            "body": "i strait up had oneitis with a girl when i was 6. half way through 1st grade they put me back into kindergarten because i wasn't learning. i would just sit there and stare and drool over this girl. the kindergarten class didn't have her in it, and i could pay attention to the teacher. in 6 months i went from being behind, to being at a 4rth grade reading level and a 5th grade math level, it was the distraction of that girl in my class that kept me from learning. i could talk to her best friend and all the other girls easy enough, but was speechless around her. i would go on walks and look for pretty rocks and flowers to give her (i lived in a rural area at the time). \n\nwhen i was 14 she died of brain cancer. i might not have loved her in a sexual way, but i loved her, and i will never forget her. your statements are arbitrarily dismissing the very strong emotions that children can feel. do they change over time? yes, of course they do, and they never stop changing over time either. your views of love now are not the same as they were when you were 16 either (unless you are still a teenager, or perhaps in your early 20's). just because your perspective in the world has changed doesn't invalidate the ways you used to feel. ",
            "author": "greycloud24",
            "created_utc": 1403316079.0,
            "replies": []
        },
        {
            "name": "t1_cid0sg1",
            "parent_id": "t3_28o7uj",
            "body": "I know for a fact that I had at least two crushes when I was prepubescent. I experienced these crushes as an intense longing for close friendship, but they otherwise looked and felt exactly like the crushes I developed on straight boys when I was a teenager.",
            "author": "learhpa",
            "created_utc": 1403317639.0,
            "replies": []
        },
        {
            "name": "t1_cid21my",
            "parent_id": "t3_28o7uj",
            "body": "I'm also gay and distinctly remember having crushes on guys in elementary school. Granted, I didn't know what they were at the time. I didn't even knew homosexuality existed. But the crushes were definitely there. In first grade I made friends with a boy on my bus because I had a crush on his fourth grade brother. I remember feeling distinctly envious of how my friend got to live with his brother. Keep in mind I'd never even talked to the brother. In second grade I noticed this third grader who was the child of a teacher at the school. We were in the same PE class and I'd always try to team up with him in four square, volleyball, etc as an excuse to spend time with him because I thought he was oh so cute. In third grade I had my first sexually explicit dream; in the dream a boy in my class approached me in our school bathroom buck naked and told me he knew I'd been wanting to see him without clothes for a long time (not untrue). He then proceeded to make out with me. In fourth grade I started crushing on a third grader who lived in my neighborhood. Incidentally this kid grew up to be exactly my current type...blond, muscular, and *ahem* I'd fantasize about him kissing some of the girls in our school without clothes on. In fifth grade I remember admiring my best friend's body (he was a competitive swimmer) and trying to arrange to see him shirtless,e.g. by going swimming with him. In sixth grade I hit puberty, started having explicit fantasies about penises and sex and stuff, and realized I was gay, which ten years later I still am. Keep in mind throughout this whole time I had never felt attraction to a girl.\n\nSo there you have it. Sexuality can manifest itself in young children and I'm living proof.",
            "author": "Dismantlement",
            "created_utc": 1403320980.0,
            "replies": []
        },
        {
            "name": "t1_cid5rsk",
            "parent_id": "t3_28o7uj",
            "body": "You're basing your judgement of this out of your own personal experience and not considering the experiences of others?",
            "author": "Bekenel",
            "created_utc": 1403333359.0,
            "replies": []
        },
        {
            "name": "t1_cid8nrq",
            "parent_id": "t3_28o7uj",
            "body": "You seem to suggest that the only form of attraction possible between humans is that of a sexual nature, and that no other forms of attraction exist. \n\nThe problem I have with this is that while I have sexual attraction towards some people, I most certainly have non-sexual attractions towards other people all the time. Could you perhaps clarify your views?",
            "author": "stratys3",
            "created_utc": 1403350520.0,
            "replies": []
        }
    ]
}