{
    "name": "t3_25p9sj",
    "title": "CMV: True Detective betrayed it's viewers with the rushed, incomplete ending, and unless the 2nd season ties up many loose ends, Nick Pizzolatto (the writer) should be ashamed of himself. (x-posted to /r/TrueDetective",
    "body": "Let me start by saying i LOVED true detective. The acting and directing were awesome, and the writing had me totally obsessed until near the end. However, the ending killed me.\n\nWhat intrigued me so much about the first 3/4s of the season was that first of all the Yellow King cult clearly had so many members and they were obviously powerful, and second Rust Cohl had this obsessive need to bring them down.\n\nWhile the Errol \"man with scars\" Childress was an important part of this puzzle he wasn't anything close to being the biggest fish in this case. In fact by all appearances he was just an insane drug addict who was working at the behest of much darker forces. Not only was the cult clearly active throughout the '90s and early 21st century, but many high ranking state officials were likely involved.\n\nHowever, after Cohl and Hart kill Childress Cohl seems truly at peace, even though he hasn't gotten the full truth or come anywhere near getting justice for the victims.\n\nI believe this is completely out of character and unsatisfying. If the writer Nick Pizzolatto wanted to make the story about cops chasing around a bunch of devil worshiping meth heads, that would have been fine and I probably still would have enjoyed the show. However implying a broader conspiracy and then not developing it was unfair.\n\nThe only way Pizzolatto can redeem himself is if the next season takes place in the same story-universe. I really hope that the next season will still be following the yellow king cult but in a different time and place, and with different main characters. \n\nObviously this will be challenging though and I doubt he will do it.\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "khinzeer",
    "num_comments": 14,
    "created_utc": 1400235227.0,
    "url": "http://www.reddit.com/r/changemyview/comments/25p9sj/cmv_true_detective_betrayed_its_viewers_with_the/",
    "comments": [
        {
            "name": "t1_chjfhp9",
            "parent_id": "t3_25p9sj",
            "body": "Cohl was at peace because when he was near death he felt the presence of his daughter. That was the source of his torment. He did express frustration with not getting everyone as well. Ashamed is way the wrong word. ",
            "author": "eye_patch_willy",
            "created_utc": 1400240104.0,
            "replies": []
        },
        {
            "name": "t1_chjfpbx",
            "parent_id": "t3_25p9sj",
            "body": "http://thelastpsychiatrist.com/2014/03/ten_extra_seconds_would_have_s.html",
            "author": "Eipa",
            "created_utc": 1400241052.0,
            "replies": []
        },
        {
            "name": "t1_chjgd0q",
            "parent_id": "t3_25p9sj",
            "body": "You feel a bit betrayed because you didn't get everything you wanted. The story arc was more about the two main characters. Those characters had their small triumph, their fall and then their redemption. The cult and and the rest is just window dressing to give flavor. The two characters have had their story told. Edit cause you know words are important. ",
            "author": "Raintee97",
            "created_utc": 1400243652.0,
            "replies": []
        },
        {
            "name": "t1_chjkw0e",
            "parent_id": "t3_25p9sj",
            "body": "I felt dissatisfied briefly because I was viewing the last episode like a single episode of Law &amp; Order: SVU. Where justice is usually delivered and we typically get answers to all of the criminally based questions. For example, story arc between Benson and Stabler is a *long-arc* where we get brief glimpses into their chemistry over the series' many seasons. \n\nHowever this mini-season is the inverse. It was more about the partners and their revelations. Not about the tangential crimes. \n\nSo I figured early on we would never know everything regarding the crimes. The show wasn't about the crimes. \n\nHowever, I will admit, I did want more answers. But I decided the two main characters were more important. \n\nSo in that sense we all very viscerally felt how Russ may have felt at the end of the season, but ultimately Russ decided experiencing life was more important. The loss of his daughter and never dealing with that grief was the source fueling his unrelenting need to solve these crimes. He resolved that grief at the end. \n\nThe show could have had a different ending. Where we got all of the answers to the crimes, but Russ ended up a lost soul... forever a slave to his grief. \n\nEither way we wouldn't have all of the answers. ",
            "author": "GridReXX",
            "created_utc": 1400255422.0,
            "replies": [
                {
                    "name": "t1_chjlkq1",
                    "parent_id": "t1_chjkw0e",
                    "body": "The ending would have been fine by me if rust hadn't had the catharsis.  That seemed unbelievable. I have no real problem with the killers getting away, I just think that would have broke rust",
                    "author": "khinzeer",
                    "created_utc": 1400256912.0,
                    "replies": [
                        {
                            "name": "t1_chjoacg",
                            "parent_id": "t1_chjlkq1",
                            "body": "I thought the ending would have been fine. \n\n I just found it cheesy. I think catharsis can be achieved more subtly than how the show's writers and directors chose to handle it. \n\nFor me the show avoided being \"cheesy\" all season and then in the last 20 minutes, it fangirled on itself. \n\nBut your CMV is that your betrayal stems from the \"incompleteness\" or the lack of \"tying up loose ends.\"\n\nI would argue that I felt betrayed by the tone.  ",
                            "author": "GridReXX",
                            "created_utc": 1400262657.0,
                            "replies": [
                                {
                                    "name": "t1_chjp9ke",
                                    "parent_id": "t1_chjoacg",
                                    "body": "JMaybe you put it better. I don't think Cohl deserved the catharsis he got. ",
                                    "author": "khinzeer",
                                    "created_utc": 1400264696.0,
                                    "replies": [
                                        {
                                            "name": "t1_chjq0kg",
                                            "parent_id": "t1_chjp9ke",
                                            "body": "I agree with that. That part felt rushed. But that wasn't your CMV. ",
                                            "author": "GridReXX",
                                            "created_utc": 1400266278.0,
                                            "replies": []
                                        },
                                        {
                                            "name": "t1_chjq0xc",
                                            "parent_id": "t1_chjp9ke",
                                            "body": "I agree. That was rushed. But that wasn't your CMV. ",
                                            "author": "GridReXX",
                                            "created_utc": 1400266299.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_chjujd0",
            "parent_id": "t3_25p9sj",
            "body": "&gt;While the Errol \"man with scars\" Childress was an important part of this puzzle he wasn't anything close to being the biggest fish in this case\n\nI actually do think he was a big fish. He was the Keeper of Carcosa, and seemed to me to be a central figure in the religion, just not the conspiracy.\n\n&gt;However, after Cohl and Hart kill Childress Cohl seems truly at peace, even though he hasn't gotten the full truth or come anywhere near getting justice for the victims.\n\nI think Cohl's resolution was, in my view, a mixed bag. He felt that wave of relief, but it seemed to me that he despaired at losing it when he came back to the world of the living. However, it's proof of a reward of somekind for his hard work and sufffering, and that motivates him to keep searching for the Cult, which is on edge, as indicated by the lies reported in the news broadcast at the very end. I think the reason they left the Hospital as they did was proof they will continue the hunt.",
            "author": "SmartyCoulottes",
            "created_utc": 1400276236.0,
            "replies": [
                {
                    "name": "t1_chjv835",
                    "parent_id": "t1_chjujd0",
                    "body": "You make some good points.\n\nI wanted to see if the characters succeeded or failed. I guess I'm just butthurt that there isn't a second season with this cast.",
                    "author": "khinzeer",
                    "created_utc": 1400277871.0,
                    "replies": [
                        {
                            "name": "t1_chjvw8h",
                            "parent_id": "t1_chjv835",
                            "body": "Well, they did succeed, the cult is on some level exposed. It's unlikely they'll be abducting anyone very soon, and they are kind of on the run. Beyond that, Hart and Cohl did seem to be getting over their personal demons. \n\nYou have to bare in mind, this work was a take on the weird fiction genre, hence the allusions to the Yellow King and Carcosa. Weird Fiction rarely gives any sort of genuine resolution, instead choosing to leave audiences with as many questions as possible. It's a purposeful decision to leave the audience confused and wanting more.",
                            "author": "SmartyCoulottes",
                            "created_utc": 1400279522.0,
                            "replies": [
                                {
                                    "name": "t1_chklu5y",
                                    "parent_id": "t1_chjvw8h",
                                    "body": "&gt;Weird Fiction rarely gives any sort of genuine resolution, instead choosing to leave audiences with as many questions as possible. It's a purposeful decision to leave the audience confused and wanting more.\n\nIf it was going in that direction Cohl should have been left broken and insane. I would have been fine with an unhappy ending, but the ending they gave us was BS in my opinion.",
                                    "author": "khinzeer",
                                    "created_utc": 1400367142.0,
                                    "replies": [
                                        {
                                            "name": "t1_chlsagj",
                                            "parent_id": "t1_chklu5y",
                                            "body": "It's a subversion. Throughout the series, he was already mad. He had hallucinations from the very beginning. Cosmic truth didn't drive him insane, it provided him comfort.",
                                            "author": "SmartyCoulottes",
                                            "created_utc": 1400511583.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}