{
    "name": "t3_29e02r",
    "title": "CMV: Sam Winchester is a terrible brother and Dean would be better off without him.",
    "body": "SPOILERS ALL:\n\nThrough the many seasons of Supernatural, Sam has shown himself to be a self centered, whiny, crybaby. Dean Winchester sacrificed his personal happiness a million times to save Sam's whiny ass. He sacrificed his own education and held down the family business while Sam ran off to party at college. Dean made deals with demons to save Sam after he was dumb enough to get himself killed. In return, Sam watches Dean get eaten by a Hellhound, die, go to Hell, and doesn't lift a finger to save him. \n\nAdd. Rinse. Repeat, through several more seasons (far too many examples of Selfish Sam to list) and we have (yet again) Dean \"die\" heroically killing the Boss monster (while Sam is off playing with coffee creamer somewhere) and ending up trapped in Purgatory for over a year. And what does Sam do? He get's himself a dog and a girlfriend and basically says, \"Dean Who?\" Then when Dean gets himself out by teaming up with a friendly vampire, all big meat headed Sam can think about is trying to kill the vamp who helped rescue Dean.\n\nAnd most heinous of all, the very first time Dean lets Sam drive Baby, Sam crushes her under a semi.\n\nDean should ditch Sam and his pretty hair on some roadside and go hunting with Castiel from now on. \n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "DXGypsy",
    "num_comments": 45,
    "created_utc": 1404045769.0,
    "url": "http://www.reddit.com/r/changemyview/comments/29e02r/cmv_sam_winchester_is_a_terrible_brother_and_dean/",
    "comments": [
        {
            "name": "t1_cik0nb3",
            "parent_id": "t3_29e02r",
            "body": "Bottom line Sam is Dean's younger brother and the ONLY family that Dean has left. Dean will do anything to hold on to that bond. Dean does argue with Sam about the issues you have mentioned, but ultimately forgives Sam because of the family bond. He will always \"Take care of 'Sammy'\" whether he thinks Sam wants him to or not or whether or not he is angry at Sam. It's just what older brothers are supposed to do.",
            "author": "Vixen1373",
            "created_utc": 1404049619.0,
            "replies": [
                {
                    "name": "t1_cik0sky",
                    "parent_id": "t1_cik0nb3",
                    "body": "Of course Dean forgives him. That's because Dean is a good brother. Sam on the other hand...",
                    "author": "DXGypsy",
                    "created_utc": 1404050190.0,
                    "replies": [
                        {
                            "name": "t1_cik10zh",
                            "parent_id": "t1_cik0sky",
                            "body": "Sam tries to be a good brother. There have been many times when Sam has wanted to do things to help on the hunts/missions and Dean told him no. One example was in Season 2 when Sam told Dean to kill him if he went \"dark side', because he didn't want to become something that would hurt Dean or anyone else. Another time was in Season 8, Sam wanted to do the Demon trials and Dean told him no. It wasn't until Sam successfully killed a Hellhound and Dean wanting to hunt then kill another one, that Sam was able to convince Dean to let him finish the trials. Little brothers get into trouble and big brothers get them out all the time. ",
                            "author": "Vixen1373",
                            "created_utc": 1404051072.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cik5jrt",
            "parent_id": "t3_29e02r",
            "body": "\"There ain't no me if there ain't no you.\"  It's actually more true for Dean than for Sam--Sam's always been the independent one, the recalcitrant one, the one willing to let go of the fight and simply *be normal.*  Dean can't--fundamentally, if Dean wasn't fighting monsters, he'd still be fighting monsters, just in his own head and down the neck of a liquor bottle.  Dean's *raison d'etre* is to protect Sammy; like we saw in the \"alternate timeline\" of Dean's life where the demon didn't infect Sam, Dean never grows up, never has a good relationship with anybody, and is somewhat of a fuckup at normal life.  Meanwhile, Sam is rich, successful, a bit of a twat, but otherwise totally normal.\n\nDean is the one who needs Sammy, not the other way around.  That's the reason why he's so willing to do anything and everything to keep him alive.",
            "author": "mean0dean0",
            "created_utc": 1404063710.0,
            "replies": [
                {
                    "name": "t1_cik8l8m",
                    "parent_id": "t1_cik5jrt",
                    "body": "Do you have an episode number for that? I don't remember it and now I want to watch it.",
                    "author": "fayryover",
                    "created_utc": 1404070739.0,
                    "replies": [
                        {
                            "name": "t1_cikfpnv",
                            "parent_id": "t1_cik8l8m",
                            "body": "\"What Is and What Should Never Be\" Season 2 Episode 20",
                            "author": "howarthee",
                            "created_utc": 1404088316.0,
                            "replies": [
                                {
                                    "name": "t1_cikl7o2",
                                    "parent_id": "t1_cikfpnv",
                                    "body": "Thank you! :)",
                                    "author": "fayryover",
                                    "created_utc": 1404102121.0,
                                    "replies": []
                                },
                                {
                                    "name": "t1_ciko33h",
                                    "parent_id": "t1_cikfpnv",
                                    "body": "Wow, watching old episodes is definitely a new experience. Sam is hot again (in my opinion he isn't in later episodes) and Deans voice is higher and less jaded. I never really noticed it was different until now. Thanks.",
                                    "author": "fayryover",
                                    "created_utc": 1404111914.0,
                                    "replies": [
                                        {
                                            "name": "t1_cil08vt",
                                            "parent_id": "t1_ciko33h",
                                            "body": "See, I think Sam's hottest around season 6, but to each their own, eh? And you can really see how different they are these days, yeah. All that youthful hope seems to have been sucked right out of Dean after all this time.",
                                            "author": "howarthee",
                                            "created_utc": 1404152244.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cil1kr5",
                                                    "parent_id": "t1_cil08vt",
                                                    "body": "Yeah definitely different. And yeah I just don't see his looks now as hot but then I've always preferred Dean. It was so weird to watch that those differences. And Knowing what I know now about their mom I kinda wanted to see her find out that dean was hunting in this episode. Sorry if I spoiled anything I was trying to word that without any particular spoil.",
                                                    "author": "fayryover",
                                                    "created_utc": 1404154881.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cil3wpr",
                                                            "parent_id": "t1_cil1kr5",
                                                            "body": "It's completely understandable.  \nI just started rewatching the series, and am kinda having trouble jumping from season 9 Sam and Dean to season 1. It's really freaky.   \nI feel like their mother would have tried to help Dean in any way possible (once he convinced her about it, of course) and she might have been more helpful than Sam was at the moment.",
                                                            "author": "howarthee",
                                                            "created_utc": 1404159462.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "name": "t1_cil3576",
                                            "parent_id": "t1_ciko33h",
                                            "body": "The voice and the jaded attitude are a purposeful affectation on Jenson's part.  He reasoned in an interview given at one of the many cons he attended that since Dean basically spent an entire lifetime in Hell, he would not only be a jaded old man, but also have a raspy voice to match.",
                                            "author": "mean0dean0",
                                            "created_utc": 1404157950.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cil4zqn",
                                                    "parent_id": "t1_cil3576",
                                                    "body": "oh yeah I know it's on purpose as I have heard people mention it. I just didn't really notice the difference and I hadn't really known how much the difference really was.",
                                                    "author": "fayryover",
                                                    "created_utc": 1404161608.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cika9ql",
                    "parent_id": "t1_cik5jrt",
                    "body": "Yea but what about Dean Smith and Sam Wesson. In that Timeline,  Dean was the successful one. ",
                    "author": "mlp-alex",
                    "created_utc": 1404074985.0,
                    "replies": [
                        {
                            "name": "t1_cikd98w",
                            "parent_id": "t1_cika9ql",
                            "body": "Wasn't that just Zacharias's little fantasy though? I got the impression that it was a fundamentally different timeline, but just what the archangel decided was going to happen to make the \"best\" impression on Dean. ",
                            "author": "[deleted]",
                            "created_utc": 1404082124.0,
                            "replies": [
                                {
                                    "name": "t1_cikn8xi",
                                    "parent_id": "t1_cikd98w",
                                    "body": "Yea but that was an AU that showed that hunting was in Sam and dean's blood. ",
                                    "author": "mlp-alex",
                                    "created_utc": 1404108574.0,
                                    "replies": [
                                        {
                                            "name": "t1_cikojhb",
                                            "parent_id": "t1_cikn8xi",
                                            "body": "I thought it was the real universe, an actual real life hunt, just where Sam and Dean didn't have any of their old memories. To me, an AU shows causal relationships. I.E A happened differently so B occurred. But Zackerias's image just substituted a couple of things and left it mostly how it was (as seen by sam's dreams) which is why I always found it a bit disingenuous.\n",
                                            "author": "[deleted]",
                                            "created_utc": 1404114014.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cikoooq",
                                                    "parent_id": "t1_cikojhb",
                                                    "body": "You're correct, but remember when zachariah touched dean on his forehead and everything went gloomy, that makes me think it was an AU. ",
                                                    "author": "mlp-alex",
                                                    "created_utc": 1404114718.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_cikorcp",
                                                            "parent_id": "t1_cikoooq",
                                                            "body": "[deleted]",
                                                            "author": "[deleted]",
                                                            "created_utc": 1404115099.0,
                                                            "replies": [
                                                                {
                                                                    "name": "t1_cikot2f",
                                                                    "parent_id": "t1_cikorcp",
                                                                    "body": "I don't know where you are in  the series, but zachariah does send dean into a future AU. ",
                                                                    "author": "mlp-alex",
                                                                    "created_utc": 1404115335.0,
                                                                    "replies": [
                                                                        {
                                                                            "name": "t1_cikp6va",
                                                                            "parent_id": "t1_cikot2f",
                                                                            "body": "You mean the croatoan universe? That definitely was an AU but that's exactly why I don't think Dean Smith was one. It just wasn't complete enough. With the apocalypse, people really existed in the universe. If Dean wanted to talk to Cass he could talk to Cass. But when Sam wanted to talk to \"his ex-fiance\" the phone number was to a pet hospital. This makes it seem like the outcome wasn't causal but substitution.\n\nThe other thing is the specific details Dean \"remembers.\" For instance, Dean really loved America's Next Top Model and NPR, but in no other AU we've seen does he like anything close to that stuff. It just reeks of an Archangel painting the worst possible picture. ",
                                                                            "author": "[deleted]",
                                                                            "created_utc": 1404117384.0,
                                                                            "replies": [
                                                                                {
                                                                                    "name": "t1_cil3t1y",
                                                                                    "parent_id": "t1_cikp6va",
                                                                                    "body": "Zachariah said so himself (if I'm remembering correctly) that they took down a real ghost in a real building. It wasn't an AU. He just wiped Sam and Dean's memories temporarily to show that Dean would always choose to be a hunter, regardless of his upbringing.",
                                                                                    "author": "howarthee",
                                                                                    "created_utc": 1404159262.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_ciksz7j",
                    "parent_id": "t1_cik5jrt",
                    "body": "&gt; Dean can't--fundamentally, if Dean wasn't fighting monsters, he'd still be fighting monsters, just in his own head and down the neck of a liquor bottle.\n\nExcept you're forgetting about the year between the end of Season 5 and the start of Season 6 where Dean lives with Lisa and Ben as part of a normal life. I'm a little rusty on my *Supernatural* knowledge, but he seemed to be doing fine over the course of that year.",
                    "author": "Captainsuperdawg",
                    "created_utc": 1404136062.0,
                    "replies": [
                        {
                            "name": "t1_cikzed1",
                            "parent_id": "t1_ciksz7j",
                            "body": "[deleted]",
                            "author": "[deleted]",
                            "created_utc": 1404150570.0,
                            "replies": [
                                {
                                    "name": "t1_cil0bx9",
                                    "parent_id": "t1_cikzed1",
                                    "body": "You are correct, and so was Mean0Dean0. Dean said in one episode how he came back and was a wreck; he was jumpy, drank too much, and had nightmares constantly. So he wasn't fighting literal monsters, but the ones in his head.",
                                    "author": "howarthee",
                                    "created_utc": 1404152410.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "name": "t1_ciwiglt",
                            "parent_id": "t1_ciksz7j",
                            "body": "He also had devil traps under all his rugs, a car full of shotguns, saw monsters everywhere and almost killed his neighbor's dog.\n\nComparatively, Sam just had a house, a dog, a bitch, and no crazy.",
                            "author": "Nightmare_Wolf",
                            "created_utc": 1405288150.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cik5wck",
            "parent_id": "t3_29e02r",
            "body": "I would say neither of them are without fault. In some of these cases, Sam is trying to set boundaries and prevent Dean from unilaterally making decisions that effect both of them. Protective can turn into controlling very easily. They both try to sacrifice for the other, and sometimes they just end up hurting that person even more. They aren't children any more and Sam has the right to stand up for himself and make decisions about his own life.",
            "author": "HappaVet",
            "created_utc": 1404064479.0,
            "replies": [
                {
                    "name": "t1_cikbfes",
                    "parent_id": "t1_cik5wck",
                    "body": "Understood and I'm not saying Sam's not entitled to his own choices. I'm saying he makes selfish, impulsive, bad choices that regularly hurt or effect his brother. He is his own person but that person is a bad brother.",
                    "author": "DXGypsy",
                    "created_utc": 1404077824.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cik9rrc",
            "parent_id": "t3_29e02r",
            "body": "[deleted]",
            "author": "[deleted]",
            "created_utc": 1404073725.0,
            "replies": [
                {
                    "name": "t1_cik9spq",
                    "parent_id": "t1_cik9rrc",
                    "body": "Sorry mlp-alex, your post has been removed:  \n\n&gt; Comment Rule 1\\. \"Direct responses to a CMV post must challenge at least one aspect of OP’s current view (however minor), unless they are asking a clarifying question. Arguments in favor of the view OP is willing to change must be restricted to replies to comments.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)  \n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Removed+Comment+Rule+1+Post+Appeal&amp;message=mlp-alex+would+like+to+appeal+the+removal+of+[his/her+post](http://www.reddit.com/r/changemyview/comments/29e02r/cmv_sam_winchester_is_a_terrible_brother_and_dean/cik9rrc\\))",
                    "author": "Grunt08",
                    "created_utc": 1404073794.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cika2bb",
            "parent_id": "t3_29e02r",
            "body": "Is this guy serious? First of all, Sam didn't go to college to party he went to be a lawyer because he EARNED a full scholarship to Stanford. In the episode skin,  Dean makes a jab at Sam about a frat party and Sam even said he didn't exactly party, he was a bookworm. And second, Sam did everything he could to save dean, even as far to 'trust' a demon. Then when Dean died Sam even said that he tried everything to opening the hell gates to trading places with Dean but \"no demon would deal\" Then when Dean killed Dick Roman and went to Purgatory, Sam didn't have any idea what happened to him. What was he supposed to do? Sam sure as hell isn't going to self wallow. So he did what dean did at the end of the fifth season. AND then when Sam drove baby and they crashed, that wasn't sams fault, the we rammed by a demon. Then,  a point you missed, Sam was going to kill some low level price of shit demon with the last bullet of the colt just to protect dean and his father. \nAnd have you forgotten that crap that Cass has pulled on dean? ",
            "author": "mlp-alex",
            "created_utc": 1404074463.0,
            "replies": [
                {
                    "name": "t1_cikb6zn",
                    "parent_id": "t1_cika2bb",
                    "body": "Sam spent how long in Season 3 or 4 laying in bed drinking demon blood for his own selfish purposes, despite Dean's warnings and protests? Bloodthirsty hunting excursions with a sociopathic grandpa? Intentionally letting Dean get mauled by vampires? Letting his cop friend get infested by the drider? \n\nAnd there is never any excuse for damaging Baby. Dean's driven her through demons and gunfire and fiery explosions and never even scratched her. ",
                    "author": "DXGypsy",
                    "created_utc": 1404077263.0,
                    "replies": [
                        {
                            "name": "t1_cikep7c",
                            "parent_id": "t1_cikb6zn",
                            "body": "It's not fair to look at times when Sam didn't have his soul.",
                            "author": "SidusKnight",
                            "created_utc": 1404085755.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cikfvs6",
                            "parent_id": "t1_cikb6zn",
                            "body": "It wasn't selfish of him to drink demon blood. He was going after Lilith, and the only way he knew of to kill her was to pump up his powers with demon blood. Lilith killed Dean, it was more revenge than selfishness.  \nIf you've watched Season 9, you can see that Sam without a soul was actually ridiculously tame compared to other people without souls. But regardless, if you don't have a soul, you're going to be self-serving, so using the first half of Season 6 isn't a just assessment of his character.",
                            "author": "howarthee",
                            "created_utc": 1404088740.0,
                            "replies": [
                                {
                                    "name": "t1_cikn4ki",
                                    "parent_id": "t1_cikfvs6",
                                    "body": "Plus, in season 9, the only reason Sam was kind of a dick was because the mark of cain has its consequences, one I assume would be too tear two brothers apart. ",
                                    "author": "mlp-alex",
                                    "created_utc": 1404108122.0,
                                    "replies": [
                                        {
                                            "name": "t1_cil05rt",
                                            "parent_id": "t1_cikn4ki",
                                            "body": "Plus the fact that Sam had his free will taken away from him by Dean in the beginning of the season. He deserved to be upset. I'm not saying that they shouldn't have done more to work it out, but (like you said) The Mark was taking it's toll on Dean and helped to tear them apart.",
                                            "author": "howarthee",
                                            "created_utc": 1404152077.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_cikn6bc",
                            "parent_id": "t1_cikb6zn",
                            "body": "&gt;Sam spent how long in Season 3 or 4 laying in bed drinking demon blood for his own selfish purposes, despite Dean's warnings and protests? Bloodthirsty hunting excursions with a sociopathic grandpa? Intentionally letting Dean get mauled by vampires? Letting his cop friend get infested by the drider? \n\n&gt;And there is never any excuse for damaging Baby. Dean's driven her through demons and gunfire and fiery explosions and never even scratched her. \n\nDemon blood was a drug, no one on drugs is in their right mind. Plus dean beat the shit out of baby when he was coping with his dad's death. ",
                            "author": "mlp-alex",
                            "created_utc": 1404108303.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cild2ie",
                            "parent_id": "t1_cikb6zn",
                            "body": "He didn't have a soul during that year with crazy Grandpa Campbell.",
                            "author": "[deleted]",
                            "created_utc": 1404179248.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cikbww7",
            "parent_id": "t3_29e02r",
            "body": "thats because Dean and the family business has brought Sam nothing but bad memories, sam got bullied at school because he also moved around, when he finally got out and met a girl (twice) he either had to leave them or they were killed, he's had to leave other loves, sure dean has aswell, but dean WANTS to live this life and believes he doesn't deserve any better, sam knows there is a light at the end of the tunnel and is more than happy heading towards that light, while dean is alive he will be a hunter and he does love dean, but if dean dies then thats sam's way out, he will mourn and he will be upset, but he wont continue hunting because the only reason he is hunting in the first place is for dean, if there is no dean there is no reason to hunt, he can function without dean whereas dean only knows hunting and cannot function without sam",
            "author": "oscar906",
            "created_utc": 1404078927.0,
            "replies": [
                {
                    "name": "t1_cikigqx",
                    "parent_id": "t1_cikbww7",
                    "body": "I have to argue that Dean hunted until he was 26 (I think) without Sam. Can you make any argument in Sam's favor about being a good brother?",
                    "author": "DXGypsy",
                    "created_utc": 1404095193.0,
                    "replies": [
                        {
                            "name": "t1_cikn7j2",
                            "parent_id": "t1_cikigqx",
                            "body": "Sam and Dean hunted together all the time, but then Sam left for Stanford for a few years. ",
                            "author": "mlp-alex",
                            "created_utc": 1404108427.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cikp0hi",
                            "parent_id": "t1_cikigqx",
                            "body": "he hunted with his father until he was 26, soon as daddy went bye bye he had nobody and had to find sam",
                            "author": "oscar906",
                            "created_utc": 1404116430.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cikhbhg",
            "parent_id": "t3_29e02r",
            "body": "This is absurd.\n\nSam wanted to live a normal life.  He was doing fine.  Then Dean comes and makes him start doing things which have a 99+% percent chance of him dying.  Sam would be happy living a normal life.  Dean can't handle that and forces Sam to fight an endless stream of deadly monsters.\n\nOh, and what about the time that Sam was about to save hundreds of thousands of people's lives and permanently improve the lives of everyone forever?  Dean comes and makes him stop.  \n\nOh, and stopping doesn't actually save Sam's life.  Sam just wants to go peacefully then Dean tricks him into being possesed by an angel.  If it weren't for luck, Sam might never have had his free will again.\n\nFrankly, the behavior of both Sam and Dean is at times highly illogical.  They know 100% that hell exists and that their actions will send them there.\n\nSo if anything, to me it seems like Sam is a more normal person, and Dean is a macho, testosterone fueled guy who can't live without hunting something constantly.\n\nI do like the show a lot though, particularly season 8 (my thoughts on season 9 are much lower)",
            "author": "ClearlyXO",
            "created_utc": 1404092359.0,
            "replies": [
                {
                    "name": "t1_cikhhoa",
                    "parent_id": "t1_cikhbhg",
                    "body": "He didn't trick him into being angel possessed. Sam was in a coma. Dean just didn't share the info. Dean makes the hard choices. Sam makes the self serving ones. ",
                    "author": "DXGypsy",
                    "created_utc": 1404092799.0,
                    "replies": [
                        {
                            "name": "t1_cikhmdh",
                            "parent_id": "t1_cikhhoa",
                            "body": "Sam did not agree willingly to become possessed by an angel and no longer have free will.  Dean made it so that he was.  That's an extremely bad thing to do to someone.  Arranging for some other being to be able to completely take over someone else and control them is yucky.",
                            "author": "ClearlyXO",
                            "created_utc": 1404093118.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cil64h5",
            "parent_id": "t3_29e02r",
            "body": "Sam went to Stanford because he earned a full scholarship. He wasn't there to party. \n\nSam also tried to save Dean after Season 3, even by switching places with him, but no demon would deal with him. \n\nHe also took a massive one for the team by overcoming Lucifer and trapping him in the cage, where he was tortured enough to scar him permanently (until Cas healed him). \n\nSam didn't look for Dean when he was in Purgatory, but Dean didn't look for Sam when he was in Lucifer's Cage. They resolved that they wouldn't try to help each other if something like that happened, because doing so would only cause more trouble. \n\nSam is a self-centered, whiny crybaby only in the sense that Dean is a vicious, bloodthirsty psychopath (especially in the 9th season). ",
            "author": "TheBlackCrusader",
            "created_utc": 1404163892.0,
            "replies": []
        },
        {
            "name": "t1_cimpi3t",
            "parent_id": "t3_29e02r",
            "body": "Actually Sam tried to make a deal with a demon to get dean back after he was sent to hell. also the entire third season is sam tring to break deans deal",
            "author": "OcularSiren",
            "created_utc": 1404317820.0,
            "replies": []
        }
    ]
}