{
    "name": "t3_302atl",
    "title": "CMV: Hank should have told Dale about his wife's affair with John Redcorn.",
    "body": "In the television series *King of the Hill*, Nancy has an affair with John Redcorn for several seasons. Her husband, Dale, never finds out. Joseph, the son of Nancy and John Redcorn, also never finds out. \n\nI have three related arguments. 1) Hank should have told Dale about the affair and 2) Someone (Nancy?) should have told Joseph who his real father was. \n\nHank is supposedly one of Dale's best friends, and as such should have told his friend about the ongoing constant cheating that was occurring under Dale's roof. Instead, Hank sits back while Dale raises a kid that's not his own, and constantly is made to be a fool while John Redcorn gets to bang his wife.\n\nLikewise, Joseph grows up without any of the knowledge from his native american father, without his real father's advice and traditions. It is likely that one day Joseph will find out that he is half native american - it would be much better if he found this out from his own mother while he had a chance to share his childhood with his real father. Instead, he had to go through puberty and enter early adulthood with only the squirrely Dale as his role model.\n\nThat Hank never tells his best friend tarnishes Hank's character. Hank comes off as a selfish promoter of the status quo with no real maturity to do the right thing. Hank doesn't care about Dale at all, and only puts up with him (and patronizes him) to proliferate the \"peace\" of the neighborhood. But, in almost every other part of the show, Hank is shown to be a mature caring individual who has the resolve to do the right thing no matter what. Not only should Hank have told Dale because that's what best friends do, Hank should have told Dale because it fits his character. \n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "Prof_Acorn",
    "num_comments": 52,
    "created_utc": 1427148744.0,
    "url": "http://www.reddit.com/r/changemyview/comments/302atl/cmv_hank_should_have_told_dale_about_his_wifes/",
    "comments": [
        {
            "name": "t1_cpogvf1",
            "parent_id": "t3_302atl",
            "body": "One thing that you have to remember is that Hank is willing to let things that he would normally be against  go if they serve the greater good. \n\nRemember when Buck was banned from Jugstore Cowboy's? Obviously Hank would prefer Buck not spend all day at a strip club, but because his presence was a negative influence at Strickland Propane, he facilitated Buck being unbanned. \n\nDale is dirt stupid. Despite the affair being obvious to everyone, Dale was under the impression that he was living in a happy marriage. \n\nTelling Dale not only would have destroyed him, it would have torn his family apart. Telling Dale about the affair would have benefited no one. The affair was not harming Dale or Joseph. By Hank remaining silent, the only people hurt by the affair were Nancy and John Redcorn.",
            "author": "420big_poppa_pump420",
            "created_utc": 1427150935.0,
            "replies": [
                {
                    "name": "t1_cpojaxi",
                    "parent_id": "t1_cpogvf1",
                    "body": "&gt; Dale is dirt stupid.\n\nHe's also dramatic.  Freaks out over the tiniest thing with some conspiratorial backdrop to every grievance.  I almost wonder if he'd believe Hank given how skeptical he is of everything that makes sense.",
                    "author": "PepperoniFire",
                    "created_utc": 1427154986.0,
                    "replies": [
                        {
                            "name": "t1_cpok4qs",
                            "parent_id": "t1_cpojaxi",
                            "body": "Dales personality or intelligence should not bare any weight in hanks decision to tell his neighbor and best friend that his wife is being a lot lizard and hooking up w a man that dale not only knows, but looks at w respect as a man and friend. \n\nHank doesn't have a but and apparently does not have a spin for keeping a secret of this magnitude. \n\nAlso are Nancy's tits fake? They are niiice 👌",
                            "author": "Brandan003",
                            "created_utc": 1427156356.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cpoores",
                            "parent_id": "t1_cpojaxi",
                            "body": "What? He doesn't overreact in the sligh--POCKET SAND!",
                            "author": "Kramer390",
                            "created_utc": 1427164131.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cpomuj3",
                    "parent_id": "t1_cpogvf1",
                    "body": "You have me at the \"greater good\" side of the argument, but I would disagree with the following\n\n&gt;\"The affair was not harming Dale or Joseph.\"\n\nI would say Joseph not knowing is real father is harming him in some ways and considering that Dale only had sex once a year on his birthday, his and Nancy's relationship was harmed as well.",
                    "author": "Prof_Acorn",
                    "created_utc": 1427160915.0,
                    "replies": [
                        {
                            "name": "t1_cpoumgn",
                            "parent_id": "t1_cpomuj3",
                            "body": "I'd argue that not knowing who his real father is works out in Joseph's favor.  Dale, despite his many faults, is usually a loving father who truly cares for Joseph.  John Redcorn doesn't do much for Joseph at all, even though he knows full well that he's the father.  Joseph could have a deadbeat dad who doesn't actually want to raise him who actually is related to him by blood, or he could have a loving father who isn't related.",
                            "author": "abutthole",
                            "created_utc": 1427177219.0,
                            "replies": [
                                {
                                    "name": "t1_cpoxpog",
                                    "parent_id": "t1_cpoumgn",
                                    "body": "Until Joseph needs a kidney or to hold the US up to any of it's treaties it's signed.",
                                    "author": "AliceHouse",
                                    "created_utc": 1427190494.0,
                                    "replies": []
                                },
                                {
                                    "name": "t1_cpozdqo",
                                    "parent_id": "t1_cpoumgn",
                                    "body": "John Redcorn expressed the desire to be a father figure to Joseph on several occasions, and he never pressed the issue further because Dale was doing a decent enough job.",
                                    "author": "cokevanillazero",
                                    "created_utc": 1427197674.0,
                                    "replies": [
                                        {
                                            "name": "t1_cpp7ghc",
                                            "parent_id": "t1_cpozdqo",
                                            "body": "So either a) Redcorn wants what's best for Joseph and agrees with the above poster that Dale is a good enough loving father and it is in Joseph's best interest for Joseph to never know, or b) Redcorn doesn't really want to be a father figure in Joseph's life because he could just tell Joseph and demand legal custody knowing the paternity DNA test would prove he's the father and give him rights to see Joseph, but he doesn't do that because it'd piss off Nancy and he'd rather keep sleeping with Nancy. \n\nEven once he and Nancy break up and you'd think now is the time for him to do tell Joseph without caring about upsetting Nancy, he doesn't. Why? Again - either A or B above. ",
                                            "author": "mizz_kittay",
                                            "created_utc": 1427214235.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "name": "t1_cpozy3f",
                                    "parent_id": "t1_cpoumgn",
                                    "body": "In the later half of the series, John Redcorn seems incredibly frustrated that he can't do much for Joseph. It's not because he doesn't want to; Nancy just won't let him. ",
                                    "author": "purplesquirrels",
                                    "created_utc": 1427199563.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "name": "t1_cpp4dg6",
                            "parent_id": "t1_cpomuj3",
                            "body": "Nancy has sex with Dale on Christmas too, that's why she is so miserable around the holidays.\n\nEDIT: a word",
                            "author": "halfsherlock",
                            "created_utc": 1427209200.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cpphehl",
                            "parent_id": "t1_cpomuj3",
                            "body": "Dale is Joseph's real father, just not his biological one. Dale raised the kid. ",
                            "author": "strong_potato",
                            "created_utc": 1427229608.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cpp9ctn",
                    "parent_id": "t1_cpogvf1",
                    "body": "&gt;Telling Dale about the affair would have benefited no one. The affair was not harming Dale or Joseph.\n\nExcept that it exposes Dale to any STIs that Redcorn might pick up. Cheating is more than a relationship issue; it takes away a partner's informed consent. \n\n",
                    "author": "IAMATruckerAMA",
                    "created_utc": 1427217196.0,
                    "replies": [
                        {
                            "name": "t1_cpphfr4",
                            "parent_id": "t1_cpp9ctn",
                            "body": "Nancy and Dale don't have sex anymore though. ",
                            "author": "strong_potato",
                            "created_utc": 1427229664.0,
                            "replies": [
                                {
                                    "name": "t1_cpra9u0",
                                    "parent_id": "t1_cpphfr4",
                                    "body": "I don't know anything about that, so I'll just figure you're right. Also, I didn't downvote you. ",
                                    "author": "IAMATruckerAMA",
                                    "created_utc": 1427372776.0,
                                    "replies": []
                                },
                                {
                                    "name": "t1_cpubakq",
                                    "parent_id": "t1_cpphfr4",
                                    "body": "I haven't really followed the series very closely, but someone in a different comment thread mentioned something about once-a-year birthday sex for Dale.",
                                    "author": "maslowk",
                                    "created_utc": 1427613488.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cpogwnu",
            "parent_id": "t3_302atl",
            "body": "It's very easy to decide what is and is not the \"right\" thing to do in a situation like that when you and the people you care about have no stake in the consequences.\n\nWhat would those consequences be if Dale found out about the affair or Joseph found out that Redcorn was his father? \n\nFirst, Dale is incredibly unstable. There would be no telling how he would react; if I recall correctly, on the few occasions that Hank was close to revealing the affair, Dale's erratic behavior made Hank decide to do otherwise. \n\nSecond, it's likely that Dale was, to a lesser or greater extent, willfully ignorant of Nancy's affair. He wasn't a smart man, and perhaps his suspicious nature coupled with the affair going on right under his nose was meant to be ironic... but, there was plenty of cause for suspicion that Nancy was banging Redcorn and that Joseph was a product of said banging. If Dale was being willfully ignorant of the affair, then what business of it was Hank's to shatter that illusion?\n\nThird, in regards to Joseph, I don't recall Hank having any special relationship with the boy. I could be wrong, but even if he did, I'm sure Hank would defer to Gribbles and to Redcorn to decide what is best for Joseph.",
            "author": "mrgoodnighthairdo",
            "created_utc": 1427150992.0,
            "replies": [
                {
                    "name": "t1_cpom9oq",
                    "parent_id": "t1_cpogwnu",
                    "body": "&gt; He wasn't a smart man, and perhaps his suspicious nature coupled with the affair going on right under his nose was meant to be ironic.\n\nIt pretty much was. It was even the punchline of some jokes and played up for laughs.",
                    "author": "thewoodenchair",
                    "created_utc": 1427159948.0,
                    "replies": []
                },
                {
                    "name": "t1_cpozwy5",
                    "parent_id": "t1_cpogwnu",
                    "body": "The key thing to Dale that makes him ignorant of the affair is that above all, he is trusting to a fault. He trusts his wife so much that cheating never enters the equation.\n\n When confronted with Joseph not being his son, clearly aliens. That was mute logical top him than his wife cheating. \n\nAs for his paranoia easy to think something in his past broke his trust in the government, now look at him. Imagine if he lost his trust in women/ his wife. What would that do to his family?",
                    "author": "ZTexas",
                    "created_utc": 1427199464.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cpoicwl",
            "parent_id": "t3_302atl",
            "body": "You really think Dale didn't already know?  I always assumed he knew and chose to ignore it himself.  If Dale is willingly to happily be blissfully ignorant, it would just be mean of Hank to put him in a situation where he was no longer able to maintain that blissful ignorance.",
            "author": "EyeRedditDaily",
            "created_utc": 1427153415.0,
            "replies": [
                {
                    "name": "t1_cpomxh3",
                    "parent_id": "t1_cpoicwl",
                    "body": "The first few seasons he shows a deep trust of John Redcorn. If there was some some purposeful ignorance I'd assume the show would make note of his doubt.\n\nHe is super trusting. Note the episode where he trusted Hank with the stolen mower, or when he trusted Hank during \"Mr. Big\".",
                    "author": "Prof_Acorn",
                    "created_utc": 1427161049.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cpoj5rs",
            "parent_id": "t3_302atl",
            "body": "[Dale knew the whole time.](http://www.reddit.com/r/FanTheories/comments/2x6iek/king_of_the_hill_dale_knew_about_the_affair_and/)\n\nAnd secondly, as any adopted non-cartoon person will tell you, your \"real father\" has little to do with who came in your mom and so much more with who loved you and was there for you your whole life.\n\nYou think John Redcorn actually *cared* about Joseph?  Why didn't *he* tell him?  Oh, because his side bitch would be mad at him?\n\nFuck Nancy for stepping out on Dale, but fuck John Redcorn for caring more about getting laid than having a relationship with his son.",
            "author": "DashFerLev",
            "created_utc": 1427154747.0,
            "replies": [
                {
                    "name": "t1_cpokzkv",
                    "parent_id": "t1_cpoj5rs",
                    "body": "First of all, I can think of one big hole in that theory: Dale never cheats on Nancy. \n\nWhen Nancy \"gets back together\" with Nancy, it's obvious that he enjoys sex. We know that Nancy only had sex with him once per year on his birthday when she was with Redcorn. So why didn't he cheat on her? He's had chances (the exterminator played by Sarah silverman). \n\nAlso, Redcorn cares very much for Joseph. He is upset that he wasted the best years of his life with Nancy and other women instead of having a family that he could pass down his tribal traditions to. The reason he's not in Josephs life is because he understands that Joseph is truly Dale's son in all ways aside from biologically. \n\n",
                    "author": "420big_poppa_pump420",
                    "created_utc": 1427157787.0,
                    "replies": [
                        {
                            "name": "t1_cpoluuw",
                            "parent_id": "t1_cpokzkv",
                            "body": "It's explained in the link.\n\nHe doesn't want to risk fucking up a good thing.  If he calls Nancy out or if he got caught cheating, they'd definitely get divorced and let's run down what would happen.\n\n*  Dale has seen what divorce did to Bill.  Dale is old and crazy and pretty worthless- who would have him?\n\n*  Dale would fuck up a good thing because Nancy is obviously the breadwinner which frees him up to be his crazy self and do the Exterminator thing in his spare time.\n\n* Dale would 100% lose Joseph.  Redcorn wants to pursue a relationship with Joseph, and he's the biological father, *and* Nancy would probably start a more legitimate relationship with John... so Dale would be shit out of luck in the Joseph department.\n\nClearly Nancy is keeping the affair a \"secret\" because she's a weather girl in a small town and with that Scarlet A, she'd lose her job in a minute.\n\nAlso\n\n&gt; The reason he's not in Josephs life is because he understands that Joseph is truly Dale's son in all ways aside from biologically.\n\nNope.  He obviously wants Joseph to follow in the traditions of John's people during the snipe episode and other episodes I don't remember because I haven't seen that show in ages.",
                            "author": "DashFerLev",
                            "created_utc": 1427159255.0,
                            "replies": [
                                {
                                    "name": "t1_cpovtyj",
                                    "parent_id": "t1_cpoluuw",
                                    "body": "&gt;He doesn't want to risk fucking up a good thing.  If he calls Nancy out or if he got caught cheating, they'd definitely get divorced and let's run down what would happen.\n\nThat's giving Dale way too much credit in terms of planning ahead.\n\n&gt;*  Dale has seen what divorce did to Bill.  Dale is old and crazy and pretty worthless- who would have him?\n\nDale is pretty arrogant so he'd probably think he'd fair much better than Bill if it came to that.\n\n&gt;*  Dale would fuck up a good thing because Nancy is obviously the breadwinner which frees him up to be his crazy self and do the Exterminator thing in his spare time.\n\nIf anything I think Dale loves Nancy way more than her money.\n\n&gt;* Dale would 100% lose Joseph.  Redcorn wants to pursue a relationship with Joseph, and he's the biological father, *and* Nancy would probably start a more legitimate relationship with John... so Dale would be shit out of luck in the Joseph department.\n\nYeah, this one I believe.\n\n&gt;Clearly Nancy is keeping the affair a \"secret\" because she's a weather girl in a small town and with that Scarlet A, she'd lose her job in a minute.\n\nActually that's a pretty Texan thing to do, \"let sleeping dogs lie\" and what not.",
                                    "author": "UOUPv2",
                                    "created_utc": 1427181626.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "name": "t1_cpomq11",
                            "parent_id": "t1_cpokzkv",
                            "body": "&gt; First of all, I can think of one big hole in that theory: Dale never cheats on Nancy.\n&gt; \n\nWait, why is that a hole in the theory? Part of the theory is that Dale isn't very good with people and isn't going to have the easiest time finding another partner. He doesn't cheat because he can't really. He's got no game.",
                            "author": "mizz_kittay",
                            "created_utc": 1427160709.0,
                            "replies": [
                                {
                                    "name": "t1_cpovurm",
                                    "parent_id": "t1_cpomq11",
                                    "body": "Except that episode where a girl he has a lot in common with throws herself at him.",
                                    "author": "UOUPv2",
                                    "created_utc": 1427181722.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cpon0c6",
                    "parent_id": "t1_cpoj5rs",
                    "body": "John Redcorn wanted to tell him, and almost did during the Thanksgiving episode, but felt as though he owed Dale something for all the help Dale was giving him. That episode pretty clearly shows that the only reason that John Redcorn doesn't tell Joseph (even after Nancy breaks off the affair) is that he respected Dale too much to be the bearer of bad news.",
                    "author": "Prof_Acorn",
                    "created_utc": 1427161176.0,
                    "replies": [
                        {
                            "name": "t1_cpon5nq",
                            "parent_id": "t1_cpon0c6",
                            "body": "Yeah, I'm sure what he was thinking about while he was plowing Dale's wife was how much he respected him.\n\nAlso- the show starts when Joseph is, what, 12?  How old was he when he decided he respected the man whose marriage he was ruining?",
                            "author": "DashFerLev",
                            "created_utc": 1427161411.0,
                            "replies": [
                                {
                                    "name": "t1_cpot9ca",
                                    "parent_id": "t1_cpon5nq",
                                    "body": "Redcorn didn't respect Dale until that episode, because Dale was selflessly helping him reclaim the land of his ancestors from the government. ",
                                    "author": "420big_poppa_pump420",
                                    "created_utc": 1427173208.0,
                                    "replies": [
                                        {
                                            "name": "t1_cpotcwb",
                                            "parent_id": "t1_cpot9ca",
                                            "body": "Exactly.\n\nPrior to that episode he expressed \"interest\" in Joseph as a son, except that would probably stop the sex with Nancy.",
                                            "author": "DashFerLev",
                                            "created_utc": 1427173471.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_cpp3cnv",
                            "parent_id": "t1_cpon0c6",
                            "body": "One of my favorite episodes. Plus the lines with Dale and John:\n\n\"Why don't you guys celebrate Thanksgiving?\"\n\n\"We did...once.\"\n\nDale being oblivious, rants on.",
                            "author": "Geewiz89",
                            "created_utc": 1427207377.0,
                            "replies": [
                                {
                                    "name": "t1_cpp5zkb",
                                    "parent_id": "t1_cpp3cnv",
                                    "body": "One of the best lines in the whole show IMO.",
                                    "author": "emanresu_sdrawkcab",
                                    "created_utc": 1427211884.0,
                                    "replies": []
                                },
                                {
                                    "name": "t1_cqcq11x",
                                    "parent_id": "t1_cpp3cnv",
                                    "body": "Or because plenty of Native Americans celebrate it and Dale knows that, as well as history not being quite what people think it is.",
                                    "author": "vondergeist",
                                    "created_utc": 1429064955.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cpom4hm",
            "parent_id": "t3_302atl",
            "body": "So, a couple things\n\n1) The conceit of the show is that it's *real* (ish) people in Texas. They're not cartoon characters, they actually do things real people would do. Yep, even crazy Dale-- I've heard plenty of Texas friends say oh yeah, people like Dale? 100% exist.\n\nSo it's okay that there's a sort of... uncomfortable dynamic/character flaw in that no one's really willing to speak up about it. That's what a real person might do... just let it go.\n\n2) Hank didn't *know.* He knew, but he didn't *know.* Something being, like, really really really obvious isn't enough to make that kind of accusation. If Dale doesn't already see it, he doesn't *want* to see it, and making claims without **actual real evidence** isn't going to change his mind. All it would do is cause a rift between Dale and Hank, and possibly seed some destruction in Dale's family. Dale had accepted Joseph as his son, had raised him, so for all intents and purposes Joseph *was* Dale's son.",
            "author": "sonofaresiii",
            "created_utc": 1427159706.0,
            "replies": [
                {
                    "name": "t1_cpomrk6",
                    "parent_id": "t1_cpom4hm",
                    "body": "&gt; 2) Hank didn't know. He knew, but he didn't know.\n\nThis is true to a point. There was an episode when Hank had hard evidence and was forced to confront it and chose not to tell Dale. ",
                    "author": "mizz_kittay",
                    "created_utc": 1427160777.0,
                    "replies": [
                        {
                            "name": "t1_cpoopp7",
                            "parent_id": "t1_cpomrk6",
                            "body": "Sure, which I think goes to the point that by then, it would just cause more trouble than hank thought was necessary. I guess I was basing my points off earlier in their life, because I think by then Nancy had stopped her affair, dale was already Joseph's father and it would just cause unnecessary heart ache and ruin the family. ",
                            "author": "sonofaresiii",
                            "created_utc": 1427164049.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cponany",
                    "parent_id": "t1_cpom4hm",
                    "body": "&gt;Hank didn't know. He knew, but he didn't know.\n\nThere are quite a few episodes where his knowledge of the affair is pretty much a known fact. For example, when Nancy was torn between John and Dale, Hank says something like \"You met John Redcorn three months after you married Dale\" or when they were breaking up and John Redcorn was crying about his \"Nan Nan\" to an uncomfortable Hank.",
                    "author": "Prof_Acorn",
                    "created_utc": 1427161642.0,
                    "replies": [
                        {
                            "name": "t1_cpoolkq",
                            "parent_id": "t1_cponany",
                            "body": "Yep. Just like I said. ",
                            "author": "sonofaresiii",
                            "created_utc": 1427163853.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cpoq7cs",
                    "parent_id": "t1_cpom4hm",
                    "body": "&gt;So it's okay that there's a sort of... uncomfortable dynamic/character flaw in that no one's really willing to speak up about it. That's what a real person might do... just let it go.\n\nPart of your argument plus part of someone else's argument about Hank's character somewhat changed my view, at least in terms of Hank saying something. I still think he should have told him, or Bill, or Boomhaur, and the way the show leaves Dale never finding out leaves a poor taste in my mouth, but I can begrudgingly give a delta for convincing me that Hank's character is one that is quite live-and-let-live unless it brings harm to his family or lawn and that it could possible be a character flaw. I'd say I'm half convinced, but half not, but since I can't get a half-delta I'll be fair and give a whole one ∆",
                    "author": "Prof_Acorn",
                    "created_utc": 1427166698.0,
                    "replies": [
                        {
                            "name": "t1_cpoqb7b",
                            "parent_id": "t1_cpoq7cs",
                            "body": "Confirmed: 1 delta awarded to /u/sonofaresiii.\n\n[^sonofaresiii's ^delta ^history](/r/ChangeMyView/wiki/user/sonofaresiii) ^| [^delta ^system ^explained](/r/ChangeMyView/wiki/DeltaBot)",
                            "author": "DeltaBot",
                            "created_utc": 1427166881.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cponldu",
            "parent_id": "t3_302atl",
            "body": "You have to put youself into Hank's shoes:\n\n1. Hank personally witnessed Bill's divorce destroy Bill and left him a broken shell of a man. The thing is that as pathetic as Bill was in the present, Bill wasn't always such a loser back then. Dale, from the show's flashbacks, was already portrayed as incompetent, unstable, and well, Dale. Bill became a fuckup because of the divorce while Dale was already a fuckup since high school, if not earlier. Hank probably thought that if a normal person could be reduced to a fuckup because of a divorce, imagine how much more a fuckup would sink lower, which is a likely possibility if Dale learned that Nancy was cheating on him.\n\n2. Remember that episode where Peggy lost her shit because Hank got mono from some random chick back at high school? It was an overreaction because Hank kissing that chick ruined some romantic fantasy that Peggy had over how she and Hank first met or something. And if there is one person who blows things even more out of proportion and overreacts to minor things, it's Dale Gribble.\n\n3. Dale is highly suspicious of anyone, and the few people he trusts are Nancy and Hank. But the thing is that he trusts that they both have his best intentions at heart, not that he literally believes everything they say. It's very likely that even if Hank told Dale, Dale would refuse to believe Hank, think that Hank is telling a joke or not being serious, or believe in any other cognitive dissonant thoughts because as far as Dale is concerned, Nancy will never harm him. I mean, Dale already knows that he is not Joseph's biological dad and that John Redcorn was alone with Nancy on the day that she got pregnant. Part of me thinks that Dale only believed that aliens inpregnate Nancy because the truth of Nancy's infidelity would destroy him emotionally. In the end of the episode, Dale mostly played along with Joseph's suggestion that Dale might be his biological father instead of aliens because of reasons. Hank probably figured that Dale will never believe him anyways.\n\n4. Hank might judge people harshly, but he doesn't impose his values onto other people and rarely interfers with other people's lives. It's not his personality. He doesn't try to push Strickland away from his hedonic lifestyle, he doesn't try to make Cotton not be a bitter old racist, misogynist asshole, and for all his grips over Bobby not being right, he doesn't really micromanage Bobby or force Bobby to be into sports or anything else that would make Bobby \"right.\" Hank's tolerance of lifestyle that 100% goes against his values is contrasted with Peggy's constant attempts at trying to meddle into other people's affairs even though she is ostentatiously tolerant of other people's lifestyles.",
            "author": "thewoodenchair",
            "created_utc": 1427162141.0,
            "replies": [
                {
                    "name": "t1_cpoq61f",
                    "parent_id": "t1_cponldu",
                    "body": "&gt;Hank might judge people harshly, but he doesn't impose his values onto other people and rarely interfers with other people's lives. It's not his personality.\n\nPart of your argument plus part of someone else's argument about character flaws somewhat changed my view, at least in terms of Hank saying something. I still think he should have told him, or Bill, or Boomhaur, and the way the show leaves Dale never finding out leaves a poor taste in my mouth, but I can begrudgingly give a delta for convincing me that Hank's character is one that is quite live-and-let-live unless it brings harm to his family or lawn. I'd say I'm half convinced, but half not, but since I can't get a half-delta I'll be fair and give a whole one ∆",
                    "author": "Prof_Acorn",
                    "created_utc": 1427166635.0,
                    "replies": [
                        {
                            "name": "t1_cpoqcqm",
                            "parent_id": "t1_cpoq61f",
                            "body": "Confirmed: 1 delta awarded to /u/thewoodenchair.\n\n[^thewoodenchair's ^delta ^history](/r/ChangeMyView/wiki/user/thewoodenchair) ^| [^delta ^system ^explained](/r/ChangeMyView/wiki/DeltaBot)",
                            "author": "DeltaBot",
                            "created_utc": 1427166954.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cpor4j3",
            "parent_id": "t3_302atl",
            "body": "Nancy is much better for Dale than Dale is for Nancy. The only reason their relationship makes sense is because she's cheating on him with John Redcorn. Without her and Joseph, Dale would have a worse life than Bill.\n\nHank never tells his best friend his wife is cheating on him because Hank is not out to destroy his best friend's life out of some misguided sense of moral righteousness.",
            "author": "GregBahm",
            "created_utc": 1427168425.0,
            "replies": [
                {
                    "name": "t1_cpp3qvy",
                    "parent_id": "t1_cpor4j3",
                    "body": "Not necessarily. In the episode where Nancy gets a job as a newscaster (in Houston? ), we see dale's shenanigans keep Nancy away from getting herself in trouble. ",
                    "author": "buckhenderson",
                    "created_utc": 1427208094.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cposus3",
            "parent_id": "t3_302atl",
            "body": "You can make a mental pros/cons list about this situation. Think about the pros of not telling Dale:\n\nJohn, Recorn, Dale, Nancy, Hank, Joseph, and all of their mutual friends and acquaintences are all happy with the current situation. Yes, this situation is at the expense of truth, but would telling the truth lead any of them to be better off? John Redcorn obviously cares little-to-none about his son, Dale loves him like his true son, all of the relationships between the above are stable and would be thrown into a tornado if the secret got out.\n\nIf we are to look at it from a utilitarian perspective (that being that in a moral decision, the outcome that leads to the highest possible NET happiness is the most moral one), then it is clear that Hank should have not told him anything.",
            "author": "PeterPorky",
            "created_utc": 1427172199.0,
            "replies": []
        },
        {
            "name": "t1_cpov03f",
            "parent_id": "t3_302atl",
            "body": "First of all, Dale is a much better role model than John Redcorn. Redcorn is a womanizing, selfish, greedy (as evidenced by how he's willing to drop Luanne's Manger Babies from his VHS distribution company), and all around pompous person (he thinks his shitty death metal band is the greatest thing ever). He's also an extremely anger filled man, constantly discussing taking revenge on \"the white man\". \n\nDale, albeit a little crazy and paranoid, is actually kind, caring, thoughtful and above all else, selfless (remember when he saved the Stick-Tec office by killing thousands of roaches with his bare hands? Or when he rushed to save Joseph from the alien overlords at the Marfa Lights? Or the countless times he's shown his devotion and love for his wife?). The only thing Dale really dislikes is Bill, for being so pathetic and disgusting, and Rusty Shackleford, for totally made up reasons. \n\nSo it's much better for Joseph to grow up a little weird if it means he gets to learn good, quality values. The only thing he'd learn from John Redcorn is how to be a selfish asshole who fucks any woman he can in a vendetta against an entire race of people. \n\nWe also see that Joseph thinks John Redcorn is a pretty weird dude in the Thanksgiving episode, so I'm pretty sure going to live with him would be pretty damaging to Joseph. Not to mention that John Redcorn doesn't know the first thing about parenting.   \n\nAlso, sure John Redcorn might be hurt that he doesn't get to raise Joseph, *but that's the price you pay when you stick your dick in another man's wife*. Seriously, fuck John Redcorn. I'm glad he has to silently suffer while watching Dale raise his kid. He's a piece of shit, so the resulting harm to him is negligible.\n\nAnd as other people said, Hank typically stays out of people's personal business. Even if it's totally fucked up, he tries to keep personal details like sexual relations completely secret (he doesn't even like Luanne using the bathroom in his and Peggy's room). He would *never* broach the subject of intimate sexual relations with his friends - he avoids those conversations at all costs (watch the episode where Connie gets her first period for ample evidence of this aversion). \n\nHe also sees how destructive divorce can be, thanks to Bill. Hank sort of sees the value in \"ignorance is bliss\" at least when it comes to Dale. Bill at least has a steady paying military job. Dale would be homeless trying to live off of Dale's Deadbug (we're constantly reminded that Nancy is the breadwinner, and we see in the episode where Nancy goes to work in Dallas that Dale cannot take care of himself). So it's actually better for Dale to not be privy to the true father of Joseph as well. \n\nIf Hank told Dale, and Dale believed him (which is also a stretch), then it would ruin pretty much everyone's lives who are involved in it. Dale becomes homeless, Joseph is now a child of divorced parents who realizes at 13 that he's a different race than he thought, Nancy would have to deal with the publicity that would likely result from this, and John Redcorn's life as he knows it comes crashing down once he has legal guardianship over a child (no more banging sluts when he's gotta take Joseph to football practice). ",
            "author": "TuckerMcG",
            "created_utc": 1427178488.0,
            "replies": []
        },
        {
            "name": "t1_cpp08sy",
            "parent_id": "t3_302atl",
            "body": "Hank once said about Dale's mental state:\n&gt;We're putting extra stress on a structure that wasn't up to code in the first place.\n\nI get your point, but I think it was entirely reasonable of Hank to conclude that Dale couldn't handle this and that everybody would be happier/better off with the lie.",
            "author": "MeddlingMike",
            "created_utc": 1427200452.0,
            "replies": []
        },
        {
            "name": "t1_cpp20ag",
            "parent_id": "t3_302atl",
            "body": "I have been waiting for this. One episode showcases very well why he shouldnt. The one where Peggy finds out. See she was in your shoes or the shoes any of us would be in: she is angry and wants Nancy to get her comeuppance because not only was it moral, but she sort of would enjoy seeing what would happen. Now, I am sure we can agree that anyone else in this situation it would make sense to out it all. But Dale is still a very cartoony aspect in Arlen. He has guns, dangerous killing chemicals, and paranoid tendencies constantly on the brink of sanity. Would You tell that guy the truth? He would go fucking INSANE. He would very likely murder them all then his self. Thats point one. Point two, do you think Dale is unhappy? The show makes it a point to display how much Dale truly loves his wife and son, because even though he doesnt make a lot and needs Nancy just to live somewhat normally, he does everything he can for that kid! And this goes into point three, Joseph is Dale's kid, he isnt John Redcorns anymore. Why? Well, when Peggy goes to tell Dale everything in the episode, Joseph approaches and asks for five bucks for a movie for him and bobby to rent. When Dale checks he has two fives, and he says \"5 for you, 5 for me!\" and as the kids leave he giggles and says to Peggy, \"Watch this, Hey Joseph! I found another! Cant watch a movie without milk balls can you?\" And proceeds to hand him the second five. Why are these details important? Because despite his mental illness and poor lifestyle, he still knows how to bring a smile to his sons face anytime, which Nancy learns when Dale wins her back. The reason why nobody said anything for years? Because Dale is a great dad and even though Nancy wasnt close at the start, Dale and Joseph were and it would have ruined both their lives. Dale would find out the woman he loved had been cheating on him with his \"best\" friend, thus sending him into a psychotic rampage, and Joseph would have lost any security that was in his family. His parents would likely split up though he would go with Nancy who would probably go to John Redcorn, then all that fucked up dynamic would begin. Dale would be institutionalized. Now, you say because Joseph is Johns son, he deserves to know. That is definitely true, and maybe one day, when he has moved or when Dale has died and Joseph is smart enough to notice he is a different color, maybe Nancy will tell. Here is the big thing though: in a much later Thanksgiving episode and for many episodes, John Redcorn struggles with losing his son and wanting him back, but the point made is John wasnt there for Joseph, and Dale was. While Dale was raising the kid, Nancy and John fucked, thus losing any opportunity they had to redeem themselves before getting in too deep. so later, when the tables turn and John feels remorseful, it doesnt matter. Things are too far gone, and it becomes very unfair for John to ruin Dales life just because he fucked up twelve years prior. Lastly, even if Hank had spoken at the start, you would get similar results. See one detail we forget: John Redcorn had MULTIPLE bitches when he met Nancy and was known for being aloof, as seen when he takes Bills one true romance that should have worked. We would have two Bills then, not Bill and Dale. And, in that if Redcorn bailed after him being Josephs father came out, Nancy would have been alone to raise the kid, who would always know about his father, and probably never his real father. Long story short, Hank doesnt say anything because while it seems morally right, he would still be responsible for a very genuinely happy Dale who loves his family going over the edge and having his life ruined.",
            "author": "TheAlmightyFUPA",
            "created_utc": 1427204733.0,
            "replies": []
        },
        {
            "name": "t1_cpp4871",
            "parent_id": "t3_302atl",
            "body": "Theres a whole episode where Peggy eventually finds out about Joseph's origins and Hank tries to convince her to keep it quiet but she was adamant about telling Dale.\n\nEven she couldn't go through with it.",
            "author": "mluvite",
            "created_utc": 1427208946.0,
            "replies": []
        }
    ]
}