{
    "name": "t3_3cayqx",
    "title": "CMV: Sword Art Online is one of the best Anime of All Time [SPOILERS]",
    "body": "I've recently subscribed to r/anime, and as a long time anime watcher and considering myself to have the appropriate amount of good taste, I feel that Sword Art Online is massively misrepresented as mediocre among fellow fans and otakus. Currently ranked [#459 on MAL](http://myanimelist.net/anime/11757/Sword_Art_Online), this show scores an average rating of only 8 out of 10 nerd points.\n\nI believe this is due primarily to *hater votes*. It should be in the top 50, if not top 25, anime of all time.\n\nIn fairness to the haters, the ALO arcs sort of ruined it with the whole sister romance harem thing. Japanese people are weird, but they sure know how to milk a hit show. For that reason, SAO II is not considered here; just vanilla SAO please!\n\nSome Background\n\n---\n\nI am a 30-year old male product writer for the web, and I am not what most would consider an otaku or weeabo. (I prefer Korean culture, if we're comparing asking, and I don't go to cons, collect or read much Manga, or follow every anime series.) I watch anime recreationally, and consider myself a reasonable self-styled critic. I've recently watched quite a number of shows, being bored at home, and I've watched and rewatched SAO several times and am familiar with it.\n\n\n---\n\n**Why The Show Is Good**\n\nCharacters: The cast is great. Voice acting isn't overdone or underdone, and the characters all feel like people from a real world stuck in a game for a long time together. It also makes sense that they're all there.\n\nPlot: The premise is not made of solid gold, but it's interesting enough to lend itself to greatness. If you die in the game, you die for real no quitsies. This has been done before in fiction, of course. However, SAO takes a different treatment of this premise. Normally, you would see horror, like in a show like Gantz, applied, or game aspects, such as in No Game No Life. \n\nSAO's goal is rather to show that a virtual world can be real and fulfilling. Its creators accomplish this by focusing not on the MMO aspects, which are limited to flavor, but rather on the interaction between strong characters and the tension of being trapped within this scary world. The story itself lends itself to a rich world, and the writers take advantage of the larger arc to fit in almost a dozen sub-arcs in 24 episodes. The show is *very* story dense for an anime; normally, a single sub-arc would take 4-6 episodes. These sub-arcs balance developing the world, fighting, and building relationships. The characters build on their strengths and flaws and often find themselves in situations partially crafted of their own making. (Example; Asuna is hard on her guild and pushy, and this results in a poor culture within the guild that causes problems as the series develops.) There are no unbelievable moments.\n\nIn the end, the heroes triumph, but it's not a boring triumph. They often sacrifice during the show and make many mistakes that weigh upon them. At the ending bar scene, you can feel the air of both relief and regret washing over all of the former players.\n\nAt the symbolic level, SAO is very symbolic of life itself. God puts us on this plant, and we don't get to leave unless we die. So we adapt to it and live in it, the same as in SAO's virtual world. This allegoric story pairs well with the show's many slice-of-life scenes, creating a very vibrant and real-seeming virtual world.\n\n**Writing:** SAO does not waste time or words. No episode is filler, and each main character is multi-dimensional and arrives naturally in the main story arc. Characters do not break character. Villains are villains. Episodes are succinct and *excellently paced.* This show is so clean that you can eat off of it.\n\n**Art:** The art direction is superb. Each character's outfit is suitable for their personality and status. Motion and combat is more fluid and direct as well as it was in Fate: UBW and other highly regarded similar shows. It was smoother than classic epics like Record of Lodoss War and Gurren Lagann or modern releases like Arslan. Admittedly, it probably had a bigger budget than those shows, but that shouldn't be a detracting factor at all. The only *fantasy world* anime I would give a higher regard to in art direction is Berserk, but in quality of animation, SAO crushes Berserk.\n\nThe only complaint you could make in the art department is that the show wasn't stylized enough to differentiate it from other fantasy anime.  For instance, the art direction in Kill la Kill was an incredible thematic rush of color with awesome hand-painted backgrounds. I'll grant that point, but can you name a fantasy anime with a better quality of animation offhand?\n\n**Avoids Most Awful Anime Pitfalls:** Fanservice, chibi conversations, people falling off of park benches or turning into paper; these are the marks of an anime breaking the fourth wall and ruining suspension of disbelief for the view. In short, they're signs that an anime doesn't take itself seriously. Almost no anime of any level of notoriety, excluding comedies, uses these generic tactics.\n\n---\n\n**Arguments Against**\n\n&gt; Overpowered Main Character\n\nThe story follows Kirito, a regular guy with some Kendo training and beta test experience in an online game. Kirito earns almost all of his levels solo and is on par with the very best fighters in the game. He starts off with an advantage due to his experience, gets full exp. for the very first boss, and grinds pretty much every day from there on out to stay on top of the curve. He clearly earns his main character slot through a number of trials instead of being handed it by the divine will of the writers, such as in every other anime ever. He is given a unique skill, eventually, which is powerful, but it's relatively balanced because it's difficult to use. His backstory and skillset are reasonable, and given that there must be a \"best\" among all the players, it makes sense that the show would follow him.\n\nMeanwhile, in How to Pick Up Girls in a Dungeon, the main character is literally given a skill that says \"become overpowered against things you can't beat.\" It's shit like that which makes me want to throw my laptop.\n\n&gt; Dumb Plot Moments\n\nIn the first or second episode, another beta tester dies in Kirito's arms not because he was defeated, but because he turned down a potion. That guy was obviously a fuckin' idiot, and that scene could have been saved if he had just drank up and laid there. This is a fair criticism. Additionally, the army guild unit that marches in to fight the minotaur boss half dead is also made of retards. However, it's noted in the show that the reason they do this is because the army has been terrorizing its members. However, those deaths serve a purpose within the show and are not overtly distracting. The dumb beta guy's death serves to inspire Kirito to action and turns him into the MC. The dumb army guys are, much like the group that runs into the trap room early in the series, there to set Kirito on the right path and force him into action.\n\nIn the meantime, how will you excuse characters like Faye Valentine in one of your favorite anime, Cowboy Bebop? She's just there to be a plot instigator with a pair of giant boobs. Almost. Entirely. Fanservice. Many other very good anime have done much much worse with their cast and still rank top 50. Hell, Hajime no Ippo is fan ranked 20 on MAL, and although I won't disagree that the show is awesome, it's just following the formula of a hundred other sports anime shows like Prince of Tennis. OWARI NO SERAPH is even up there, and that show literally only has one redeeming character -- who isn't in most episodes. Hell, characters are invented out of thin air and people do dumb shit in Game of Thrones every other episode. Are you really going to say that SAO's weak point is a few serviceable plot blunders and side characters that didn't think through some obvious mistakes?\n\n&gt; You didn't like the ending\n\nThe ending probably irked a few of people because it was so sudden. However, that's really the magic of the series. It's a virtual world controlled by a nutty, manipulative scientist-god whose purposes are unknown. That's the driving mystery behind every episode. Why are they even there? Why is the NPC planted in the guild as the final boss? Why is the psychologist AI disabled?\n\nWithout that underlying tension, the series doesn't take shape. The story is about human actors making intense decisions, and the elusive creator adds another layer to the conflict. It makes the story feel bigger than it is and every victory seem hollow. This in turn allows our main characters to keep driving forward.\n\nPlus, they've already put in so many boss fights. I thought the defeat of the technically invincible guild leader was an awesome way to end, although it's obviously hedging a sequel.\n\nI'm tired of typing, so I won't bore you with more examples. Although I really wish they had done much more with the sequels, I believe the original series ranks among the best-produced, best scripted, cleanest, most heartfelt Anime of all time. I look forward to your spirited replies.\n\n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "Deezl-Vegas",
    "num_comments": 47,
    "created_utc": 1436192486.0,
    "url": "http://www.reddit.com/r/changemyview/comments/3cayqx/cmv_sword_art_online_is_one_of_the_best_anime_of/",
    "comments": [
        {
            "name": "t1_cstu94m",
            "parent_id": "t3_3cayqx",
            "body": "&gt; Plot: The premise is not made of solid gold, but it's interesting enough to lend itself to greatness. If you die in the game, you die for real no quitsies. This has been done before in fiction, of course. \n\n[Done to death](http://tvtropes.org/pmwiki/pmwiki.php/Main/TheMostDangerousVideoGame), pun intended.  In addition to anime, there's things like Tad Williams' *Otherland* series and, *Fate/Extra* and, of course, *The Matrix*.\n\n&gt; However, SAO takes a different treatment of this premise. \n\nI'm not clear on how SAO's premise is different.  You say that there's less focus on horror (meaning violent death?) or on gaming aspects, but that's the case for many of the other stories that use this idea.  What you're left with is \"people from contemporary Earth are transported to a sword-and-sorcery world\", which is [even more cliche](http://tvtropes.org/pmwiki/pmwiki.php/Main/TrappedInAnotherWorld).",
            "author": "jfpbookworm",
            "created_utc": 1436194325.0,
            "replies": [
                {
                    "name": "t1_csuck5d",
                    "parent_id": "t1_cstu94m",
                    "body": "SAO takes a different treatment because it doesn't focus on the battle aspects of being trapped in a sword an sorcery world. Rather, it focuses on the characters and their development as people.",
                    "author": "Deezl-Vegas",
                    "created_utc": 1436223471.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cstvbko",
            "parent_id": "t3_3cayqx",
            "body": "I could not make it through the first season because the characters are so poorly written. Generally of all the characters I saw in it only the male characters have any agency over their own actions. All of the characters were standard trope or cliche characters. The awkward loner, the noble charismatic guy, the shy helpless female etc.\n\nThe whole show is just a pathetic teenage boy fantasy, where the weird loner finds a girl that follows his directions while he becomes a great hero. \n\nA friend later told me that they fixed this issue in season 2 so I watched some and they did not. \n\n\n\nAs a note I'm a male who values good writing and SAO did not have it.",
            "author": "amazingmrbrock",
            "created_utc": 1436196254.0,
            "replies": [
                {
                    "name": "t1_cstvlvt",
                    "parent_id": "t1_cstvbko",
                    "body": "I agree with this.  I gotta add.  I saw the title of the CMV post and I really thought it was a troll.  But the dude seems serious.  How can you consider SAO best anime if you've watched any other anime?\n\nJust off the top of my head I would like to recommend OP these:\n\nDeath Note, Gurren Lagann and hell, I would place Log Horizon above it.  Log Horizon has a similar premise to SAO.  In my list of anime watched, I would place SAO smack dab in the middle or slightly lower.  I certainly wouldn't watch it again.",
                    "author": "vincentkun",
                    "created_utc": 1436196742.0,
                    "replies": [
                        {
                            "name": "t1_cstwvof",
                            "parent_id": "t1_cstvlvt",
                            "body": "Thats without even getting into classics like trigun, ghost in the shell, cowboy bebop, or full metal alchemist: brotherhood.",
                            "author": "amazingmrbrock",
                            "created_utc": 1436198886.0,
                            "replies": [
                                {
                                    "name": "t1_csudcox",
                                    "parent_id": "t1_cstwvof",
                                    "body": "I think SAO is close to on par with FMA: Brotherhood. Not quite on par. Thus, the post.",
                                    "author": "Deezl-Vegas",
                                    "created_utc": 1436224881.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "name": "t1_csudbri",
                            "parent_id": "t1_cstvlvt",
                            "body": "*Get the fuck out of here with Log Horizon.* First of all, it's an obvious SAO ripoff. It has all the problems of SAO with none of the strengths. None of the characters are remotely endearing, and the MC's main crew is overpowered as fuck to the point of writing a note to make someone a human. The villains are generic MMO monsters or extremely stupid and obvious player characters, and they even introduced a tentacle calculator monster that can manipulate the rules of the game in one of the second season episodes. Also every girl is literally hentai level fanservice.",
                            "author": "Deezl-Vegas",
                            "created_utc": 1436224836.0,
                            "replies": [
                                {
                                    "name": "t1_csvoszg",
                                    "parent_id": "t1_csudbri",
                                    "body": "Isn't SAO an obvious .hack ripoff?",
                                    "author": "naiyucko",
                                    "created_utc": 1436318400.0,
                                    "replies": [
                                        {
                                            "name": "t1_csvpb1q",
                                            "parent_id": "t1_csvoszg",
                                            "body": "Yeah but in fairness, .hack was a snoozefest.",
                                            "author": "Deezl-Vegas",
                                            "created_utc": 1436319305.0,
                                            "replies": [
                                                {
                                                    "name": "t1_csvrg7x",
                                                    "parent_id": "t1_csvpb1q",
                                                    "body": "So how can Log Horizon be a ripoff of SAO if SAO itself was a ripoff?\n\nPersonally I think Log Horizon was a snoozefest but was still leagues better than SAO. That's probably just because I enjoyed watching the tactics and mystery of Log Horizon unfold more than I enjoyed watching the forced harem of the beta/clueless MC in SAO though. ",
                                                    "author": "naiyucko",
                                                    "created_utc": 1436323056.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cstvopg",
                    "parent_id": "t1_cstvbko",
                    "body": "Nearly all anime relies on well defined tropes. Its kind of a genre, thing (exceptions abound, of course, but they're still exceptions). \n\n&gt; the shy helpless female etc...weird loner finds a girl that follows his directions\n\nAsuna is a noob, and admits it before they fight the first boss. So she will naturally follow his lead. Shes also his partner in the fight, so following his directions is paramount to victory (see \"leeeeee royyyyy jenkins!!!!!\" for what happens when some idiot does his own thing in a fight). They part after that fight and she goes on to become among the most powerful characters in the series, completely independent of the \"lone weirdo\". \n\nNot saying SAO is flawless, but I think you may have prejudged it a tad. ",
                    "author": "thekarateguy",
                    "created_utc": 1436196880.0,
                    "replies": [
                        {
                            "name": "t1_cstwos9",
                            "parent_id": "t1_cstvopg",
                            "body": "But then at the start of season 2 she was recast as helpless imprisoned female. \n\nAlso since I haven't watched that far I will ask; in season one after she leaves is another weak female character placed into the protagonists orbit?",
                            "author": "amazingmrbrock",
                            "created_utc": 1436198549.0,
                            "replies": [
                                {
                                    "name": "t1_cstx7qd",
                                    "parent_id": "t1_cstwos9",
                                    "body": "Understand that this anime is set in a level-based MMO game. So he goes through a series of side quests where he's going after monsters way too challenging for either himself or his companions. And in several places either Asuna, or one of his other female companions (including a 6 yr old girl), saves his sorry ass from being killed. \n\nAnd while Asuna was placed in captivity in season 2, the lead female role was replaced by Kirito's sister, who is in no way helpless at all, who [SPOILER] saves his life at the end. \n\nFinally, in season 3 (the gun-game), he teams up with a sniper-girl suffering to overcome her PTSD. \n\nBasically, I'm trying to say that the notion of female disempowerment in the SAO argument is rooted in (1) a misunderstanding of common anime and MMO video game themes and mechanics and (2) ignoring all the counter examples. \n",
                                    "author": "thekarateguy",
                                    "created_utc": 1436199443.0,
                                    "replies": []
                                },
                                {
                                    "name": "t1_csuddim",
                                    "parent_id": "t1_cstwos9",
                                    "body": "Yeah, they sold out hard.",
                                    "author": "Deezl-Vegas",
                                    "created_utc": 1436224921.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cstvpcf",
                    "parent_id": "t1_cstvbko",
                    "body": "&gt; A friend later told me that they fixed this issue in season 2 so I watched some and they did not\n\nHaha season 2 was even worse with the inclusion of the cousin/sister... what show were they watching?",
                    "author": "CombustionJellyfish",
                    "created_utc": 1436196911.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cstvlmi",
            "parent_id": "t3_3cayqx",
            "body": "I thought SAO was fairly enjoyable and I quite liked the first 3 or so episodes, but \"one of the best of all time\" is a high bar to set.  So I'll add to your arguments against to explain why I think the story is weak (I'd do a con of your writing pro but my issue has nothing to do with the pacing).\n\nEssentially pretty much every piece of major plot tension is resolved simply through Deus Ex Machina (sometimes literally), random powerups, or just magic \"power of friendship / love\" nonsense.  Nothing really feels like it is resolved by the characters, it's always some weak plot device.\n\n* Boss fight giving them trouble? Oh Kirito will just pull out a random sword move that has never before been seen.  With a skill set that was literally handed to him by the machine.\n\n* Confronted by player killers? Ha, of course Kirito is literally immune to any danger they pose.\n\n* Kirito paralyzed? Oh look Asuna, magically appears out of nowhere just in time.\n\n* Boss monster even Kirito can't defeat? Good thing the daughter that showed up the previous episode is an immortal object.\n\n* Oh no, Yui is being deleted?  Don't worry, Kirito can instantly \"hack the gibson\" on a terminal he just found out existed 30 seconds ago to save her as an in-game item.\n\n* Kirito losing the final duel? Asuna magically breaks the paralysis.  (Even the BBG notes how silly this is.)\n\n* Kirito goes on to lose the final duel? Eh, no matter, he can phase back in and get one last jab in, which happens to completely drain the BBG's health despite the long established damage rules.\n\n* Oh but Kirito lost Asuna?  No worries, she alone gets to be the only non-clearing player to be defeated but not executed by the NerveGear.\n\nIt's a long list for a run of just 25 episodes, and it burns out all the tension in the story.  Basically, nothing after \"The Red-Nosed Reindeer\" can get the viewer excited because *of course* some random thing is going to happen to save the day.  The end result is that even the ending duel, in which the viewer sees the two main characters *die* is ruined because by that point the viewer should know deep down that *of course* some random bs is going to win the day.",
            "author": "CombustionJellyfish",
            "created_utc": 1436196729.0,
            "replies": [
                {
                    "name": "t1_cstvpqw",
                    "parent_id": "t1_cstvlmi",
                    "body": "Indeed, SAO was fun for a watch.  Not something I would place on my top ten.  Let alone best anime ever.\n\nOP seems like he doesn't watch much anime as he himself admits.  Maybe he should watch some others like Death Note off the top of my head.  That one is leagues ahead of SAO.",
                    "author": "vincentkun",
                    "created_utc": 1436196929.0,
                    "replies": [
                        {
                            "name": "t1_csud246",
                            "parent_id": "t1_cstvpqw",
                            "body": "Don't underestimate me! **GURREN LAGANN! SPIN ON!**\n\nAnyway, all I said was that it deserved a spot in the top 50. Death Note is probably better, but the jumps of logic in that show and the fufufufufufufu asides ruined it for me.",
                            "author": "Deezl-Vegas",
                            "created_utc": 1436224362.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_csud522",
                    "parent_id": "t1_cstvlmi",
                    "body": "I think this is very fair and I see what you and many more people saying. These are the elements that break the suspension of disbelief for many of the fans. I still think it's a top 50 anime, but I can see why that's just my opinion: I'm ignoring a little too much deus ex machina. ∆",
                    "author": "Deezl-Vegas",
                    "created_utc": 1436224506.0,
                    "replies": [
                        {
                            "name": "t1_ct9u4yk",
                            "parent_id": "t1_csud522",
                            "body": "Confirmed: 1 delta awarded to /u/CombustionJellyfish. ^[[History](/r/changemyview/wiki/user/CombustionJellyfish)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][/r/DeltaBot]",
                            "author": "DeltaBot",
                            "created_utc": 1437410292.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cstvm0f",
            "parent_id": "t3_3cayqx",
            "body": "For an anime to be *one of the best of all time,* it needs to stand out in an extraordinary way. What you've said is basically \"the voice acting is good but not extraordinary, the plot is good but not that good, the art is really good but still bested by other anime, it avoids most major pitfalls...\"\n\nWhat makes this anime *fantastic?* what makes it stand out above everything else? What makes it *unique?*\n\n---\n\nA side note: I would warn you against using an anime's Netflix ratings to determine how great it is. Critic ratings and similar are probably much better.\n\nWhen a Netflix watcher rates a series low, it's because they personally didn't like it. Remember that Netflix gives you suggestions based on your ratings of previous movies. It actually has a message that says \"did you like this? If so, give it lots of stars and we'll suggest more similar!\n\nI watched about 3 episodes perhaps a year ago. I hated it. I was expecting a shonen story with lots of interesting fights and battles. Instead, I got so much chat, development of relationships, and tearful good-byes, and so little *fighting,* that I thought I had stumbled into a gay romance anime.\n\nNot that there's anything wrong with gay romance anime. But I don't like them, I don't want Netflix suggesting them to me, and so I gave it a low rating and moved on.",
            "author": "warsage",
            "created_utc": 1436196747.0,
            "replies": [
                {
                    "name": "t1_csu57ld",
                    "parent_id": "t1_cstvm0f",
                    "body": "It was the 12 year old girls version of berserk for me. The difference being in SAO everything works out perfectly, they have an extreme amount of unnecessary romance, and the MC is literally infallible (ya guts was OP but he was beatable/beaten). ",
                    "author": "korkyshadow",
                    "created_utc": 1436211712.0,
                    "replies": [
                        {
                            "name": "t1_csu5ohr",
                            "parent_id": "t1_csu57ld",
                            "body": "&gt; guts was OP but he was beatable/beaten\n\nOh great, now I'm trying to think of when Guts was beaten. ...\n\nGriffith beats him right at the start. K, there's one...\n\nGriffith beats him again later. K, there's two...\n\n...\n\nNope, can't think of any more. Well, he's lost twice at least!",
                            "author": "warsage",
                            "created_utc": 1436212429.0,
                            "replies": [
                                {
                                    "name": "t1_csu7lg5",
                                    "parent_id": "t1_csu5ohr",
                                    "body": "The demon guy beat him. The commander guy was beating him until the demon guy gave him his sword. ",
                                    "author": "korkyshadow",
                                    "created_utc": 1436215360.0,
                                    "replies": [
                                        {
                                            "name": "t1_csu8gdo",
                                            "parent_id": "t1_csu7lg5",
                                            "body": "Oh yeah, Zodd did beat him once.\n\nThat random commander too, but only because his sword broke.\n\nGood memory.",
                                            "author": "warsage",
                                            "created_utc": 1436216670.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_csucz12",
                            "parent_id": "t1_csu57ld",
                            "body": "I guess that's fair. If you walk into an anime with a set of expectations and the anime doesn't meet them, you lose.\n\nThe MC isn't infallible at all and comes within an inch of losing his life several times within the show. Additionally, infallible MCs do not destroy a show, generally. (See above posts re: Gurren Lagann, etc.)\n\nAlso, lots of people die in SAO, including his party. It weighs deeply on the MC. Lots of things don't work out perfectly. But you're right that the main six or so are granted a fair amount of protection from the writer-gods.\n\nRemember, as viewers, we have an advantage over the writer. We know the hero can't die. It's a nearly impossible task for the writer to make a multi-episode hero character and kill him off in a meaningful way. Shows like Game of Thrones dodge this a bit because they are very adept at disguising who the true lead characters are. If you're walking into an anime directed at middle-high school boys expecting something else, you'll always walk out disappointed.\n\nPlus, you like the Matrix, right?",
                            "author": "Deezl-Vegas",
                            "created_utc": 1436224204.0,
                            "replies": [
                                {
                                    "name": "t1_csuebq5",
                                    "parent_id": "t1_csucz12",
                                    "body": "Yes but there is a tipping point and SAO and bleach go over it. At some point you stop thinking \"Hey i wonder if he will be able to get out of this!\" and you start thinking \"What random thing/person is going to save him this time...\". Matrix doesn't go past this point (very difficult for a movie to go past that tipping point though). Now I got spoiled and watched attack on titan and berserk before SAO so I didn't like the anime at all once the random marriage thing happened (before that point is was pretty damn good though). ",
                                    "author": "korkyshadow",
                                    "created_utc": 1436226608.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_csucp8f",
                    "parent_id": "t1_cstvm0f",
                    "body": "I think this point is probably the most convincing to me. ∆\n\nIt's not that I don't think SAO was an extraordinary example of its genre, but it's certainly not the work of art that several other \"best\" series are. It's quite close, I think, but you can't set it next to something like Akira on any of its levels.\n\nThat said, I do think it was fantastic and immersive, which is what I'm debating most.",
                    "author": "Deezl-Vegas",
                    "created_utc": 1436223721.0,
                    "replies": [
                        {
                            "name": "t1_ct9u3zb",
                            "parent_id": "t1_csucp8f",
                            "body": "Confirmed: 1 delta awarded to /u/warsage. ^[[History](/r/changemyview/wiki/user/warsage)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][/r/DeltaBot]",
                            "author": "DeltaBot",
                            "created_utc": 1437410250.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cstvqpn",
            "parent_id": "t3_3cayqx",
            "body": "I enjoyed SAO, but I don't think I'd call it the \"best of all time\". Better series IMO might be:\n\n- Cowboy Bebop\n- Samurai Champloo\n- Evangelion\n- Kenshin\n- Escaflowne\n\nTry out some of those titles when you get a chance!",
            "author": "thekarateguy",
            "created_utc": 1436196975.0,
            "replies": [
                {
                    "name": "t1_cstvvqx",
                    "parent_id": "t1_cstvqpn",
                    "body": "The list goes on and on, SAO is just mediocre compared with so many good anime.  Death Note, HunterxHunter, Gurren Lagann, Psycho Pass...  Just off the top of my head.  Those are absolutely better and more rewarding to watch than SAO.  ",
                    "author": "vincentkun",
                    "created_utc": 1436197207.0,
                    "replies": [
                        {
                            "name": "t1_csudgkr",
                            "parent_id": "t1_cstvvqx",
                            "body": "I would place SAO slightly above Psycho Pass, although PP does surpass it in art direction and premise.",
                            "author": "Deezl-Vegas",
                            "created_utc": 1436225069.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_csudfnz",
                    "parent_id": "t1_cstvqpn",
                    "body": "* One of (see title and OP)\n\nI've seen all of those except Escaflowne. Because that seems like a silly name. I'll add it to my list.",
                    "author": "Deezl-Vegas",
                    "created_utc": 1436225027.0,
                    "replies": [
                        {
                            "name": "t1_csuid2b",
                            "parent_id": "t1_csudfnz",
                            "body": "It is a weird title, but it is excellent even with the English dub. Give it about 5 episodes to really pick up. ",
                            "author": "thekarateguy",
                            "created_utc": 1436233885.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cstxqgz",
            "parent_id": "t3_3cayqx",
            "body": "I, too, thought that the series was great...that was only until episode 2. The character Kirito is, in my opinion, one of the least believable characters in anime history. Here are my reasons as to why SAO got the ratings it did and also the major reasons for most people who simply disliked this series:\n\n\n**Hype**\n\nFirst up, I'll give the reasons about why the show isn't rated and received well on MAL. Hype is the main reason for this. When this show was airing this was the anime people were talking about, similar to Attack on Titan, SAO had many reviewers talking about how great this show was and because of that, a lot of people (including me) had some degree of expectation about how good this would be. A lot of anime (in general) with good animation and art style tend to draw in larger audiences, and with larger audiences comes more and more dissappointments. \n\n**Believability**\n\nKirito the introvert gamer who likes to play games alone somehow managed to attract the core archetypes of every harem cast; Lisbeth the second tsundere who MC doesn't end up with, Silica the loli and Asuna the tsundere MC ends up with. Remember Kirito was an introvert gamer, yet he still manages to make three girls fall head over heels for him? (Silica more of a ''Oni-chan'' situation due to the nature of all token lolis). Kirito was a blatant wish-fulfillment character: he's the best in the game, can solo a game which is heavily based around being with a group and girls he meet are romantically involved with him one way or another. You even got the typical Harem MC perverted best friend...Klein!\n\n**Asuna**\n\nShe was a total badass in her first appearance against the Floor Boss and from then on it went downhill. She became quickly infatuated with Kiriot and became more of a Damsel in Distress which I felt was a waste of her character. She was the vice-commander of the Blood Knights and while thats a sign of her development, she became the fanservice go-to for the writer and ends up taking it easy at some cottage for quite a while, bringing me to my final point:\n\n**Fanservice**\n\nThis is common with many anime, but that's no excuse to SAO's fanservice. The top 10 anime on MAL feature little to non-existent fanservice ( Hunter x Hunter, Gintama and FMA). SAO turned characters with potential such as Asuna and transformed them into sexual objects that wish to have sex with fullfilment MC and appeal to the otaku part of the community.\n\n**Final few episodes**\n\nFirst off is the Asuna and Kirito married episodes which were a complete waste of time in the setting of a life-or-death game and instead of saving low level players lives or just in general helping them out so they can survive, they just spend time with each other. As the stronger players, its their responsibility to try and at least grind more mobs so they can become stronger and get out of the game faster. After the final fight, the villain says he forgot why the game even existed in the first place which was very unsatisfactory for many. This is all because Reki Kawahara, the writer, wrote SAO originally for an entry in a competition and exceeded the page limit which is the main reason why it was so rushed at the end.\n\n\nThere are so many reasons I can give as to why this didn't deliver and why its not one of the best anime ever, ranging from the exploration of the mechanics of the game to the dynamics between the different guilds and the politics (which surely would have come into play in a VRMMO setting). While the MAL newcomers like to pick on SAO due to the flaws that were mentioned many times, it isn't hard to see why SAO is rated so low.",
            "author": "takahashia16",
            "created_utc": 1436200291.0,
            "replies": [
                {
                    "name": "t1_csu0f6s",
                    "parent_id": "t1_cstxqgz",
                    "body": "I agree with each and every point.  If this doesn't convince him I doubt he plans to have his view changed.  If he considers SAO the best anime then that is fine, as long as he understands it's his opinion.  Even looking at things objectively (as you've shown) SAO falls behind many, many other anime.  So the ONLY way this anime can be one of the best is if you look at it subjectively, in which case, its up to the individual.",
                    "author": "vincentkun",
                    "created_utc": 1436204501.0,
                    "replies": []
                },
                {
                    "name": "t1_csuce4b",
                    "parent_id": "t1_cstxqgz",
                    "body": "Should hype really be factored into the end merits of a show? Give anything too much hype and it won't measure up.\n\nI think you give Kirito less credit than is due. He's shaped by the events in the game and ends up opening up quite a bit to the other players during the series. Sure, he's an identifiable character for gamer nerds, but as a regular nerd I was able to identify too. He's certainly a hero and certainly makes some hero gambles that should not work out for him, but that's the charm of the show. Remember that not even Klein can get through to him in their first few meetings. He's almost driven insane until he starts making friends.\n\nRegarding the believability aspects, how was Kirito setting a trap for PK players unbelievable? That's the arc where he met Silica, who literally dropped off the face of the earth after that. There was no \"harem\" in this arc; that comes later after they stabbed the show in the back for money. It seems to be a reasonable arc that some percentage of ten thousand players would turn out to be villains and that they would be hunted by the senior players. Why not let our hero do it? You mentioned guild politics as well. Why would they come up if we're following the solo player? And battle politics do come up several times during the show, so maybe you just weren't listening because you saw a few cute girls and assumed the show was just a fanservice?\n\nIn reality, there's an overabundance of men in the show. Kirito spends a lot of time interacting with a few girls and Asuna, so it feels girl-heavy, but an equal half of the main characters are guys. Again, until they stabbed the show in the back for money.\n\nAs you said, Kirito is meant to be a wish fulfillment character. But will you tell me you didn't like Gurren Lagann? Literally a viewer-age-group boy gets random energy powers and meets up with a beach babe with a sniper rifle. If he's stubborn enough, his power is infinite. That show has a huge amount wish fulfillment with many similar aspects and story arc themes to SAO. But I fucking loved that show and I cried when the ridiculously generic banana guy died. That doesn't seem to be a factor in show quality among the top ranked shows. Like I said, Ippo is apparently up there, and that show is basically Prince of Boxing.\n\nAs for Asuna and the fan service, I've watched the arc we're referring to just yesterday, (remember, the sequel ALO arcs are not included in this CMV) and I have to say that I must've missed what you're talking about. Asuna and Kirito *save each other* throughout the series, including in the final episode. Fanservice is extremely limited in the first SAO arc. I never felt like I was being coerced into being attracted to any of the characters, and even pervert friend Klein doesn't go overboard with it. I didn't see panties being flashed at the normal opportunities for panty flashing. He's much more the leader of his band of friends and a friend to Kirito than anything else.\n\nMeanwhile, as noted in OP, how do you defend Evangelion then? Or Bebop? Or Angel Beats? Or Game of Thrones? The tizznitties in those shows are out of control. The key is suspension of disbelief. If you let yourself be absorbed by the show a little bit, it works out perfectly.\n\nRegarding the final episodes, they certainly did feel rushed. If it's your view that that is a main flaw of the series, I will grant you it. Any series that you want to go on for another full season is a good series, is it not?\n\nWhen Asuna and Kirito get married, it's actually very important to the show and probably the best arc. First of all, they've been grinding the dungeon on the daily for over *two years.* They take one break and people get salty? I'm sorry, but aren't you being a bit demanding? The top guilds all play with a significant margin of safety, and anyone that's going to die likely isn't going to do it within a thousand-mile radius of the top floors. It's incredibly unlikely that Kirito or Asuna would be nearby to save them. And it's not like they've been the ones to solo clear every boss so far, either.\n\nThe series shows a little grinding and deliberately elects to hide the remainder. It's safe to assume that most of the time the characters aren't on screen, they're clearing dungeons. The show uses the time they spend out of dungeon to highlight its themes and motifs.\n\nMeanwhile, when the two main characters give up the daily grind, they are exchanging that short amount of in-game time for the fulfillment of a key theme: Kirito and Asuna aren't just players. They're *living* full lives within this fantasy world. This is a bit of fantasy fulfillment for gamer nerds, that you can have a MMO waifu and that it can be real, but given their reality, it's very reasonable for them to accept and go for happiness in the here and now.\n\nRemember, they're only up to floor 70 or so at the end of the show after two years. It's likely that they'll be grinding for another year or more at this point. A few weeks off doesn't hurt them at all. Moreover, it's a key plot arc where they meet, adopt, and save Yui, and it's actually fairly dense with combat and suspense and world-building, which is where you learn a lot about the world.",
                    "author": "Deezl-Vegas",
                    "created_utc": 1436223178.0,
                    "replies": [
                        {
                            "name": "t1_csutvbw",
                            "parent_id": "t1_csuce4b",
                            "body": "[I wrote a reply which exceeded the 10000 limit so I thought linking you to this video would be far better] (http://www.youtube.com/watch?v=3uON7ANNOi4). If you want my reply I have it all in a notepad file but I don't think you would need it after seeing this video. It brings up alot of the points that I have mentioned and far more and is structured very nicely so that you can see the individual breakdown of the series. It focuses on both the first part and the ALO arc but the ALO can be completely ignored as the first 36 minutes are about the first arc.",
                            "author": "takahashia16",
                            "created_utc": 1436264561.0,
                            "replies": [
                                {
                                    "name": "t1_csv5ef5",
                                    "parent_id": "t1_csutvbw",
                                    "body": "Certainly an interesting video, but a lot of what he talks about is explained just fine within the confines of the show. Simply put, you can't place an expectation of optimal action on the main character, and you can't keep putting yourself in their shoes. To me, it's almost evidence that you want to like Kirito more than you do. Additionally, a lot of people overestimate Kirito's power level; he's about on level with Asuna for the entire game. Notably in the Death Scythe fight, he can't handle the boss and needs to 2v1 it with Asuna. Additionally, Klein and others are around the same strength level but simply don't have Kirito's reflexes or resolve, which he's honed through being a solo player.\n\nHe mentions something something about a support network and players banding together, and they do (the Army for instance, and the blacksmith dude who spends all of his profits helping level mid-level players), and he just missed that because our protagonist plays solo and the show lightly touches on all of those aspects.",
                                    "author": "Deezl-Vegas",
                                    "created_utc": 1436288664.0,
                                    "replies": [
                                        {
                                            "name": "t1_csw1xe2",
                                            "parent_id": "t1_csv5ef5",
                                            "body": "That is true Kirito and Asuna took on Death Scythe together but really Kirito's dual wielding and newfound skill was what won the fight. Klein is not on Kirito's level in terms of strength, power or even battle-healing. IIRC Kirito has maxed out most if not all of his battle stats whilst Klein has decent to high-range stats. Not much of what he has mentioned has been explained in the actual series. I can't like Kirito because he never struggles to progress, he always screams his way out of everything and has never lost a fight. He breaks out of paralysis and saves Asuna, how did that happen? He destroys a boss monster because he's pissed off that his guild was wiped? I thought this was a group game? None of this can be explained because the writer made that fatal mistake. Top 50 anime don't make these core mistakes.\n\n\nSticking together is the best bet for every character in a group-based MMO but apparently Kirito is above that. Another question is how is Asuna's stats roughly lower or the same as Kirito's when she has been with an actual guild doing far more dungeons than what Kirito seemed to be doing?",
                                            "author": "takahashia16",
                                            "created_utc": 1436352885.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_csu1ujy",
            "parent_id": "t3_3cayqx",
            "body": "&gt; SAO does not waste time or words. No episode is filler, and each main character is multi-dimensional and arrives naturally in the main story arc. Characters do not break character. Villains are villains. Episodes are succinct and excellently paced. This show is so clean that you can eat off of it.\n\nThere's a ton of pacing issues I found with the first half. There motivations of the characters was not really compelling, lots of exposition was given when it could have been significantly condensed, there were odd dead spots in episodes and awkward conversation I didn't care about.\n\n\nSure, if you compare it to something like bleach, DBZ, or naruto it's pretty good, but try comparing the pacing to kill la kill and it looks horrible, or the dialog and condensed information of psycho-pass and SAO just falls short.",
            "author": "Bluezephr",
            "created_utc": 1436206651.0,
            "replies": [
                {
                    "name": "t1_csudi0e",
                    "parent_id": "t1_csu1ujy",
                    "body": "Only if you're expecting the MC to go to war every episode, I think. The show isn't about the battles so much as the people trapped within the world. A bit moralistic, I guess, but I found it more similar to Spice &amp; Wolf than I did to Kill la Kill.",
                    "author": "Deezl-Vegas",
                    "created_utc": 1436225136.0,
                    "replies": [
                        {
                            "name": "t1_csuz6nj",
                            "parent_id": "t1_csudi0e",
                            "body": "No not at all, Kill la kill was about battles, but you don't need combat for hood pacing. Psycho-pass is a better example of a show with very little in terms of combat, but the dialog and interactions were handled so much better. The pacing in both of those shows, in terms of the plot advancing was much better, and they explained their worlds in a much more interesting way.",
                            "author": "Bluezephr",
                            "created_utc": 1436278970.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_csu57h5",
            "parent_id": "t3_3cayqx",
            "body": "I could go onto a long essay on why I hate SAO, but I'm simply going to say this.\n\nAny anime which needs to rely on crap like Suguha, Sinon's ass, and that goddamned tentacle scene cannot be called the best anime of all time. Period. A truly great anime would be able to carry itself on the strength of its plot and characters, not rely on fanservice and harem crap like SAO does. ",
            "author": "Tsuruta64",
            "created_utc": 1436211706.0,
            "replies": [
                {
                    "name": "t1_csudikx",
                    "parent_id": "t1_csu57h5",
                    "body": "Totally agree dude. That's why I'm limiting it to the original arc.",
                    "author": "Deezl-Vegas",
                    "created_utc": 1436225163.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_csunb3m",
            "parent_id": "t3_3cayqx",
            "body": "I just wrote a big post and then realized you were only talking about the first arc :/. The first arc is pretty great but I feel a lot of potential was missed out on and I would put a lot of more expanded and complete . I know it is based on the light novel series but feel that the anime could use a western comic book style reboot/reimagining. The original light novel was written as a stand alone work and the author did not anticipate how successful it would be.\n\nThe reset would create an expanded anime in the setting of Sword Art online with an expanded focus (as in some episodes featuring Asuna and others without Kirito) that fills in the details of the over two year timespan of the over two year life of the game. So many things weren't explored enough like Kirito's beater status and people's negative perceptions of him, how Asuna's character developed to be so strong, the solidification of the Knights of the Blood Oath along with development and foreshadowing of Heathcliff's very important character, and making the game feel like more of a world overall. \n\nI feel if they did that and made it end when the game ended would allow it to contend as one of the greatest anime's all time. The anime right now suffered from not developing enough plot lines and from the way it is dragging on. ",
            "author": "LuckMaker",
            "created_utc": 1436243124.0,
            "replies": []
        },
        {
            "name": "t1_csuqreg",
            "parent_id": "t3_3cayqx",
            "body": "I only watched about ten episodes, so maybe my main critique becomes unfounded later on but from what I've heard I don't think that's the case. \n\n\nAs far as I'm concerned SAO is a decent show. Great fight scenes, good music, good production values. A good popcorn show but it doesn't do anything really unique or really make you think. Doesn't make it a bad show but it certainly isn't some unparalleled masterpiece. \n\n\n\nKirito is what drags the show down in my opinion. He is such a boring, lazy, utter wish-fulfillment character. He has virtually no flaws and can easily overcome every situation he's in whether it's because he's a really high level player or through sheer plot device 'power of the human spirit' bullshit as in the fight with the game's programmer. He's a super-cool 'lone wolf' badass, but also a super nice guy who will go out of his way to help people, and also every girl he meets will almost inexplicably fall in love him just by being in his presence and regardless of how kickass they were before they all go weak in the knees and suddenly can't do anything without their fucking boyfriend. \n\n\n\nIt's not a bad show in my opinion, but it doesn't do anything that spectacular. Setting the 'golden oldies' aside, I'd say a much better candidate for one of the best anime ever would be *Baccano!* There's a show that stands out with an interesting premise and a fantastic execution that makes it a goddamn masterpiece of storytelling.",
            "author": "BreaksFull",
            "created_utc": 1436252136.0,
            "replies": []
        }
    ]
}