{
    "name": "t3_34yo0h",
    "title": "CMV: The mutiny in Battlestar Galactica was justified.",
    "body": "**Obviously, spoilers below.**\n\nI'm watching BSG my first time through right now and just finished the mutiny arc, when Gaeta and Zarek were executed. The last three episodes, I've been sitting here and thinking to myself... I actually sympathize with most of the mutineers, except Zarek because of that scumbag move he pulled on the Quorum of Twelve.\n\nBut besides Zarek, doesn't it make perfect sense why people on the ship would revolt? Think about it.\n\n- The fleet has been desperately searching for a home for years now. Roslin and Adama explicitly promised the people that they had mystical visions from the Gods and would find a livable planet. Well, Earth turned out to be a bust. In the people's eyes, it's completely legit to think that Roslin was basically stringing them along fraudulently by pretending to be endowed with wisdom from the Gods. Not only is it heresy, it's a poor way to run a government and maintain a presidency.\n\n- There's a fucking Cylon baseship sitting right squat in the middle of the fleet. Imagine if you were a bunch of Jews hiding in the forest from the Nazis for several months, eating grubs to survive and having to deal with memories of SS officers murdering your mothers/spouses/babies back home. Then out of nowhere, a few SS officers (including a gas chamber operator) show up. They've angered their own leadership and are now on the run from the government. They offer you weapons as a peace offering and then ask that you make nice and happy with them. Who in the right minds would be okay with this? If I was a Jew in that group and my leader made a deal with the gas chamber operator, I would be pissed off beyond belief.\n\n- Admiral Adama seems to be considering the people's opinion less and less as time goes on. The latest situation was the last straw. When captains objected to having Cylons walk around and install upgrades on their ships, his response was essentially \"Fuck you, get in line\". And Roslin was too busy sitting around cooking dinner for the Admiral to actually, oh I don't know... do her duty as President and rally support for her cause.\n\nWith all that in mind, I was hoping that Gaeta would actually take control and do things different. Again, Zarek gets no sympathy from me. Having him onboard as a ringleader was one of the biggest mistakes the mutineers made. But everyone else seemed completely legitimate and justified.\n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "premeddit",
    "num_comments": 13,
    "created_utc": 1430847162.0,
    "url": "http://www.reddit.com/r/changemyview/comments/34yo0h/cmv_the_mutiny_in_battlestar_galactica_was/",
    "comments": [
        {
            "name": "t1_cqzcv2u",
            "parent_id": "t3_34yo0h",
            "body": "**It should be noted that I mostly agree with OP! But I'm going to debate what I can. Feel free to CMV on the points that OP and I agree on**\n\n\n_________________________________________________\n\nOkay, it has been a long fucking time since I watched BSG, but I'll try too debate your points directly from memory. Let me know if I fuck up plot points.\n\nI am reminded of the Julius Caesar qoute: \n\n&gt; If you must break the law, do it to seize power: in all other cases observe it.\n\nThe obvious corollary to this is that a revolt is justified if it is ethical and those in power are not.\n\n1) This is your strongest point.  Adama literally made up the Earth hoax to fuck with everyone. This is some serious bullshit. It reminds me of the scene in Animal Farm where the Stalin Pig (Napoelon?) is hunting around for the ~~Lenin~~ Trotsky Pig (forget his name) and he just makes up smelling Lenin Pig everywhere so all the other animals get antsy and support his policies and become more dedicated to him. (See: Anti-communist propaganda in the U.S.)\n\nIt's an excellent reason to overthrow Adama, he is the head of the military who is using lies to increase his own power. Fuck him.\n\n2) I can't agree with this one, someone else is welcome to CMV on this.  Sentiment of just because the Cylons did bad things in the past, it means they will do shitty things in the future isn't the greatest idea. If we are going to use the Nazi Germany metaphor, then we shouldn't have cooperated with the post-Hitler government. This is because IIRC, there was a faction of Cylons who thought that nuking the 13 Colonies was a mistake and they wanted to reverse this policy and co-exist with the humans. (Correct me if I'm mixing up story arcs here).\n\n3) The first part is good: \n\n&gt;Admiral Adama seems to be considering the people's opinion less and less as time goes on. \n\n&gt; [Roslin is to busy] do her duty as President and rally support for her cause\n\nCivilian oversight of the military has always been a fundamentally important part of our democracy and of the Colonial Democracy. \n\nIt **literally saved us from nuclear war** in the Cuban Missile Crisis, the Joint Cheifs wanted to strike first, the Admiral in charge of the blockade **refused to obey SecDef McNamara's orders to move the blocakde back** luckily for the world, it worked out (barely!). This all falls under abuse of power by the military and incompetence detrimental to the Democracy by the Executive.  \n\n&gt;When captains objected to having Cylons walk around and install upgrades on their ships, \n\nAgain, IIRC these cylons were trying to change and ally with the humans, Adama believed them, whether he was right to beleive them is another question, but that's a mistake of judgement, not an abuse of power.\n\n&gt; his response was essentially \"Fuck you, get in line\".\n\nDid he use martial law here? I can't remember.\n\n4) (Your Conclusion) \n\n&gt;Having him onboard as a ringleader was one of the biggest mistakes the mutineers made.\n\nCan't disagree with that, it's bad policy, tactical mistake. \n\n&gt;But everyone else seemed completely legitimate and justified.\n\nI would argue that they were certainly justified, and they believed that they were doing the right thing, matching Ceasar's qoute and my proposed colloquially .\n\n&gt; completely legitimate and justified\n\nStrong wording, opinion.\n\n",
            "author": "Lews-Therin-Telamon",
            "created_utc": 1430851503.0,
            "replies": [
                {
                    "name": "t1_cqze8zq",
                    "parent_id": "t1_cqzcv2u",
                    "body": "you got your animal farm wrong: it's trotsky pig not lenin pig!",
                    "author": "chicagofirefifa3",
                    "created_utc": 1430853649.0,
                    "replies": [
                        {
                            "name": "t1_cqzeafc",
                            "parent_id": "t1_cqze8zq",
                            "body": "Oh, duh, yeah.",
                            "author": "Lews-Therin-Telamon",
                            "created_utc": 1430853710.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cqzd37u",
            "parent_id": "t3_34yo0h",
            "body": "Okay this is an interesting one... yYou have to think of what it would be like from the eyes of a caprican soldier or a viper pilot (since I am an actual pilot).\n\nTo be honest if I was in their shoes I would be a mutineer as well, look at it from their point of view. You have been promised Earth so many times, the origional was a nuclear wasteland, your home and probably most if not all of your friends and family was nuked by the Cylons, the very people who Adama et al. are forming an alliance with, the president is claiming to be guided by supernatural forces considering she is terminally ill you would question whenever she is deluded completely, in the past Adama already had a quazi civil war with the Pegasus so he is probably perceived to be wasteful with human life etc. \n\nZarek is a Che Guevara type of figure, okay he is a terrorist but in extreme times people do extreme things \n\nSo if I was a run of the mill Viper pilot or something then heck I would be a mutineer, whats the worst that could happen, you die, are executed or are banged up in a cell its not a hard decision to make considering from your point of view you are going to die anyway. \n...................................................................................\n\n\nThat said here comes the very big but .. Humanity at this point heading toward extinction, the battestar their only real defense is falling apart at the seams.. I know Adama and the President have agreed to move to the Basestar but heck its their only chance, if the Cylons double cross them they are going to wipe out everyone but thats not a certainty. If they don't and considering the Battlestar will fall apart then the fleet is also screwed and that is a certainty. \n\nSo from their point of view they were stuck between certain extinction and a remote chance that the rebel Cylons actually were wanting to help them. The latter has a chance of finding Earth nomatter how small &lt;&lt;Spoiler&gt;&gt; . Also I don't think Gaeta was thinking rationally, his faith in Saul, Adama, Chief etc. was blown when they nearly airlocked him earlier not believing that he wasn't a double agent in New Caprica \n\n",
            "author": "EwanWhoseArmy",
            "created_utc": 1430851852.0,
            "replies": [
                {
                    "name": "t1_cqzhln1",
                    "parent_id": "t1_cqzd37u",
                    "body": "Whoa dude, spoiler's he's not finished watching!",
                    "author": "shogi_x",
                    "created_utc": 1430858830.0,
                    "replies": [
                        {
                            "name": "t1_cqzhq3f",
                            "parent_id": "t1_cqzhln1",
                            "body": "He said the last 3 episodes..... one of which is this story arc. \n\nHe worded it really badly ",
                            "author": "EwanWhoseArmy",
                            "created_utc": 1430859021.0,
                            "replies": [
                                {
                                    "name": "t1_cqzhty9",
                                    "parent_id": "t1_cqzhq3f",
                                    "body": "&gt; I'm watching BSG my first time through right now and just finished the mutiny arc\n\nHe meant the last 3 of the mutiny arc.",
                                    "author": "shogi_x",
                                    "created_utc": 1430859185.0,
                                    "replies": [
                                        {
                                            "name": "t1_cqzhyf5",
                                            "parent_id": "t1_cqzhty9",
                                            "body": "I got confused, the mutiny arc finishes right before the last 2 episodes",
                                            "author": "EwanWhoseArmy",
                                            "created_utc": 1430859378.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cqzdpbc",
            "parent_id": "t3_34yo0h",
            "body": "First off, let me state it's been a while since my last viewing, so forgive me if I mistake details.  That said-\n\n&gt;Well, Earth turned out to be a bust. In the people's eyes, it's completely legit to think that Roslin was basically stringing them along fraudulently by pretending to be endowed with wisdom from the Gods. Not only is it heresy, it's a poor way to run a government and maintain a presidency.\n\nThis is true, which is why real world politicians tend to not make grand promises of what they will accomplish, but rather what they will fight for- with no guarantee of delivery.  Her campaign was run purely on hopes and dreams, and more than a few politicians have seen the end of their careers when they failed to deliver those.  Failure of this magnitude is a justifiable reason to seek a change in president, regardless of how realistic the goal is.\n\n&gt;Who in the right minds would be okay with this? If I was a Jew in that group and my leader made a deal with the gas chamber operator, I would be pissed off beyond belief.\n\nThis is an illogical response, one born of emotion rather than reason.  Understandable, but not justifiable.  They are offering badly needed aid, that you arguably may not survive without.  It could be suicide to dismiss them, meeting them with violence could be costly, and trusting them explicitly would be unwise.  Therefore the rational solution is to accept their aid, but monitor them closely and limit their movement until you can be sure of their trustworthiness.  I believe that Adama satisfied these conditions in the initial standoff when they arrived.  Their interaction with the fleet was limited, and Galactica positioned itself with a lethal response ready at all times until their trust was earned by way of the testimony of trusted allies and deeds done by the Cylons.  Even then Adama was reluctant, but was pressed by circumstance to accept them.  Mind you, this is how they handled Athena when she returned with Helo.\n\n&gt;Admiral Adama seems to be considering the people's opinion less and less as time goes on. The latest situation was the last straw. When captains objected to having Cylons walk around and install upgrades on their ships, his response was essentially \"Fuck you, get in line\". And Roslin was too busy sitting around cooking dinner for the Admiral to actually, oh I don't know... do her duty as President and rally support for her cause.\n\nVery true.  At that point, their government bore little resemblance to a democracy and looked much more like a dictatorship, though I would argue this was necessary given the fragility of the fleet and responsibilities of its admiral.  Despite it's deeply negative stigma and undemocratic nature, martial law is not without its merits when used responsibly.\n\nNow here comes the part where I disagree with you- mutiny was not the answer.  I will admit that mutiny is a justifiable means in certain scenarios, but this was not one of them. \n\n* Firstly, Adama's actions were (mostly) neither unreasonable nor without their own justifications, which as I recall was communicated to the fleet.  His unofficial reign after Roslin's unofficial abdication was also very short before the mutiny, which was orchestrated by people with a long-standing grudge (Zarek and Gaeta).\n\n* Secondly, the primary spark was the presence of the Cylons who made every effort to be valuable to the fleet and nonthreatening.  As I said above, violent opposition to their presence was irrational.\n\n* Third, Adama and his loyalty had been proven multiple times at this point, having saved the fleet more times than anyone can count, and his judgement has proven sound throughout their years on the run.  The sudden change of opinion in the fleet was ignorant of this.  While it's not really reasonable to say he should never be doubted, it should have given far more pause than the colonists gave.\n\n* Finally, mutiny was a potentially self-destructive action.  Given the precarious position the fleet was in, a mutiny could have resulted in unnecessary loss of life (it did), loss of critical ships/resources/infrastructure, permanent damage to the survivability of the fleet and, by extension, the human race.\n\n**TL;DR**, Given the risks, Adama's track record, and irrational motivations, I find that while mutiny was not without cause, it was unjustified as a solution, especially above other options.\n\n-edit- words, etc.",
            "author": "shogi_x",
            "created_utc": 1430852794.0,
            "replies": [
                {
                    "name": "t1_cqzqih3",
                    "parent_id": "t1_cqzdpbc",
                    "body": "It's easy to judge the decisions made in the fleet from our point of view of continuity as stability, but when you consider the mindset of a few thousand people running throught the galaxy for their lives in the brink of extinction, you can see that they go through a very painful process that starts with denial and a strong drive to maintain political and social form, which slowly degenerates into a desperate fight not to simply vanish into the void. Powerful stuff.",
                    "author": "Anhanguera",
                    "created_utc": 1430874830.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cqzoi9c",
            "parent_id": "t3_34yo0h",
            "body": "I can't do better [than this](http://www.lawyersgunsmoneyblog.com/2009/02/why-tom-zarek-was-right).  We cannot trust the cylon.",
            "author": "cassander",
            "created_utc": 1430871031.0,
            "replies": []
        },
        {
            "name": "t1_cqzowcy",
            "parent_id": "t3_34yo0h",
            "body": "An issue I had with the revolt was motivation.\n\nZarek wanted nothing more than to be the top dog, regardless of any sort of vision for getting them home (as I recall...my only viewing of the series was as it aired).  \n\nBut more so than that, Gaeta had a personal beef with Gaius.  He went so far as to perjure himself at the trial, tearing down what should have been one of Gaius' saving bits of testimony in how he was directly and physically coerced by the Cylons and resisted them.  \n\nAs for the Nazi comparison, I see where you're coming from, but as a counter example, in South Africa, rather than hunting down anyone who had a hand in apartheid, they held the Truth and Reconciliation commission (or something to that effect).  You admitted what you did, and were let go.  Perhaps someone with more insight to it than I (as I read a book from a cardinal's point of view who was involved) can elaborate or refute if needed, but the healing process really started when people came forward and fessed up.  We see similar here, where the Cylons and the humans were able to find common ground and, as we saw, become stronger and greater for it.",
            "author": "Exctmonk",
            "created_utc": 1430871828.0,
            "replies": []
        },
        {
            "name": "t1_cr00gj5",
            "parent_id": "t3_34yo0h",
            "body": "I agree with most of your points, but I think cylons deserved a new chance. It was the humans that enslaved them and with a machine-cold logic it is understandable that the cylons would fear for their race and attack pre-emptively. When it was made clear that they can live together, they did. The cylons had re-settled the score with the bombardment, and humans broke the balance once again with the mutiny. But then again, I'm just a cylon sympathiser.",
            "author": "Redshirt_No3535",
            "created_utc": 1430897251.0,
            "replies": []
        }
    ]
}