{
    "name": "t3_30tvju",
    "title": "CMV:I should get PRK/Lasek Surgery",
    "body": "So I did read this that was published a month ago.\n\n[http://www.reddit.com/r/changemyview/comments/2vky2k/cmv_i_shouldnt_get_lasek_surgery/]\n\nBut I guess I am taking the opposite side of the fence this time. I have been contemplating about doing either a PRK or Lasek (both are very similar to each other) to correct my near-sightedness and astigmatism. And more conveniently, I saw a Groupon post to have it cost for $1,400, which is quite cheap.\n\nI am aware that there are some risks involved. You may experience your vision to worsen as you get older. In fact, many are required to get reading glasses, especially once they hit around 40. Night vision problems and eye dryness are also common symptoms, but these can be temporary and vary person by person.\n\n[http://www.groupon.com/deals/the-lasik-vision-institute-2-houston]\n\nCMV!\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "UngratefulPeon",
    "num_comments": 13,
    "created_utc": 1427737954.0,
    "url": "http://www.reddit.com/r/changemyview/comments/30tvju/cmvi_should_get_prklasek_surgery/",
    "comments": [
        {
            "name": "t1_cpvqonk",
            "parent_id": "t3_30tvju",
            "body": "Not a challenge to your main argument, but I would say don't go to a place because they have a Groupon, unless that's really the best LASIK provider near you. It's almost certainly not, and *laser eye surgery* is not something you want to cheap out on. Max out your FSA, get whatever insurance discount you can, check out Qualsight, but make sure you go to a well-reviewed place. $1400 is not *nearly* enough to pay for good, safe LASIK.\n \nEdit: I realized this is for Houston, and I have no idea what LASIK costs there. I've priced it in Boston and NYC, and it's much higher than that for anyone reputable.",
            "author": "FacelessBureaucrat",
            "created_utc": 1427738564.0,
            "replies": [
                {
                    "name": "t1_cpvrajb",
                    "parent_id": "t1_cpvqonk",
                    "body": "Thanks for the feedback! Laser surgery here is usually around $3,600 for both eyes. You are right that laser surgery is not something to go cheap on. For this particular location mentioned on the Groupon, it is apparently a corporation with many locations. At the end of the day, I am going to the place with the highest ratings and put my mind at ease, but cost is something that I will be mindful of. ",
                    "author": "UngratefulPeon",
                    "created_utc": 1427739535.0,
                    "replies": [
                        {
                            "name": "t1_cpvs3s5",
                            "parent_id": "t1_cpvrajb",
                            "body": "Well, since your eyes are priceless you probably *should* be mindful of cost.",
                            "author": "Pipstydoo",
                            "created_utc": 1427740811.0,
                            "replies": [
                                {
                                    "name": "t1_cpvw146",
                                    "parent_id": "t1_cpvs3s5",
                                    "body": "which is what I said.....",
                                    "author": "UngratefulPeon",
                                    "created_utc": 1427746974.0,
                                    "replies": [
                                        {
                                            "name": "t1_cpvyywn",
                                            "parent_id": "t1_cpvw146",
                                            "body": "",
                                            "author": "",
                                            "created_utc": "",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cpvuin9",
            "parent_id": "t3_30tvju",
            "body": "&gt;You may experience your vision to worsen as you get older.\n\nI have talked to a few specialist here about that and they said that this is a common misconception. While it is true your eyes will degrade from what they are corrected to this is simply part of ageing.\n\nFor example if you are 15/20 and the surgery corrects you to 20/20 when you are 30. When you are 45 your eyesight may have degraded to 15/20, but if you had not had the surgery it would be down to 10/20 (as an example). \n\nFollowup corrective surgery can bring your eyes back up to 20/20 after they have degraded again in the future with new techniques that are available.",
            "author": "Waylander0719",
            "created_utc": 1427744582.0,
            "replies": []
        },
        {
            "name": "t1_cpw2rcr",
            "parent_id": "t3_30tvju",
            "body": "As long as you are aware of the risks and have done the cost/benefit this is up to you. \n\nYou might want to avoid getting it done by the lowest bigger though. They are your eyes. ",
            "author": "Raintee97",
            "created_utc": 1427758358.0,
            "replies": []
        },
        {
            "name": "t1_cpw7l1b",
            "parent_id": "t3_30tvju",
            "body": "My vision has been 20/400 in both eyes since I was in the 4th grade. Non-eye Doctor tests consisted of \"Ok remove your glasses and read the smallest line you can from the chart\"  *removes glasses* \"What chart?\" I always said I was legally blind without glasses but I'm not entirely sure if that's true. \n\nAround 2003 (around 25-26ish)I was fortunate enough to get PRK surgery while I was active duty military at no cost to me. \n\nThe day of my procedure they gave me a valium and a percocet and told me to have a seat. 30 min later I'm brought into the procedure room and put into place on the bed thing and they use a paperclip looking thing to hold your eyelid open. \n\nThe laser did it's thing (it was described to me as basically carving a contact lense prescription onto your cornea?) for 28 seconds in one eye and 31 seconds in the other. I had to stare at this red dot the whole time it was working and if I looked away from it the laser would stop automatically until I looked back at the dot. After it was done they put a pair of contact lenses in that had almost no correction.  All in all I was in the procedure room for about 15-20 min. \n\nI left that room and was given a full vision test and I had uncorrected vision that was 20/30 (with the protective contacts of course).  I was sent home and told to take the remaining valium and percocet when I got there. (that was a fun night!!) all in all I was there under 2 hours. \n\nI came back the next day and my vision was 20/20. I came back 2 weeks later and they removed the contacts and I was 20/10. I had gone from basically blind to better than perfect vision in 14 days. \n\nI am now 37, and although I was told I'll most likely need reading glasses after 40, I'm not there yet, the last time I was checked (around 2010) I was still 20/10 and the doctor told me that if I hadn't told him that I'd had PRK he never would have been able to tell. I had absolutely no signs of surgery at all. I've never experienced any of the typically known side effects and I consider it the single most positive life changing decision I've ever made.  10/10 would recommend. \n\nTL;DR: You should do PRK if you can afford a good doctor. ",
            "author": "jrafferty",
            "created_utc": 1427766348.0,
            "replies": [
                {
                    "name": "t1_cpwa7o2",
                    "parent_id": "t1_cpw7l1b",
                    "body": "How long did it take you to recover? I was told it could take up to 5 days.",
                    "author": "UngratefulPeon",
                    "created_utc": 1427770693.0,
                    "replies": [
                        {
                            "name": "t1_cpwaiv3",
                            "parent_id": "t1_cpwa7o2",
                            "body": "Define recover. \n\nIf it weren't for the sedative and pain killer I could have driven myself home from the procedure if I had to (they would never allow this lol). The drugs kept me comfortable that 1st night and those were all they gave me. The next day it felt like my eyes had a sunburn and had some grit in them. Kinda sore and irritated but nothing overly harsh (I'd peg it at a 5 or 6 on a scale to 10).  I was fully functional and had clear vision. The pain went away little by little every day and I think I was back at work 72 hours after the surgery IIRC. ",
                            "author": "jrafferty",
                            "created_utc": 1427771236.0,
                            "replies": [
                                {
                                    "name": "t1_cpwatdf",
                                    "parent_id": "t1_cpwaiv3",
                                    "body": "Well I was told that after the surgery you should pretty much just lay in bed and don't expose your eyes to light. And take drugs as prescribed. \n\nI would say when you able to go back to work and finally have that vision clarity, you're done recovering.",
                                    "author": "UngratefulPeon",
                                    "created_utc": 1427771731.0,
                                    "replies": [
                                        {
                                            "name": "t1_cpwb1en",
                                            "parent_id": "t1_cpwatdf",
                                            "body": "",
                                            "author": "",
                                            "created_utc": "",
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cpws29p",
            "parent_id": "t3_30tvju",
            "body": "LASIK is a much cheaper and easier procedure than PRK. For that reason cheap providers will push you towards LASIK because they usually don't do PRK. This is a problem because not every person is suited to LASIK. In my case, I have \"gigantic\" pupils and after consulting with a dozen different professionals I eventually went with the most expensive, Stanford Laser Eye Center, who performed less common procedure called \"LASEK\" (combines  elements of LASIK and PRK). I was one of the first people in the USA to get this procedure. I'm glad I did, because I had fairly severe side effects (halos, dramatically reduced night vision) that would have been worse with LASIK.\n\nNote that I was an edge case. My vision in one eye was 20/1800 and the other 20/2000 (those aren't typos), I was completely blind without glasses and even with glasses I was still legally blind. I couldn't see well enough to drive, for example \n\nCost was a non-issue for me as I was already spending $1000-$2000 each year on specialty eyeglasses. \n\nThe recovery on my procedure was much longer and harder than is typical. 4 weeks (during which I was completely blind). I was given a high dose of dilaudid, synthetic heroin, because the healing process makes your eyeballs itch and this is so maddening you'll literally claw your eyes out if you aren't heavily medicated. I was living at home at the time and my parents were able to care for me. My vision stabilized at around 20/20. \n\nWas it worth it? Absolutely. Now I don't have to worry about being totally helpless if my glasses get damaged or lost. I once spent an entire day (24 hours) crawling on my hands and knees trying to find a pair of glasses that had fallen off in a patch of ivy. \n\n",
            "author": "rtechie1",
            "created_utc": 1427818680.0,
            "replies": []
        }
    ]
}