{
    "name": "t3_3ifutq",
    "title": "CMV: There is no misogynist agenda surrounding Carolyn in American Beauty",
    "body": "I just watched American Beauty after many years of managing to somehow avoid it and I thoroughly enjoyed it. Stupidly, after watching I decided to take to the internet and I managed to piss myself off by reading about the apparent misogynist/sexist agenda of the movie. \n\nLet me begin by explaining the movie as I understand it. I believe that at its core, American Beauty is a cautionary tale about complacency, and placing responsibility for happiness in the hands of others. Every main character embodies this in a different way, and by failing to have agency. \n\nLester - Has, over a long period of time leveraged his time and energy to afford things he no longer has the drive to use. He craves what he lacks: drive, energy, youth. \n\nCarolyn - Has, over a long period of time leveraged her beauty and sexual aggression for productivity and image. She craves actual success and fulfillment.\n\nJane - Sacrifices normalcy for attention. Craves love.\n\nAngela - Sacrifices personality for status in the form of physical beauty. Craves the abnormal. \n\nAll of the characters do what everyone misguidedly  does when they want something. They try to reach out and grab it. Lester wants youth and drive so he tries to reach out and grab it (Angela). Carolyn wants success so she tries to reach out and grab it (The King). Angela wants to be seen as extraordinary so she flirts with Lester who clearly thinks she is. Jane wants to be loved so she seeks out Ricky who seems to love her.  \n\n The foil to this idea is of course Ricky, a character who ironically maintains his agency throughout the film, making himself happy by *doing nothing*. He sees what he wants and he patiently engineers a situation where what he wants comes to him.\n\nThe time in which the characters truly find themselves happy is the pursuit of these ideals. Just running with the example of Lester, we see him smoking pot, quitting his job, buying the car he wants, listening to music he likes in an effort to become cool again so that Angela will have sex with him. What he doesn't realize until the very end is that it's being a pretty cool guy that's actually making him happy in the first place. All of the character arcs are similar to this. It's not what they want that makes them happy, it's possessing agency again. \n\nFor each character their direct counterpart is perceived as the thing that's making them unhappy. If Jane could just be more normal. If Carolyn could just stop being so controlling. If Lester didn't need Carolyn to do everything for him. If everyone would just care about Jane instead of themselves even for a second. Things would be better.\n\nI've said a lot but what I'm really trying to get at is that the characters in this film are all extremely congruent to one another in a way that transcends age, sex, and even primary goals and motivations.\n\nThe chief argument toward the sexism of the film is the presentation of Carolyn as controlling, but I don't believe this is what the viewer is meant to conclude just like I don't believe the viewer is really supposed to see Lester's complete regression to his teenage years as a victory. I feel as though Carolyn's \"shitty elevator music\" is meant to be the same as Lester's annoying rock music.    \n\nHowever,  this does not seem to be the way that a vast majority of people interpreted the film. What is so bad about the presentation of Carolyn's character? I actually really liked her.     \n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "marlow41",
    "num_comments": 3,
    "created_utc": 1440574046.0,
    "url": "http://www.reddit.com/r/changemyview/comments/3ifutq/cmv_there_is_no_misogynist_agenda_surrounding/",
    "comments": [
        {
            "name": "t1_cug1tvq",
            "parent_id": "t3_3ifutq",
            "body": "this one?\n\nhttp://decider.com/2014/09/08/american-beauty-15-years-later/",
            "author": "forestfly1234",
            "created_utc": 1440575937.0,
            "replies": [
                {
                    "name": "t1_cug20h2",
                    "parent_id": "t1_cug1tvq",
                    "body": "There were actually a few, but yes that was maybe the one that annoyed me the most. ",
                    "author": "marlow41",
                    "created_utc": 1440576653.0,
                    "replies": [
                        {
                            "name": "t1_cug21tv",
                            "parent_id": "t1_cug20h2",
                            "body": "In that case, I don't got anything. That piece was a rag. \n\nGood luck",
                            "author": "forestfly1234",
                            "created_utc": 1440576801.0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}