{
    "name": "t3_3f4jwn",
    "title": "CMV: Tom Brady is guilty.",
    "body": "I've read the [20 page report released from Goodell.](https://nfllabor.files.wordpress.com/2015/07/07282015-final-decision-tom-brady-appeal.pdf) I've read [Kraft's speech.](http://profootballtalk.nbcsports.com/2015/07/29/robert-kraft-tees-off-on/) I've read [Brady's Facebook post.](https://www.reddit.com/r/nfl/comments/3f0m1w/tom_bradys_statement_via_facebook/) The entire thing seems like a sloppy attempt at a coverup.\n\nThe texts/phone conversations between the two equipment managers:\n\n1. One giving the other a \"heads up\" that his name came up in an interview with NFL Security.\n\n2. Multiple references to Brady's preferences of the PSI of game balls and of providing a needle for use.\n\n3. In the context of an exchange about the pressure of game balls, one said to the other that Brady \"actually brought you up and said you must have a lot of stress trying to get them done.\" Mcnally's only assigned responsibility regarding game balls was to deliver them. What is there to \"get done?\"\n\n4. One expressing anger with Brady states that \"the only thing deflating sun[day] is his passing rating.\"\n\n5. One refers to himself as \"the deflator\" and jokes about \"not going to ESPN ... yet.\"\n\n6. Multiple requests for autographed gear from Tom Brady.\n\n7. One says to the other \"I have a big needle for you this week.\" The response is \"Better be surrounded by cash and new kicks... or its a rugby sunday\". When asked about this message by investigators, Mcnally confirmed that the reference to \"rugby\" meant an over-inflated football.\n\n8. About a week before the AFCCG, one told the other it would be a \"big autograph day for you.\" Several days later, Brady signed 2 footballs and a game-worn jersey and handed them to Mcnally in the equipment room.\n\nBrady ordered his phone that had been used the past 4 months to be destroyed. Even though the phone was talked about in the investigation, he failed to tell them this until several weeks later. Brady says it is what he does with old phones when he gets a new one, but he gave NFL investigators an older phone before that. He was told his own lawyer could select the communications off his personal cellphone that were of interest to the league and send them those specific records, so the excuse of his personal privacy is irrelevant. He says in his recent Facebook post that his old phone was broken, but in the appeal he offered no explanation as to why his phone was replaced the exact day the investigators visited.\n\nBrady claims he does not focus on inflation levels, but he always requested his balls be inflated to the lowest legal level. He complained about over-inflated footballs in a previous 2014 game, and in an interview had said 12.5 PSI was \"the perfect grip for him\". His claim is a blatant lie.\n\nEDIT: Prior to the start of the game, Mcnally removed the Patriots' footballs form the Officials' Locker Room without informing or receiving permission from any of the game's officials, then he went to a small bathroom and locked the door even though he had access to the facilities in the Officials' Locker Room.\n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "Gunderik",
    "num_comments": 13,
    "created_utc": 1438233540.0,
    "url": "http://www.reddit.com/r/changemyview/comments/3f4jwn/cmv_tom_brady_is_guilty/",
    "comments": [
        {
            "name": "t1_ctl8trd",
            "parent_id": "t3_3f4jwn",
            "body": "I share your view, but I would like to point out:\n\n&gt;Multiple references to Brady's preferences of the PSI of game balls and of providing a needle for use.\n\nEven if Tom Brady prefers his ball pressure as low as legally allowed, which he should have mentioned in his appeal, he hasn't broken any rules. He can claim that he requested 12.5 PSI, and the equipment guys gave him 11.5, which is against the rules. Frankly, this is what he should have claimed all along, instead of pretending he doesn't know anything during the \"some guys like old balls\" press conference.\n\n",
            "author": "jt4",
            "created_utc": 1438234398.0,
            "replies": [
                {
                    "name": "t1_ctl8z65",
                    "parent_id": "t1_ctl8trd",
                    "body": "I agree, but I think if that were the case, that's the story he would have told.",
                    "author": "Gunderik",
                    "created_utc": 1438234785.0,
                    "replies": []
                },
                {
                    "name": "t1_ctlge42",
                    "parent_id": "t1_ctl8trd",
                    "body": "It doesn't matter if he had them deflate the balls to 13.5 psi.\n\nWhat matters is that he was encouraging the managers to alter the balls after the final referee approval.",
                    "author": "MrF33",
                    "created_utc": 1438260141.0,
                    "replies": []
                },
                {
                    "name": "t1_ctlguem",
                    "parent_id": "t1_ctl8trd",
                    "body": "But the balls were altered after officials checked them.\n\nThe complaint would have to be they filled them to 12.5 PSI and were approved then, unbeknownst to Brady, the equipment guys took it upon themselves to just further deflate the balls in the bathroom for no apparent reason.\n\nNo one outside of New England would believe that and he would be in the same mess. ",
                    "author": "[deleted]",
                    "created_utc": 1438261194.0,
                    "replies": []
                },
                {
                    "name": "t1_ctlhrww",
                    "parent_id": "t1_ctl8trd",
                    "body": "I just want to take this chance to point out how funny I find it, as a non-football-fan, that the Patriots fans have to spend most of their time defending the latest example of the Patriots cheating, rather than just enjoying football.  ",
                    "author": "scottevil110",
                    "created_utc": 1438263128.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_ctlmeq8",
            "parent_id": "t3_3f4jwn",
            "body": "I'm positive that Tom Brady yelled at the equipment guys if his stuff wasn't just right, and that pressured them either implicitly or explicitly.  \n\nI think it was far more probably implicit pressure (constant gripes about the balls to staff) than explicit conspiratorial instructions to blatantly circumvent rules.  That would explain the conclusion that he was (or should have been) \"generally aware\" of playing loose with the rules, while at the same why he's so adamant that he's done nothing wrong.  \n\nNothing else makes that much sense or would explain Brady's behavior &amp; appeals given the top council he has.\n\nAsking for autographed gear doesn't strike me as terribly weird... seems like a rather logical perk &amp; ask of an equipment guy to a star QB.  Destruction of the cell phone sounds fishy outwardly, but if I was Brady I'd be pretty petrified of unrelated leaks given his celebrity status and the NFL's handling of these cases... the NFL already has his texts to the equipment manager and metadata of all the texts he made.  These are red herrings.\n\n\"Tom Brady is a Cheater\" and \"Tom Brady is a saint\" aren't the only two options here.\n\nBrady probably should have known better and may have been naive about the ramifications of his dealings with the equipment guys, sure.  Previous precedent of equipment manipulation (see the Chargers, Panthers) is verbal warning/small fine, and previous precedent of celebrity QB refusing to turn over all personal communications is a fine (see Farve - he didn't turn his cell over for the *same* reasons) is a small fine.\n\nThis whole thing would be a non-issue if it was any other team or any other QB.  It's wildly blown out of proportion because of Brady's celebrity and the Pats success.  Goodell has been struggling and handing out punishments arbitrarily based on public opinion,  so this whole thing has turned into a battle of egos of Goodell vs. Brady where neither is completely in the right.  It's not really about the transgression anymore.",
            "author": "Kman17",
            "created_utc": 1438270676.0,
            "replies": [
                {
                    "name": "t1_ctlprma",
                    "parent_id": "t1_ctlmeq8",
                    "body": "The NFL seems much more upset about his trying to cover it up and not cooperating with them. That explains the punishment being different from your examples. The league has no right to just confiscate Brady's phone/email records. They have no right to a lot of things that a legal investigation would have a right to. So when a player refuses to cooperate, and (in their eyes) blatantly destroys evidence relevant to the issue, the league has to do something about it. If players don't cooperate with the investigations of the league, the league has nothing. They can't just legally seize the evidence they need.\n\nIt doesn't seem right that they can increase the punishment for not cooperating with them. But, if every team/player/coach all just refused to cooperate with league investigators, every stupid little rule infraction would turn into this situation of everyone arguing over what *really* happened.\n\n&gt;He was told his own lawyer could select the communications off his personal cellphone that were of interest to the league and send them those specific records...\n\nI don't buy the concern for personal privacy. The only data they have of the texts he made is that he exchanged nearly 10,000 messages in the 4 month time that he had the phone.",
                    "author": "Gunderik",
                    "created_utc": 1438275452.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_ctlr9v3",
            "parent_id": "t3_3f4jwn",
            "body": "I suggest checking out the official patriots [rebuttal](http://wellsreportcontext.com/) to the Wells Report\n\n&gt; One giving the other a \"heads up\" that his name came up in an interview with NFL Security.  \n\nThere was  national media uproar about potentially deflated game balls.  If you were one of only a handful of locker room attendants who handled the balls, of course you would be interested if your name came up.  What kind of asshole would *not* tell his friend that his name came up in an interview with security. \n\n&gt; Multiple references to Brady's preferences of the PSI of game balls and of providing a needle for use.\n\nBrady knew he liked his balls at 12.5 psi.  He requested the locker room guys hand the refs a highlighted copy of the rule book so they knew what range it could be.  That requires inflating (and if necessary deflating if they've been over-inflated) the balls.  Needles are required for both inflating and deflating.\n\n&gt;  In the context of an exchange about the pressure of game balls, one said to the other that Brady \"actually brought you up and said you must have a lot of stress trying to get them done.\" Mcnally's only assigned responsibility regarding game balls was to deliver them. What is there to \"get done?\"\n\nThey claim they were referencing him trying to sell his game tickets.  But they claim the \"he\" that starts that quote wasn't referring to Brady.  It's one of the sketchier parts but is far from conclusive.\n\n&gt; One expressing anger with Brady states that \"the only thing deflating sun[day] is his passing rating.\"\n\nThis was the week after the referees in a Jets game inflated the Patriots balls to 16 PSI, well over the legal limit.  Given that they were being yelled at for over-inflating the balls, discussing deflating would make sense.\n\n&gt; One refers to himself as \"the deflator\" and jokes about \"not going to ESPN ... yet.\"\n\nThis was in May 2014.  If they were deflating balls all the way back to the 2013-2014 season, then how did they end up getting surprised by 16psi balls during the Jets game in the 2014-2015 season?  They say it was a reference to losing weight.  The bit about ESPN was preceded by a discussion of getting free sneakers, which they were not allowed to do.  \n\n&gt; Multiple requests for autographed gear from Tom Brady.  \n\nI would hope that Tom Brady and every major NFL star gives out signs gear for free for the lower-level team employees.  And, importantly, the Wells Report made no attempt to show that this was at all unusual for the Patriots or for NFL teams in general.\n\n&gt; One says to the other \"I have a big needle for you this week.\" The response is \"Better be surrounded by cash and new kicks... or its a rugby sunday\". When asked about this message by investigators, Mcnally confirmed that the reference to \"rugby\" meant an over-inflated football.  \n\nYeah, guys whose job it is to inflate the balls need needles to work the pumps.  The request for cash clearly sounds like a joke, especially in the context of the rest of their text message jokes. \n\n&gt; About a week before the AFCCG, one told the other it would be a \"big autograph day for you.\" Several days later, Brady signed 2 footballs and a game-worn jersey and handed them to Mcnally in the equipment room.  \n\nAgain, players sign all kinds of stuff, I don't see any reason to suggest this was some kind of quid pro quo.  Unless you hear players or employees saying that it's rare for players to sign all kinds of stuff and give away used equipment, I don't think this is any evidence of anything.  And these were the guys who prepared his game balls.  It's important to keep those guys happy.  \n\n&gt; Brady ordered his phone that had been used the past 4 months to be destroyed.\n\nOk, admittedly destroying the phone was a bad idea, but: A) At that point, he wasn't going to give it to them anyway, so destroying didn't do anything to cover up actions. B) If Brady's lawyer were the one selecting which messages were relevant, then I don't really see how they were expecting to get any incriminating evidence of the phone anyway.  C) I think his claim that he didn't want to set a precedent of players having to turn over private cell phones or private text conversations is legit. D) Around the time of the appeal (although a bit too little, too late) he pulled the records of his text messages and said he was willing to attempt to recover the contents from the other peoples' phones.\n\n&gt; Prior to the start of the game, Mcnally removed the Patriots' footballs form the Officials' Locker Room without informing or receiving permission from any of the game's officials, then he went to a small bathroom and locked the door even though he had access to the facilities in the Officials' Locker Room.  \n\nThe AFC championship game was unusual in the sense that it was delayed due to the late ending of the NFC championship game.  As a result the pregame timing was a little different, and the Officials Locker Room was crowded with people watching the end of the other game.  \n\n",
            "author": "turned_into_a_newt",
            "created_utc": 1438277503.0,
            "replies": [
                {
                    "name": "t1_ctlv7xc",
                    "parent_id": "t1_ctlr9v3",
                    "body": "&amp;Delta; While I'm not *entirely* convinced, I will say I'm more open about the ruling in the case should be. I could see it going either way now. The franchise's response *would* try to address everything with an excuse, whether anyone were guilty or not, but most of it seems perfectly reasonable. The main thing I have a problem with was this:\n\n&gt; One says to the other \"I have a big needle for you this week.\" The response is \"Better be surrounded by cash and new kicks... or its a rugby sunday\". When asked about this message by investigators, Mcnally confirmed that the reference to \"rugby\" meant an over-inflated football.\n\n\n&gt; Yeah, guys whose job it is to inflate the balls need needles to work the pumps. The request for cash clearly sounds like a joke, especially in the context of the rest of their text message jokes.\n\nWhile it could be just a coincidence that looks really bad, I'm not buying that he was told he'd have to do his job and in response requested bribes of cash and shoes as a joke.\n\nThanks for the link to the team's response, I'll have to read that.\n\n",
                    "author": "Gunderik",
                    "created_utc": 1438282903.0,
                    "replies": [
                        {
                            "name": "t1_ctm16ey",
                            "parent_id": "t1_ctlv7xc",
                            "body": "It might be worth mentioning that Brady buys things for other people in the organization all the time. He got his offensive line cars once.",
                            "author": "thisistheperfectname",
                            "created_utc": 1438291433.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ctlrkpz",
            "parent_id": "t3_3f4jwn",
            "body": "First of all, lets make sure we are talking about what Brady is guilty of which is 1)Taking part in the tampering of game balls and 2) Hiding evidence from the investigators.\n\nAs with all \"guilty\" or \"non guilty\" rulings in a court of law, the guilt must be proven beyond a reasonable doubt. \"Reasonable doubt\" is the big point to be made here. \n\nWith that in mind lets get down to the two possibilities of guilt\n\n1) This one is pretty easy, is their anything that explicitly states that Brady personally told the equipment managers that they should deflate the balls after they have been checked by officials? As far as I know, from the evidence given, there is not.\n\n2) This one is a little more tricky. The evidence that Brady may have withheld was his old phone. He destroyed it and investigators couldn't get their hands on it. From that perspective, it looks a little fishy; however, Brady's lawyers informed him that he could destroy the phone as it was not a part of the investigation. Brady explicitly asked the lawyers about this. Now, you might think this is suspicious, but you have to understand this guy is a celebrity and, just like any other celebrity, people are probably constantly trying to find and spread his personal information for profit. If Brady wanted to destroy his old phone, I don't blame him.\n\nLooking back at these points, we see that there are very valid reasons to doubt that Brady took part in any of the accusations made. This reasonable doubt would mean that he's not guilty, whether or not your gut says otherwise.",
            "author": "trustthepudding",
            "created_utc": 1438277914.0,
            "replies": []
        },
        {
            "name": "t1_ctls2er",
            "parent_id": "t3_3f4jwn",
            "body": "The NFL officials are the ones that screwed up.\n\nThe problem is that officials have been playing fast and loose with the footballs for years.\n\nThe rulebook states that the ball should be inflated to between 12.5 and 13.5 PSI. The teams are allowed to handle the balls and work them to specifications that they like, and then they are investigated by the officials to determine if they lie within the rulebook.\n\nThe problem is that league officials have been regularly inflating balls well above 13.5 PSI, up to even 16 PSI. \n\nAfter one infamous game with a 16 PSI football, it looks like Brady got pissed, and decided to take the rules into his own hands. Is that really \"wrong\"? To try to follow the rules of the game, even when the officials are blatantly flouting them?\n\nThere is no evidence that he intentionally went around the rules to deflate footballs outside the legal limit. ",
            "author": "cornballin",
            "created_utc": 1438278583.0,
            "replies": []
        },
        {
            "name": "t1_ctltslz",
            "parent_id": "t3_3f4jwn",
            "body": "There are two issues with Deflategate that are at odds with each other:\n\n1. There is a mountain of circumstantial evidence (but no direct evidence) suggesting that McNally deliberately deflated the Patriots footballs, and that Tom Brady knew about it.\n2. The Patriots footballs were not deflated.\n\nThese points are diametrically opposed and mutually exclusive. Only one of those two things is true.\n\nYou detailed all the aspects of Point #1. It's an incredibly compelling story, filled with drama. There's a villain, there's a conspiracy, there's a fall from grace. It's awesome.\n\nPoint #2 is much more mundane. The Patriots balls were at 12.50 PSI before the game, they lost 1.01 PSI due to the cold weather, and that's that. It's a boring explanation.\n\nIt's science versus faith.\n\nPoint #1 has a lot of vague inferences that you can interpret however you like. You choose to interpret them to mean that footballs were deflated; I interpret them another way. Regardless of interpretation, the story doesn't have an \"I prefer footballs below 12.5\", or \"I'll deflate the footballs\", or security footage of deflation, or a confession, or any witnesses at all. There is no direct evidence. You can make your interpretations, and have faith that they're correct.\n\nPoint #2 is pure science. According to the Ideal Gas Law, the Patriots footballs should have lost between 0.98 and 1.18 PSI during the first half *if they were not deflated*. They lost 1.01 PSI. Therefore, they were not deflated.\n\nI'm not trying to change your view, I just want to point out the difference between the groups, and make it clear which group you are in.",
            "author": "strictfactor",
            "created_utc": 1438280948.0,
            "replies": []
        }
    ]
}