{
    "name": "t3_3afrp5",
    "title": "CMV: In OITNB, Sam Healy is bad at his job. (SPOILERS)",
    "body": "Just a heads up this includes spoilers from season 5. I believe that Sam Healy is bad at his job because of the ways he treats the inmates. Some key examples of things he has done that are either just horrible clinically, or character's expressing their issues with him:\n\n1) His relationship with Piper - sending her to the SHU for dancing with Alex was completely uncalled for. He is supposedly a counselor, and therefore should understand how psychologically damaging solitary confinement is. Also, he stands by and lets Tiffany beat the crap out of her. He straight up facilitates this happening, and does nothing to help Piper. Piper could have died and he didn't appear to care at all.\n\n2) He clearly has an inappropriate relationship with Red. Using her as a translator is a huge conflict of interest, and it's heavily alluded to that he has a romantic interest in her, which is obviously not okay in the context of a prison. \n\n3) Soso. She straight up tells him that he is bad at his job, he makes her feel worse, and he plays a role in her attempting to commit suicide. If he wouldn't have made the recommendation for pills, she wouldn't have used them to try and kill herself. \n\n4) He also is portrayed as very homophobic and sexist, which is a huge problem when you are supposed to be helping women in prison. \n\nThings that would help CMV - Examples of him actually providing worthwhile therapy to the girls, or helping them in a meaningful way. Examples of him being more sympathetic than what I am describing him as. Some sort of reason of why you think he is a useful member of the staff. \n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "dangerzone133",
    "num_comments": 11,
    "created_utc": 1434743401.0,
    "url": "http://www.reddit.com/r/changemyview/comments/3afrp5/cmv_in_oitnb_sam_healy_is_bad_at_his_job_spoilers/",
    "comments": [
        {
            "name": "t1_cscaf0f",
            "parent_id": "t3_3afrp5",
            "body": "Aside from maybe Berdie Rogers, who at Litchfield is actually good at their job?",
            "author": "dervidjerseph",
            "created_utc": 1434748520.0,
            "replies": [
                {
                    "name": "t1_cscai62",
                    "parent_id": "t1_cscaf0f",
                    "body": "I think Fischer was decent. I mean, yeah pretty much everyone on staff has some incompetence, this is true, but that doesn't make Healy less horrible. ",
                    "author": "dangerzone133",
                    "created_utc": 1434748675.0,
                    "replies": []
                },
                {
                    "name": "t1_cscanwg",
                    "parent_id": "t1_cscaf0f",
                    "body": "Let me expound a bit.  I think this question is a little bit more loaded than you thought.  If you're arguing that Healy's bad at his job, you won't find any argument here-but keep in mind who his colleagues are:\n\n1)Caputo-masturbates to women after they come to him with issues.\n\n2)Figueroa-embezzles money from the prison.\n\n3) Luschak-conspires to sell heroin.\n\n4) Bennett-gets an inmate pregnant.\n\n5) Mendez-smuggles contraband, has sex with inmates, etc.\n\n6) O'Neill and Bell - sex within Litchfield\n\nCompared to all of these people, Healy looks like a saint.  Being bad at your job is relative, after all.  ",
                    "author": "dervidjerseph",
                    "created_utc": 1434748962.0,
                    "replies": [
                        {
                            "name": "t1_cscavpa",
                            "parent_id": "t1_cscanwg",
                            "body": "I see what you are saying, but I didn't say he was \"the worst\" at his job, I said he was bad. If I was picking a worst I would probably go with Pornstache, but I think Healy is up there with the rest of them because he would have been accessory the deaths of not 1, but 2 inmates if it weren't for pure luck (Piper going all hulk smash/Suzanne breaking up the fight and Poussey finding Soso and taking care of her) ",
                            "author": "dangerzone133",
                            "created_utc": 1434749345.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_csccp8p",
                    "parent_id": "t1_cscaf0f",
                    "body": "Red. She had nothing to do with the food. Nothing.",
                    "author": "AtomikRadio",
                    "created_utc": 1434752717.0,
                    "replies": []
                },
                {
                    "name": "t1_cscif8a",
                    "parent_id": "t1_cscaf0f",
                    "body": "Admiral Rodcocker seems to be pretty professional.",
                    "author": "harmelion",
                    "created_utc": 1434764497.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cscbr0t",
            "parent_id": "t3_3afrp5",
            "body": "He starts safe place in an attempt to open a dialogue with the inmates about their feelings ,and has helped at least Pennsatucky with her rage. Sam also actively researches psychology in an attempt to be better at his job.  \nHe may have inappropriate feelings for Red, but has he acted on them? Well a little, but more as a suggestion for when she gets out. He hasn't attempted to be with her sexually, which is a lot more than a good chunk of the other guards can say.  \nHealy may be bigoted and racist, but not outwardly to the inmates themselves. I think he does care about his job and the girls, and his attitude reflects more of a problem with many white american men, but not as a counsellor. ",
            "author": "Kibblets",
            "created_utc": 1434750917.0,
            "replies": [
                {
                    "name": "t1_cscbxg2",
                    "parent_id": "t1_cscbr0t",
                    "body": "I don't think safe place was actually helpful for any of the inmates though, didn't pretty much no one go?\n\nWhat do you think he has done to help Penn with her rage issues? \n\nHe's pretty outwardly homophobic - remember that lesbian agenda speech he gave to Penn, and to Piper? \n\nI do certainly see that he is supposed to represent a specific type of white american man, but I think that type of man makes a horrible counsellor because he is so caught up in his own shit that he doesn't see when people are really hurting (Soso) ",
                    "author": "dangerzone133",
                    "created_utc": 1434751249.0,
                    "replies": [
                        {
                            "name": "t1_cscf2qw",
                            "parent_id": "t1_cscbxg2",
                            "body": "Few people went partly because there was a rumour going around that it was about snitching on other people to Healy. It really could have been helpful for Poussey, she wanted to reach out but she couldn't because Suzanne was there to make sure she didn't 'snitch'. Healy still tried to change his behaviour and do something he thought could genuinely help the inmates.\n\nYou also have to remember that a prison counsellor isn't the same as a counsellor on the outside. A prison counsellor is not a therapist and may not even be able to tell someone is suicidal compared to being severely depressed, let alone provide the level of care needed for someone who is seriously considering suicide. His job isn't the same as an 'outside world' counsellor. He made a recommendation for Soso to get antidepressants, and without that recommendation she may not have gotten any medication whatsoever. Antidepressants have to be closely monitored by a medical doctor at the start of the course. That she didn't receive that care isn't Healy's fault, because he is not in any way qualified to monitor someone's reaction to medication, which often includes increased suicidal urges to begin with.",
                            "author": "chocolatekettle",
                            "created_utc": 1434757408.0,
                            "replies": [
                                {
                                    "name": "t1_cscyvlw",
                                    "parent_id": "t1_cscf2qw",
                                    "body": "I am aware of how prison counselors work, my father was one for many years (he says the show is creepily accurate to where he worked) and they should be able to do some amount of actual counseling before just sending someone to medical. Berdie is an example of this, as she is one of the few people I would say is actually decent about her job. \n\nRegardless of if he was able to determine if she was suicidal, advising a depressed person to isolate themselves is a huge no-no. A social worker would be able to explain why that's a horrible idea, it's not something that takes a tremendous amount of training. \n\nI understand how antidepressants work (as I am a medical student) my issue isn't that he didn't monitor her reaction to them closely enough, it's that he gave her bad advice for dealing with depression, and then set her to medical unnecessarily. ",
                                    "author": "dangerzone133",
                                    "created_utc": 1434816341.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cscg2p4",
            "parent_id": "t3_3afrp5",
            "body": "Soso overdosed on meds that she stole from the Dr's office- Healy sent her to the Dr, the Dr's incompetence is the reason a pile of unattended pills was left in a room where a prisoner could grab them if she wanted them.  \n\nHaving said that, I feel like they do a decent job with that character.  He is supposed to be helping inmates, but he has been there a long time, and people who are in positions like that have something similar to battle fatigue where they become less compassionate and more suspicious of games.  \n\nI think that he realizes that he made some terrible moves in Season 1 &amp; the beginning of Season 2, and is trying/ did try to help.  He had that Circle group with Penn, and he tries to help Red when he can.  \n\nLike many people, he is actually a combination of decency and selfishness or pettiness.  \n\nHe may not be the best at his job, but he isn't the worst.  And in that system, sometimes the one who isn't selling drugs &amp; having sex with inmates, etc, is the one who is \"good\" at his job, by comparison.  \n\nAlthough, my vote for the one prison guard who seems to actually be good at his job would have to be Ford.  Because, other than leaving Morello in the van with Miss Rosa to see why the alarms were going off when Vee broke out, I can't think of a single bad move that guy has made.  ",
            "author": "ihearthiking",
            "created_utc": 1434759463.0,
            "replies": []
        }
    ]
}