{
    "name": "t3_3a2qyc",
    "title": "CMV: Brock Lesnar was the greatest ever UFC heavyweight champion. (Spoilers)",
    "body": "This is probably an unpopular opinion among mma fans, but I think a strong argument can be made.  There's never been a truly dominant heavyweight champ in UFC, unlike lower weight classes. In fact nobody has ever successfully defended the hw title more than twice during a single reign.  The only other contenders for GOAT so far would be Cain Velasquez and Randy Couture, who also won 2 title defenses in a row.  (Technically Couture won 3, but during separate reigns.)  \n\nNow some might argue that Cain and Randy are better because they are multiple-time champions (so is Tim Sylvia), but in both those cases they weren't able to get 2 straight until their second reign. Brock did it in his one reign, and with considerably less experience.  Plus both Lesnar's successful defenses were against interim champs in their own right (and he's the only hwc to ever defeat an ihwc).  One of them was against a man who had already beaten him (Mir), and the other was against an undefeated Carwin.  On the other hand Cain's 2 were both against fighters he'd already beaten (though JDS had also beaten him), and Couture's 2 in a row were against the same guy.\n\nAnother common knock against Lesnar is that he had amateurish striking skills.  I don't see this as a strong argument since Anderson Silva had mediocre wrestling, but very few would even attempt to argue that he wasn't the greatest middleweight champ, if not the GOAT mma fighter period.  I'd say it's precisely because Lesnar had limited skill and experience and got by on sheer freakish athleticism (despite serious health issues with diverticulitis) that he was so awesome.  He actually had to cut weight to fight at heavyweight, something only fat guys normally have to do.  I believe that if he was allowed to compete at 300 lbs he'd have had a much better chance of holding Cain down after the takedown, and therefore might have even beaten him for that elusive third successful heavyweight title defense.\n\nAnother consideration is that Lesnar is the greatest draw for the UFC ever, at least on a fight by fight basis.  Some might dismiss this factor, but I think it's also a big part of why Muhammad Ali is almost universally considered a greater hwc than Larry Holmes. \n\nSo in conclusion, ranking the UFC heavyweight champions goes like this imo:\n\n1: Brock Lesnar\n \n2: Randy Couture\n\n3: Cain Velasquez\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "skunkardump",
    "num_comments": 15,
    "created_utc": 1434483830.0,
    "url": "http://www.reddit.com/r/changemyview/comments/3a2qyc/cmv_brock_lesnar_was_the_greatest_ever_ufc/",
    "comments": [
        {
            "name": "t1_cs8qzp2",
            "parent_id": "t3_3a2qyc",
            "body": "This was a humiliating defeat.\n\nhttps://www.youtube.com/watch?v=8PIBI2Rd97g\n\nI simply don't see how you could rank him above a man that just beat him senseless in the first round.\n\nIf it was a close fight then things like title defenses, and success against the mutual opponents certainly come into play. But we watched him get utterly dominated in one round by someone you are raking well below him. It doesn't make much sense to me.\n\nThe fact is the heavyweight division has been had long stints of weakness. That's the only reason a man as small as couture was ever able to compete there at all.",
            "author": "jesusonadinosaur",
            "created_utc": 1434485437.0,
            "replies": [
                {
                    "name": "t1_cs8slf4",
                    "parent_id": "t1_cs8qzp2",
                    "body": "The fight was actually somewhat competitive until Lesnar got knocked loopy and ruthlessly GnP'd.  Ali vs. Holmes was also pretty ugly. Anderson Silva vs Forrest Griffin, now that was humiliating!\n\nI wouldn't say the rankings imply that Cain is \"well below\" Lesnar, I think it's a very close race for GOAT within the top three.\n\nI think too much is made of the weakness of the heavyweight division.  Look how guys like Werdum, Arlovski or even Mark Hunt have been able to rise back up the ranks recently.  Good lhw's have always been able to move up and be competitive.  Even all time greats like Cain, and (outside UFC) Fedor have been undersized, and could probably make lhw no problem.  ",
                    "author": "skunkardump",
                    "created_utc": 1434487819.0,
                    "replies": [
                        {
                            "name": "t1_cs8urku",
                            "parent_id": "t1_cs8slf4",
                            "body": "You are essentially using the opposite argument that most Fedor nuthuggers love to use. You are saying that Brock Lesnar got by with poor skills (which is impressive) and made an impressive career due to mostly athleticsim. And then there are the Fedor nuthuggers on the other side, saying that Fedor are the best because he won even though he was undersized.\n\nBoth are 100% invalid statements that you should not even consider in this debate. Both fought at HW, end of discussion.\n\nWith that being said we have to look at performances and records alone. And the fact is that Cain got more wins title fights than Lesnar do, and he could still get more as well. And all of Cain's wins in title fights have been very impressive, while I wouldnt consider Carwin an impressive win from Lesnar. Lesnar also fought during a much weaker era of the division according to me. The best talent was spread out in other organisations or still yet in developement (Cain for example.) ",
                            "author": "Dirtey",
                            "created_utc": 1434491225.0,
                            "replies": [
                                {
                                    "name": "t1_cs8wghl",
                                    "parent_id": "t1_cs8urku",
                                    "body": "I would say that Fedor was GOAT heavyweight in any promotion based on his legendary win streak, something I doubt anyone will ever come close to in UFC.  However I do think that not having to cut weight is something of an advantage at heavyweight.  Whether or not it's more of an advantage than size itself is debatable, but clearly most heavyweights don't bulk up to 265, and there are very few human beings that would have to cut down to 265 (unless they're fat obviously).  There seems to be diminishing returns on size once you get well over 200 lbs.  Ali wasn't that big himself, though he had a huge reach, much like Jon Jones, who many would have considered a favorite at heavyweight, even against the likes of Cain Velasquez.  It's extremely rare for fighters in other divisions to weigh in at less than a pound or two under the limit.  If UFC had a super heavyweight division I probably wouldn't give Lesnar as much credit.\n\nCain also has more losses in title fights, and what he may or may not do in the future is irrelevant.  Couture has more wins in title fights than Cain, especially if you consider his lhc reigns.  Would you consider Couture above Cain?  ",
                                    "author": "skunkardump",
                                    "created_utc": 1434494013.0,
                                    "replies": [
                                        {
                                            "name": "t1_cs8x26e",
                                            "parent_id": "t1_cs8wghl",
                                            "body": "The thing with weight are that the talent pool for athletic 265+ guys are extremely small. Lesnar are probably the only guy that fits this that have ever made a serious attempt at MMA. Either way this is not relevant at all. I can write more about this if you find it relevant, but this does not affect the fighters legacy. \n\nRandy Couture fought at a different era, he was never the considered the best HW in the world and if the UFC did a better job of bringing in better HW's he would have gotten destroyed. The amount of wins in hw title fights might be impressive, but against who are not impressive at all. \n",
                                            "author": "Dirtey",
                                            "created_utc": 1434495040.0,
                                            "replies": [
                                                {
                                                    "name": "t1_cs8yzrt",
                                                    "parent_id": "t1_cs8x26e",
                                                    "body": "You've got me on the super heavyweight thing. ∆\n\nI'm still not convinced that Lesnar wasn't the greatest, but I have to admit that particular point wasn't terribly astute.",
                                                    "author": "skunkardump",
                                                    "created_utc": 1434498450.0,
                                                    "replies": [
                                                        {
                                                            "name": "t1_ctanitm",
                                                            "parent_id": "t1_cs8yzrt",
                                                            "body": "Confirmed: 1 delta awarded to /u/Dirtey. ^[[History](/r/changemyview/wiki/user/Dirtey)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][/r/DeltaBot]",
                                                            "author": "DeltaBot",
                                                            "created_utc": 1437462520.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "name": "t1_cs8xcw8",
                            "parent_id": "t1_cs8slf4",
                            "body": "&gt;The fight was actually somewhat competitive until Lesnar got knocked loopy and ruthlessly GnP'd\n\nWhich if you watch did not take long at all. He didn't even last a round.\n\n&gt; Ali vs. Holmes was also pretty ugly. \n\nAli was way old in that fight. It's not apples to apples. \n\n&gt;Anderson Silva vs Forrest Griffin, now that was humiliating!\n\nThat's probably among the worst I've seen. \n",
                            "author": "jesusonadinosaur",
                            "created_utc": 1434495550.0,
                            "replies": [
                                {
                                    "name": "t1_cs8ywso",
                                    "parent_id": "t1_cs8xcw8",
                                    "body": "First round finishes are commonplace at Heavyweight.  As previously mentioned, Cain has been KO'd in considerably less time.\n\nGranted my analogy is far from perfect, especially considering it's two different sports.  Then again Lesnar wasn't exactly in perfect condition either, and many considered Ali past his prime even post suspension.  He certainly looked less fit.  Then again look what Couture, Foreman, and Hopkins have accomplished at older ages.",
                                    "author": "skunkardump",
                                    "created_utc": 1434498299.0,
                                    "replies": [
                                        {
                                            "name": "t1_cs96nzv",
                                            "parent_id": "t1_cs8ywso",
                                            "body": "&gt;Granted my analogy is far from perfect, especially considering it's two different sports. Then again Lesnar wasn't exactly in perfect condition either, and many considered Ali past his prime even post suspension. He certainly looked less fit. \n\nLesnar wasn't too old to fight. And Ali was past his prime post suspension, he was still good, but his speed was noticeably reduced. I think your manner of fighting style effects how reduced your capacity is with age. Speedsters seem more vulnerable than brusers to these effects. ",
                                            "author": "jesusonadinosaur",
                                            "created_utc": 1434512291.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "t1_cs8wu0g",
                    "parent_id": "t1_cs8qzp2",
                    "body": "Wasn't Lesnar severely hampered by post surgery complications during that fight?  Maybe I'm remembering the wrong one.",
                    "author": "ghotier",
                    "created_utc": 1434494652.0,
                    "replies": [
                        {
                            "name": "t1_cs8x0c6",
                            "parent_id": "t1_cs8wu0g",
                            "body": "IIRC that would have been the Overeem fight, where Lesnar was literally disemboweled on the operating table, then took a vicious kick to the belly.  Lesnar was definitely hampered by his battle with diverticulitis though, probably throughout his entire MMA career.",
                            "author": "skunkardump",
                            "created_utc": 1434494953.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cs8rdj0",
            "parent_id": "t3_3a2qyc",
            "body": "I don't know a lot, but I remember watching when he fought Carwin and he got completely destroyed.  Carwin hit him so many times, he eventually gassed out and got choked.  Sure, this is a skill in itself, but I don't see it happening very often.  When he went against someone with more punching power and skill with Cain, it didn't go so well.  Maybe he was the best athlete and most naturally talented, but I don't know about the best.    ",
            "author": "Bagodonuts10",
            "created_utc": 1434486002.0,
            "replies": [
                {
                    "name": "t1_cs8rr0a",
                    "parent_id": "t1_cs8rdj0",
                    "body": "You could say the same about Ali when he rope-a-doped Foreman.\nAlso there's no way Cain had more punching power than Carwin, not even close imo.  The guy hit like a truck, and knocked out every opponent he had in the UFC in the first round before Lesnar.\nPlus Cain got KO'd even faster by JDS in their first fight.\nHeavyweight is a bit of a crap shoot, where one punch can be utterly devastating.  That's probably why it's so hard to defend that title compared to lower weight classes.",
                    "author": "skunkardump",
                    "created_utc": 1434486557.0,
                    "replies": [
                        {
                            "name": "t1_cs8t3bt",
                            "parent_id": "t1_cs8rr0a",
                            "body": "You could say that about Ali Forman and in many ways I would. I don't know if Ali was in more control or if it was more strategy with him, but it didn't look intentional when lesnar was lying on the ground getting punched in the face by carwin.  But you're right that heavyweight is a tough one to judge. If you say Cain doesn't have more power maybe that's true but I couldn't believe that lesnar wasn't knocked out by carwin, so maybe I made some poor assumptions. His chin must just be impossibly good. I just know that I saw two fights in a row with him on the ground getting brutalized and that made me question if he was really the best. Didn't see all of his fights though so I'm not the best judge. ",
                            "author": "Bagodonuts10",
                            "created_utc": 1434488580.0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}