{
    "name": "t3_3djvsa",
    "title": "CMV: Steffi Graf is overrated as the GOAT. She is good but nowhere near the best.",
    "body": "Steffi Graf is widely considered to be the greatest female tennis player of all time due to her incredible success over the course of a very long career. Now that Serenea Williams has been knocking on her door for so long, talk of Graf has resurfaced. I feel that statements like \"Serena is great, but Graf has more slams/better wins record!\" are completely misguided due to the stabbing of Monica Seles.\n\nIn 1991, 1992 and the start of 1993, Seles won 7 out of 9 grand slams and beat Graf 3 times in slam finals in the process (going 1-3 vs Graf overall in finals). During this time she also replaced Graf as the world #1. After the 1993 australian Open, she was stabbed and taken out of the game. Steffi Graf would go on to win the next 3 grand slams of that year and continue her dominance for the next decade. \n\nHad Seles not been stabbed, Graf's dominance would have ended in 1993. During Seles' 7/9 slam streak, Graf won the other 2/9. After the stabbing, she would go one to win 10 of the next 15 slams, padding her stats and achieving her GOAT status. There is no way she could have done this had Seles been around to stop her. One key thing to note is that Seles was only twenty when she was stabbed, so she was primed for a decade or more of top level play.\n\nI believe serena surpassed Graf long ago.\n\nCMV\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "fundselection",
    "num_comments": 2,
    "created_utc": 1437082046.0,
    "url": "http://www.reddit.com/r/changemyview/comments/3djvsa/cmv_steffi_graf_is_overrated_as_the_goat_she_is/",
    "comments": [
        {
            "name": "t1_ct5vg93",
            "parent_id": "t3_3djvsa",
            "body": "I really dislike these GOAT headlines that newspapers and magazines love so much. As if it's fair to compare people who played in completely different times when the styles of play were different, the equipment was different, coaching and training were different. These proclamations achieve nothing, in my opinion, except some more sales and contentious commentary. But that's what CMV is all about, isn't it?\n\n&gt; Had Seles not been stabbed, Graf's dominance would have ended in 1993.\n\n&gt;&gt;  One key thing to note is that Seles was only twenty when she was stabbed, so she was primed for a decade or more of top level play.\n\nThis is an unfalsifiable claim, pure speculation. Tracy Austin was touted to the the Next Big Thing when she won two US Opens during her teenage years. Then what? She won a mixed-doubles at Wimbledon some time later, and dealt with injuries for the rest of her career. How can you say what *would* have happened with such confidence? You cannot. There is what happened, and that's the only thing that we can say for certain. I can't say for certain that Graf is the GOAT, and I can't say that of Serena either. They were each the best female tennis players of their cohorts, and that's something that I can say with confidence.",
            "author": "RustyRook",
            "created_utc": 1437083525.0,
            "replies": []
        },
        {
            "name": "t1_ct5vi1w",
            "parent_id": "t3_3djvsa",
            "body": "Arguably Serena never had a player the level of Monica Seles to worry about. An alternative argument is if Seles played in Serena 's rime, Serena would have less slams and Graf would have more. ",
            "author": "MasterGrok",
            "created_utc": 1437083602.0,
            "replies": []
        }
    ]
}