{
    "name": "t3_3erzfr",
    "title": "CMV: Ellyse Perry is the greatest Australian athlete to ever live",
    "body": "This player debuted for the Southern Stars (Australian national cricket team) at 16, making her the youngest player to make the national side (male or female). Just a month later she debuted for Matildas (Australian national soccer team). She was fast-tracked into the national cricket team having not even played for her senior state side. In her debut T20 international match she was awarded Player of the Match, a feat she repeated in the world T20 final; scoring 3/18. In just her third year of international cricket she earned her maiden 5-wicket haul and despite being a defender she scored a goal in the 2008 Asian Cup; just her second year (so as a 17 year old) of international soccer.\n\nShe is now 24 and has gotten 2 of Australia's 3 wickets against England so far (match is about a third of the way through) after Perry scored 67 off 58 bowls.\n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "eltappo",
    "num_comments": 16,
    "created_utc": 1438008837.0,
    "url": "http://www.reddit.com/r/changemyview/comments/3erzfr/cmv_ellyse_perry_is_the_greatest_australian/",
    "comments": [
        {
            "name": "t1_cthug4w",
            "parent_id": "t3_3erzfr",
            "body": "With all due respect, Ellyse is playing in a sport that a limited number of countries show real interest in (20-30?) in a women's game that is widely underfunded.\n\nRod Laver dominated Tennis in the 60s, was world number one for 6 years, holds the record for singles titles won to this day, is the only player to win the grand slam twice (7 years apart) and led Australia to 5 davis cups.\n\nRod Laver is in the discussion for the greatest of all time in a worldwide sport with centuries of history and is the obvious choice for greatest australian athlete.",
            "author": "ACollectiveSigh",
            "created_utc": 1438011867.0,
            "replies": [
                {
                    "name": "t1_cthuqcz",
                    "parent_id": "t1_cthug4w",
                    "body": "∆ Okay I must say I didn't consider Laver, and I don't know a lot about him. Although it wasn't the initial topic could you compare his rise to Perry's at all?",
                    "author": "eltappo",
                    "created_utc": 1438012297.0,
                    "replies": [
                        {
                            "name": "t1_cthutqr",
                            "parent_id": "t1_cthuqcz",
                            "body": "Confirmed: 1 delta awarded to /u/ACollectiveSigh. ^[[History](/r/changemyview/wiki/user/ACollectiveSigh)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][/r/DeltaBot]",
                            "author": "DeltaBot",
                            "created_utc": 1438012444.0,
                            "replies": []
                        },
                        {
                            "name": "t1_cthvd0m",
                            "parent_id": "t1_cthuqcz",
                            "body": "He didn't have the same early start in the professional game but he won the Aussie/US junior open at 18/19 and at 20 in 1959 he reached all three Wimbledon finals in the same year (winning the mixed doubles) and losing out in the final after having player a very long semi final. \n\nBy 24 he had turned professional and was widely considered among the best in the world, by 26 he was THE best in the world and would stay that way for some time. \n\nI'm too young to have seen much of him myself but my father talks incredibly highly of him (On as high a level as nearly anyone else in the game) and I knew it was worth bringing him up when I saw the title.",
                            "author": "ACollectiveSigh",
                            "created_utc": 1438013255.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cthvpeo",
                    "parent_id": "t1_cthug4w",
                    "body": "The other point would be that whilst cricket may not be the most competitive game for women soccer would have one of the highest participation sports for women, and she managed to be a part of a world top 10 team while focusing on a vastly different sport",
                    "author": "eltappo",
                    "created_utc": 1438013770.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cthv20e",
            "parent_id": "t3_3erzfr",
            "body": "I'm not Australian (and I also know nothing about cricket), but I would name [Ian Thorpe](https://en.wikipedia.org/wiki/Ian_Thorpe) as the greatest Australian athlete ever.  The man won 5 Olympic Gold Medals, 3 Silvers, and 1 Bronze, plus many more medals at other world class competitions like the Commonwealth Games, the Pan Pacific Swimming Championships, and the World Aquatics Championships.  He set the world record in 5 different events (200 m freestyle, 400 m freestyle, 800 m freestyle, the 4x100 m freestyle, and the 4x200 m freestyle).  At his prime, he was considered the best swimmer in the world, and even now he is listed among the best to ever have existed.",
            "author": "Crayshack",
            "created_utc": 1438012788.0,
            "replies": [
                {
                    "name": "t1_cthvivo",
                    "parent_id": "t1_cthv20e",
                    "body": "I'm a big fan of Thorpedo but after Perry continuous national championship wins and international rankings I would say she would be at least equally successful in cricket as Thorpe in swimming, so to add her success in soccer as well I would put her on top.",
                    "author": "eltappo",
                    "created_utc": 1438013501.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cti0gjr",
            "parent_id": "t3_3erzfr",
            "body": "*Note I'm not anti-women or online troll\n\nI'm sorry, but male and female sports athletes can't be compared.\n\nAny of the top 50-150 male ATP players would beat her 9.5 out of 10 times, there are huge differences in the sport.\n\n1. The average serve for at the 2015 Wimbledon Finals for a Female(I saw the stat during a Semi-Final game) was 94MPH while the males was 124MPH. That's a huge difference, the fastest ever female serve was 131 while the males fastest serve was 163MPH, Cilic, Groth, Karlovic, Raonic, and Roddick all of those players average first serve is above [124MPH](http://heavytopspin.com/2011/10/13/us-open-serve-speed-by-player/).\n\n2. Females play best to 2 sets and men play best to 3 sets\n\n3. It was tested in Battle of the sexes tennis game where Bobby Riggs(Former number 1) at age 55 played 30 year old Margrett Court(Ranked 1 at the time) and she lost in straight sets. Note he latter played King age 26 who beat him at age 56,(He couldn't get any drop shots, but still forced a 3rd set.)\n\n4. Serrnia said in 1998 at the age of 16 that she could beat and male under 200, Karsten Braash responded ranked 203 that he would play her, and she accepted and lost (6,1 6,1)(Note: She won the US open in 1999). Venus then challenged him and lost (6,2)(6,2).\n\nBaraash said he played like a 600th ranked player to keep the game fun.\n\n\nAlso the whole Female World Cup players should be paid the same is total BS in my opinion for two reasons\n\n1. The Female World Cup was projected to bring in 26M viewers while the Male World Cup brought in 800M-1B people(Note: That some countries don't have good reporting standards so the numbers are off.)\n\n2. The Female World Cup brought in $40M Ad revenue while the 2015 male World Cup brought in $4B which is 100x more and thats why the Mens side is paid more.\n\nIn my opinion its insulting to women to pay them the same as the male tournament if they didn't earn it.\n\nIf they want the same tournament winnings they should be advocating for a single tournament not two different tournaments. The same with Tennis if you want to compare Serrna to the male version you should be pushing for a single tournament.\n\nYou cant say female athletes are better, because they dont have the same ability as men, do to physical ability.\n\nYour watching her compete againist women and since shes good you expect her to do as good againist men, but that never happeans the 2015 US Womens team lost to the top Mens High School Team in the country.http://forums.bigsoccer.com/threads/uswnt-vs-u-17-usmnt.1939180/\n\n\nThe 2010 Canada Womens Team(Won the gold medal that year.) Played in the Alberta Tripple Midget AAA Hockey League and came second last. Note they played 1/2 the amount of games, but even if they won the remainding half they still would of came in 3rd-4th.\n\nhttp://www.forbes.com/sites/mikeozanian/2014/06/05/the-billion-dollar-business-of-the-world-cup/\n",
            "author": "ehImCanadian",
            "created_utc": 1438020650.0,
            "replies": [
                {
                    "name": "t1_ctiqpyy",
                    "parent_id": "t1_cti0gjr",
                    "body": "I think when comparing male and female athletes what we're talking about is comparing their relative mastery of their sport(s), against their peers, not each other.",
                    "author": "alexi_lupin",
                    "created_utc": 1438066550.0,
                    "replies": []
                },
                {
                    "name": "t1_ctirofz",
                    "parent_id": "t1_cti0gjr",
                    "body": "I understand that but in sports like cricket and soccer I essentially count the male and female sports as two different sports, just with the same rules.\n\nAn athlete's success is judged compared to their peers and competition and she was excelled above and beyond her both easily. I will fully accept that if she were accepted into the mens team she would not be successful I don't think that means anything because she is successful in her field.",
                    "author": "eltappo",
                    "created_utc": 1438069865.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_ctik4jm",
            "parent_id": "t3_3erzfr",
            "body": "is this ignoring Bradman? the greatest cricketer ever - who was also state champion in squash in his spare time, awesome at billiards, and was a phenomenal golf player well into his 80's",
            "author": "chubbyurma",
            "created_utc": 1438051793.0,
            "replies": [
                {
                    "name": "t1_ctiroy7",
                    "parent_id": "t1_ctik4jm",
                    "body": "Interesting, I actually didn't know that about his squash and golf. Was he just very good at golf or did he ever go into competitions or something?",
                    "author": "eltappo",
                    "created_utc": 1438069920.0,
                    "replies": [
                        {
                            "name": "t1_ctirqh6",
                            "parent_id": "t1_ctiroy7",
                            "body": "i dont think he did, but i do know when he was about 16 he temporarily gave up cricket for tennis for 2 years.\n\nhe also got a 50 in the first cricket game he ever played (i think he was about 8 or something) and got his first century in his second game in his life, and i think took 8 wickets in the same match.",
                            "author": "chubbyurma",
                            "created_utc": 1438070084.0,
                            "replies": [
                                {
                                    "name": "t1_ctita17",
                                    "parent_id": "t1_ctirqh6",
                                    "body": "oh shit, he bowled? That's really cool, thanks for that",
                                    "author": "eltappo",
                                    "created_utc": 1438076455.0,
                                    "replies": [
                                        {
                                            "name": "t1_ctjtyd2",
                                            "parent_id": "t1_ctita17",
                                            "body": "he didnt bowl so much in test cricket, but i think he did in grade and club quite a bit",
                                            "author": "chubbyurma",
                                            "created_utc": 1438138966.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ctisowf",
            "parent_id": "t3_3erzfr",
            "body": "Jack Brabham is the only person to ever win a Formula One world championship driving a car built himself. We will have athletes in the future superior to what we've had in the past for any sport discipline but Jacks achievement will almost certainly never be repeated.",
            "author": "mikestp",
            "created_utc": 1438073921.0,
            "replies": []
        }
    ]
}