{
    "name": "t3_3etduv",
    "title": "CMV: Frieza unintentionally saved the universe by destroying planet Vegeta and exterminating the Saiyans",
    "body": "Frieza was a psychotic mass murderer and tyrant but was generally very collected emotionally. Rather than destroy planets for pure entertainment he cleared them out and sold them to species with a need for a new world. It was evil of course, but there was a certain logic to it and seeing as he was just one tyrant in the vastness of the universe it was somewhat unlikely that he'd ever find your world. \n\nHad he not destroyed the Saiyans every other species in the galaxy or universe would have been destroyed.\n\nSaiyans are completely insane. Had Goku not been raised by humans his and his father's ridiculous powers would have been used, more likely lazily guided, by King Vegeta to commit relentless genocide. Saiyans double their power after they almost die, they can turn into giant apes so powerful that five can exterminate all life from one planet, and for whatever reason they can continuously transform into more and more powerful beings. Their ability to turn super saiyan seems to be rather easy if they face enough significant challenges, and their singular interest in combat ensures that they will meet more threats and, rather than get crippled or exhausted, they will only get more powerful after each challenge. Further they don't seem to age as most creatures do, remaining with the physique of a thirty year old well into their autumn years.\n\nIt would appear that the Saiyans were a relatively young species by the time Frieza destroyed them. They conquered planet Tuffle from a nearby moon and established themselves as a civilized species all within the reign of the first and last King Vegeta, going on to introduce themselves to nearby worlds with mass destruction and genocide. Goku and Vegeta's unlimited strength would suggest that eventually, if the Saiyans survived as a species, there could be hundreds of Super Saiyan 3's and 4's wreaking havoc all over the galaxy for no reason other than pure sport. Broly, yet another powerful Saiyan, appears capable of destroying several worlds in a matter of minutes without even needing a spaceship.\n\nIn essence, given a few centuries of constant battle, there would have been thousands of Super Saiyans with the same world-destroying power of Frieza. While he destroyed the species for his own selfish reasons and fears he ensured that, for a time, he was the only individual besides Broly (and later Buu) capable of destroying worlds with ease. This ensured that, statistically, the likelihood of having your world destroyed in the largeness of the universe by one of these three individuals was quite low. \n\nNow imagine billions of Saiyans, billions Brolys Gokus and Vegetas, billions of relentlessly bloodthirsty fighters, capable of transforming into giant apes and having unlimited power ups, fighting and killing purely for the insatiable thrill and fun of it. Goku and Vegeta, even after becoming righteous individuals, clearly demonstrate no interest beyond fighting and eating. Sex, pursuit of knowledge, spending time with family, art... these are at best tertiary interests. Frieza, at the very least, enjoyed having his much weaker minions do much of his fighting for him meaning theoretically one could be spared genocide by a chance encounter with him. There is no avoiding genocide after a Saiyan scouting party discovers your world. \n\nIf in the infinite vastness of the universe there was a planet Vegeta that shared it with our Earth, ideally far away from the Earth Goku eventually landed on with its King Dogs and Dragon Balls chances are we would have been exterminated for no reason beyond the amusement of a species of irreconcilably insane monsters; and Frieza's atrocity spared us all. \n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "MordorsFinest",
    "num_comments": 22,
    "created_utc": 1438029770.0,
    "url": "http://www.reddit.com/r/changemyview/comments/3etduv/cmv_frieza_unintentionally_saved_the_universe_by/",
    "comments": [
        {
            "name": "t1_cti7etg",
            "parent_id": "t3_3etduv",
            "body": "you completly overlook that frieza's henchman were stronger then most saiyans, that supersaiyan was legendary not an every day occurance. that we had dragon balls capable of fundamentally altering reality.  sure they might have put up a fight against most lesser beings, but beings like majin buu they would have been exterminated, hell even cell could wipe most of them out and he was a creation of some human dude",
            "author": "jumpup",
            "created_utc": 1438030767.0,
            "replies": [
                {
                    "name": "t1_cti7mh5",
                    "parent_id": "t1_cti7etg",
                    "body": "Bear in mind the Saiyans were a young species. In King Vegeta's lifetime they went from cavemen to a spacefaring race of conquerors. Before that they only had each other to fight, by King Vegeta's midlife the two most powerful Saiyans: Broly and Goku were already infants and the Saiyans were becoming stronger as a species by fighting everything in the universe. \n\nIf Frieza didn't destroy them and Broly, for one, probably at even 5 or 6 years old  could have killed Frieza's henchmen and maybe Frieza himself. Frieza had excellent timing, if he waited even one decade Broly could have destroyed him and presumably Goku could have too.\n\nOne more decade? Goku and Vegeta killed Buu who was several times more powerful than Frieza. Give them an army of 100 Saiyans all presumably capable of going Super Saiyan...hell even the halfbreeds had no trouble! \n\nFrieza and his henchmen were more powerful than the Saiyans on the eve that they destroyed planet Vegeta, but the timing was perfect, Frieza was right to believe that the Saiyans could have become more powerful than him in a very short time. ",
                    "author": "MordorsFinest",
                    "created_utc": 1438031087.0,
                    "replies": [
                        {
                            "name": "t1_cti8bg0",
                            "parent_id": "t1_cti7mh5",
                            "body": "you forget that Goku was born weak, random wildlife could force him to flee.   its only after he put on his plot armor that he managed to get so strong, because lets face it most people don't survive that many brushes with death, not even he did.\n\nand while broly's power may have been high at birth he was a ones in a thousand years event and 10000 power level was something goku had while defeating napa\n\nbasicly your taking the exceptional cases and considering them baseline.\n\nhell broly should have died simply because of politics even if freiza didn't off the planet, \n\n",
                            "author": "jumpup",
                            "created_utc": 1438032151.0,
                            "replies": [
                                {
                                    "name": "t1_ctiqgmx",
                                    "parent_id": "t1_cti8bg0",
                                    "body": "He was weak because he hit his head and was raised by humans. If he wasnt he would have been violent.\n\nAlso Broly as an infant had that crazy power. And while King Vegeta did have him killed before trying to take on Frieza there's a chance that he would have unleashed Broly on Frieza first. Assuming Frieza felt like killing the Saiyans.",
                                    "author": "MordorsFinest",
                                    "created_utc": 1438065719.0,
                                    "replies": [
                                        {
                                            "name": "t1_ctirspu",
                                            "parent_id": "t1_ctiqgmx",
                                            "body": "he was born with a powerlevel of 2\n\nand even if infant broly was used he would be crushed, it wasn't untill later that he became strong\n\nalso goku was pretty much an adult when napa kicked his ass, meaning that even with fighting most of his life he wasn't especially strong",
                                            "author": "jumpup",
                                            "created_utc": 1438070319.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cti9udc",
            "parent_id": "t3_3etduv",
            "body": "I'm actually hard-pressed to name a villain that threatens Earth that isn't directly Goku's fault.\n\nRaditz came for his brother.\n\nWho brought Vegeta/Nappa down on them because they spilled the secret of the Dragon Balls.\n\nWhich also brought Freiza to Namek for the same reason.\n\nThe Androids and Cell were built to fight Goku and Cell even had Saiyan DNA...\n\nBabadi was able to unseal Buu using Vegeta and Goku's energy...\n\nSo...\n\n[There's really only one *true* threat to the universe.](http://41.media.tumblr.com/ae277f5203414eb557bb31b9b84e2371/tumblr_n0e62yYACr1s267ado1_500.jpg)",
            "author": "DO_YOU_EVEN_LIFT_BRO",
            "created_utc": 1438034492.0,
            "replies": [
                {
                    "name": "t1_ctiqgzn",
                    "parent_id": "t1_cti9udc",
                    "body": "This sort of lends credence to my point that the Saiyans are nothing but trouble",
                    "author": "MordorsFinest",
                    "created_utc": 1438065749.0,
                    "replies": [
                        {
                            "name": "t1_ctiu1k5",
                            "parent_id": "t1_ctiqgzn",
                            "body": "Except if frieza didn't kill planet vegetable, it wouldn't happen.",
                            "author": "DO_YOU_EVEN_LIFT_BRO",
                            "created_utc": 1438079608.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_ctitysx",
                    "parent_id": "t1_cti9udc",
                    "body": "Thats literally why he decided to stay dead. Because all problems were indirectly from him",
                    "author": "AnthonyMimming",
                    "created_utc": 1438079307.0,
                    "replies": []
                },
                {
                    "name": "t1_ctj3ddp",
                    "parent_id": "t1_cti9udc",
                    "body": "All the villains in Dragonball were not the fault of Goku. King Piccolo, RRA, Tao, Tien, Pilaf. ",
                    "author": "broccolibush42",
                    "created_utc": 1438098959.0,
                    "replies": [
                        {
                            "name": "t1_ctj6yke",
                            "parent_id": "t1_ctj3ddp",
                            "body": "They're humanity's problem, not Earth's problem, not the universe's",
                            "author": "DO_YOU_EVEN_LIFT_BRO",
                            "created_utc": 1438104109.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ctic8vk",
            "parent_id": "t3_3etduv",
            "body": "I think that Goku, Vegeta, Broly, and their offspring were the exceptions rather than the rule. Something about them (genetics?) made them far more powerful than the rest of their race.\n\nThe most obvious reason for this: it had been 1,000 years since the last Super Saiyan.\n\nIn other words, the Saiyans *knew* about Super Saiyans, but, in spite of 1,000 years of warfare and bloodshed, they had never managed to produce another one. They were so weak that even all of them *together* were unable to stop Frieza.",
            "author": "warsage",
            "created_utc": 1438038434.0,
            "replies": [
                {
                    "name": "t1_ctidpo5",
                    "parent_id": "t1_ctic8vk",
                    "body": "This is the delta that OP is looking for.\n\nOP's argument is based on the idea that the Sayins are a young race, when in reality they have been around for longer than 1,000 years.",
                    "author": "gdubrocks",
                    "created_utc": 1438040925.0,
                    "replies": []
                },
                {
                    "name": "t1_ctiqjtn",
                    "parent_id": "t1_ctic8vk",
                    "body": "I'm not sure if we can take Saiyan historical records so accurately, they seem to have been cavemen until King Vegeta led them to planet Tuffle and may have been illiterate. \n\nYou're right that the three: Vegeta jr, Goku, and Broly are anomalies but its primarily because their species was wiped out and they were lucky enough to have had strong opponents.\n\nTheir whole species only died because Frieza destroyed their planet, but if all of them followed King Vegeta into battle they may have won. As i said Frieza's timing was excellent. The three most powerful Saiyans were infants or children, if he waited 10 years he would have had a more serious resistance.",
                    "author": "MordorsFinest",
                    "created_utc": 1438065998.0,
                    "replies": [
                        {
                            "name": "t1_ctj3lil",
                            "parent_id": "t1_ctiqjtn",
                            "body": "You're absolutely wrong. Canonically, the scene where Frieza blows up the planet, is where he is confronted by Bardock, Goku's father, and a number of other Sayians who followed Bardock up there to stop him. Frieza swept all these guys aside as if they were ants. The blast that killed the planet just evaporated all those Sayians. And that was just Frieza's first form, and he didn't even get out of his hovering chair. ",
                            "author": "broccolibush42",
                            "created_utc": 1438099281.0,
                            "replies": [
                                {
                                    "name": "t1_ctj3vaw",
                                    "parent_id": "t1_ctj3lil",
                                    "body": "actually Bardock was on his own. ",
                                    "author": "MordorsFinest",
                                    "created_utc": 1438099672.0,
                                    "replies": [
                                        {
                                            "name": "t1_ctj423x",
                                            "parent_id": "t1_ctj3vaw",
                                            "body": "You're right, my bad, it was actually all of Frieza's henchman. I just remembered that they all had the same armor. However, even with all those henchman, they were still blasted away with ease. Power in numbers didn't matter to Frieza. ",
                                            "author": "broccolibush42",
                                            "created_utc": 1438099948.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_ctiegbw",
            "parent_id": "t3_3etduv",
            "body": "There are many other powers in the universe that would have been capable of destroying the Sayins.\n\nThe gods of destruction's job was to destroy planets to maintain balance in the universe and so if the Sayins got too strong it would have probably been Beerus who eliminated them.\nhttp://dragonball.wikia.com/wiki/God_of_Destruction\n\nFurthermore at the end of the Tuffle-Sayin war Baby was created, who would have been able to handle the super Sayins.\n\nIf Goku, Broly, and Vegeta had never come to earth they would not have faced the same threats they faced and wouldn't have been able to defeat either of the previously mentioned threats.\n\n",
            "author": "gdubrocks",
            "created_utc": 1438042164.0,
            "replies": []
        },
        {
            "name": "t1_ctilqsl",
            "parent_id": "t3_3etduv",
            "body": "For this discussion, we have to carefully examine canon. Broly isn't part of it, and Baby/DBZ GT is out.\n\nWhat we *do* have is a huge theme and one single direct line, given by Goku: *The greater the opponent, the more I rise up.* (or something to that effect). In other words, he matches new challenges. \n\nIf you take a look at the Saiyans, they were all weaker than Frieza's main henchmen until Goku and Vegeta started 'rising up to meet the challenge' on a one-on-one basis against each other and against enemies like Pui Pui, Dodoria, Zarbon, and then the Ginyu Force. Every single one of these fights ended in severe injury and near death, but then an opportunity for Zenkai followed.\n\nThere's a small window of opportunity in a race that gets stronger in response to challenges. If the enemy is too weak, then there's no advancement; if the enemy is too strong, the Saiyan just dies.\n\nThus, Goku and Vegeta (and their children) are not exceptions to the rule at all, but rather extremely lucky to progressively face tougher foes on a step by step one-on-one basis.\n\nYou can see this window of opportunity *being missed* when Vegeta powers up after the Ginyu Force fight and is able to match first-form Frieza. Frieza transforms and gets stronger, and Vegeta simply loses. He survives with Dende's healing, and would be able to match second and third form Frieza for sure - but he fails again! Because Frieza's final form is just too strong. This is how most Saiyans would meet their end. He just happens to be revived by the Dragonballs later.\n\nSo the Saiyan race would not have simply all continued to get stronger to the point of threatening the universe. A great many of them would have gotten in fights over their heads and died; more would have picked on weaker races and failed to advance. Only a very small number of procedurally lucky fighters advance to levels like Goku and Vegeta.\n\nIn fact, Goku and Vegeta's luck ran out. They both died at various points. It's only the Dragonballs that are truly responsible for continuing their step-by-step slightly-stronger-enemy faceoffs. What we witness in DBZ is a race's tragic cultural flaw getting them into fights over their capabilities until they all get killed. Fighting people stronger than you is a Saiyan's best opportunity for advancement *and* greatest risk. Eventually, your luck runs out, and Saiyans were culturally bred to just be okay with that fact.\n\nFrieza couldn't count on luck, though. He saw their Zenkai enemy-matching ability and destroyed them to completely prevent it from getting out of control. ",
            "author": "commenter6",
            "created_utc": 1438054701.0,
            "replies": [
                {
                    "name": "t1_ctjbe5j",
                    "parent_id": "t1_ctilqsl",
                    "body": "Nit picking becuse I am watching the entirety of DBZ again Pui Pui was  the useless dude Vegeta killed in the Majin saga. Cui was the guy Vegeta killed on Namek and was already stronger.\n\nBy having absurdly strong fighters on earth the entire universe had threats from exclusively on earth. Frieza was know through the Galaxy for his strength but after his death all new threats came from earth. You get Cell who would built to kill Goku and was far more powerful than Freiza and Majin Buu was reborn so quickly and effectively because  because the earth has those few super warriors. If Frieza just let the Saiyans exist and instead of using them as shock troops and had them work on something like science or tech instead the Zenkai boost would not be a real threat. ",
                    "author": "Raptor_man",
                    "created_utc": 1438110198.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_ctiq2mi",
            "parent_id": "t3_3etduv",
            "body": "We don't have access to a control universe where the Saiyans were never destroyed by Frieza, therefore we don't have enough evidence to conclude that the Saiyans would have posed a threat to life in the universe.",
            "author": "[deleted]",
            "created_utc": 1438064559.0,
            "replies": []
        },
        {
            "name": "t1_ctj0fio",
            "parent_id": "t3_3etduv",
            "body": "Remember that story King Kai told Goku about the saiyans and those other guys who lived in the same planet?\n\nThe other guys were weaker but smarter. The saiyans were strong, but stupid. They didn't have the technology to travel to other planets and fuck shit up.\n\nUntil Frieza hired them...",
            "author": "sir_pirriplin",
            "created_utc": 1438094587.0,
            "replies": []
        }
    ]
}