{
    "name": "t3_32qyul",
    "title": "CMV: The last episode of Breaking Bad was pretty lame.",
    "body": "Like many of you, I never anticipated a single TV episode as highly as the finale of *Breaking Bad*, and after all this time has passed I still think it was a lame ending. My reasons:\n\n* It turned Walter from an evil criminal back into an avenging hero, not for the sake of the narrative but to please the broadest possible fan base.\n* Jesse's final scene suggested a positive, if ambiguous, future for the character however he has no money, friends, or family left so it's actually quite depressing if you think about it. I don't believe the scene of his euphoric 'escape' is meant to be ironic in that sense, but instead another attempt to please fans. \n* The suggestion that Walter is redeemed in any way by returning to save Jesse ignores the one completely unforgivable thing (IMO) Walter and Jesse did: help cover up the murder of a child. \n* Walter's trunk-gun plan was not completely improbable, but improbable enough that it shouldn't have been the final action setpiece of the series. \n* Concerning Walter's \"I did it for me\" speech ... Are we meant to understand that, at the end of the day, Walter did what he did not necessarily for money or power but for the love of cooking meth / being a chemist? I kinda feel like they pulled that one out of their asses to - again - leave us feeling more sympathy for the character than we should all things considered.  \n\nIf I've made any plot errors please let me know, otherwise CMV! \n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "ANewMuleSkinner",
    "num_comments": 17,
    "created_utc": 1429144035.0,
    "url": "http://www.reddit.com/r/changemyview/comments/32qyul/cmv_the_last_episode_of_breaking_bad_was_pretty/",
    "comments": [
        {
            "name": "t1_cqdsby9",
            "parent_id": "t3_32qyul",
            "body": "To address a few points in no particular order:\n\nWhat you call euphoria I think I'd call something closer to hysteria. That was not the laughter of a happy man, that's the laughter of a man who has gotten out of terrible situation and now has a way to move forward. That said, he still has at least two friends out there, and he knows an illegal but valuable trade, so it's reasonable to assume he scraped his life together sort of.\n\nThe \"I did it for me\" was to highlight Walter's obsession with being a provider. He did what he did out of duty for his family, out of a desire to help them, but it wasn't really about that, at least at the end. It was about taking his last chance to be something he'd never been. To be the best, to be in control, to leave a legacy.\n\nI won't touch the trunk-gun thing because that's subjective. If it broke your suspension of disbelief, I don't think I can change your view on that.\n\nBut ultimately, I don't think it was about redemption, it was about revenge, and again, about being a provider for the man Walter pretty clearly saw as surrogate family, especially after the rest of his family rejected him.",
            "author": "MrCapitalismWildRide",
            "created_utc": 1429144455.0,
            "replies": [
                {
                    "name": "t1_cqdsvuv",
                    "parent_id": "t1_cqdsby9",
                    "body": "&gt; That said, he still has at least two friends out there, and he knows an illegal but valuable trade, so it's reasonable to assume he scraped his life together sort of.\n\nOr he's just going to end up dead or in jail .. He still hasn't regained control of his life in any meaningful way. He didn't have much if anything to do with earning back his physical freedom. In any event I don't think the scene was written / shot in a way that acknowledges the serious lack of closure for Jesse, but just tries to leave us on a 'high note'. \n\n&gt; But ultimately, I don't think it was about redemption, it was about revenge, and again, about being a provider for the man Walter pretty clearly saw as surrogate family, especially after the rest of his family rejected him.\n\nRevenge that was not hollow, as it should have been, but targeted at characters who were clearly and unquestionably antagonistic. Walter's final revenge was deliberately constructed so that we'd be completely on his side for the first time since many seasons prior. That was a cop-out on the part of the writers. ",
                    "author": "ANewMuleSkinner",
                    "created_utc": 1429145327.0,
                    "replies": [
                        {
                            "name": "t1_cqdx36p",
                            "parent_id": "t1_cqdsvuv",
                            "body": "would you have preferred the last episode just be the climax, ozymandius? ",
                            "author": "[deleted]",
                            "created_utc": 1429151915.0,
                            "replies": [
                                {
                                    "name": "t1_cqdxbtc",
                                    "parent_id": "t1_cqdx36p",
                                    "body": "Well that's hard to say. Obviously it wasn't supposed to be the ending so as is no, but the tone of it was certainly closer to what I expected for the finale.",
                                    "author": "ANewMuleSkinner",
                                    "created_utc": 1429152294.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "name": "t1_cqe291p",
                            "parent_id": "t1_cqdsvuv",
                            "body": "",
                            "author": "",
                            "created_utc": NaN,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cqdsobc",
            "parent_id": "t3_32qyul",
            "body": "&gt; Jessie...no money, friends, or family left so it's actually quite depressing if you think about it. I don't believe the scene of his euphoric 'escape' is meant to be ironic in that sense, but instead another attempt to please fans. \n\nread interviews from Gilligan and co post Breaking Bad. They pretty much agree with you. However, it's the most realistic \"nice ending\" he could get. Sure his life sucks but 1. he's free that means he's no longer a meth slave!!! and 2. he showed real agency rejecting Walter White's demands for perhaps the first time. \n\n&gt; but for the love of cooking meth \n\nthat's not what i took away from that speech. \"i did it for me\" is admitting he did it for himself, for the power, money, status, etc. He's confessing his sins and achieving a brief true reconcilliation. \n\n\n&gt; It turned Walter from an evil criminal back into an avenging hero\n\nto be fair remember why Walter goes back. He doesn't go back to save Jessie, he goes back because he sees baby blue and thinks Jessie is working with the nazis. He has a change of heart only after he sees Jessie. Before he's going out in a blaze of glory motivated by his supervillian thoughts. \n\nAnyways Ozymandius king of kings look upon my works ye mighty and despair   was the \"real\" ending of Walter White supervillian. The last episodes see Walter as a broken man who sort of turned a corner. \n\n\nthat being said: it's clear God-showrunner granted him a \"perfect\" final couple of days and it's not clear how it makes sense that for instnace he gets into skylar's house without being detected. he gets more redemption than he deserves but the way i make sense of it is to think of it as the epilogue with ozymandius being the finale and it functions the same way the end and epilogue of say \"crime and punishment\" does.  ",
            "author": "[deleted]",
            "created_utc": 1429144989.0,
            "replies": [
                {
                    "name": "t1_cqdtctp",
                    "parent_id": "t1_cqdsobc",
                    "body": "&gt; However, it's the most realistic \"nice ending\" he could get.\n\nBut why? Why does he or Walter deserve a nice ending at all? They've done horrible, unforgivable things, and up until that point the show was toying with our sympathies for them. In the end the writers stopped toying and just gave in to what they thought the audience wanted (and by most peoples' reactions, they were right) 'realistic' or not. \n\n&gt; He has a change of heart only after he sees Jessie.\n\nOkay, but he still has that change of heart and I don't think it was a change that made sense in terms of the character's arc and the show's themes. Again I think it was designed with the audience - not the story - first in mind. I guess it comes down to whether you want an artist to follow their creative instinct or just make the highest number of people happy. ",
                    "author": "ANewMuleSkinner",
                    "created_utc": 1429146051.0,
                    "replies": [
                        {
                            "name": "t1_cqdub6o",
                            "parent_id": "t1_cqdtctp",
                            "body": "",
                            "author": "",
                            "created_utc": NaN,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cqdtvt5",
            "parent_id": "t3_32qyul",
            "body": "Lame compared to what?  What is a finale that you found highly satisfying?\n\nThere are a couple reasons why these never live up to expectations.\n\n1) Once a show gets big, showrunners and the network are in a tug of war over how long it should continue.  Showrunners tend to want to end the show more quickly and efficiently, whereas the network wants to drag things out (because more episodes creates more money).  Breaking Bad is a good example of this.  You have the main antagonist (Gus) killed off in season 4, but there is still more airtime to fill, so the show has to build up a whole new (less intense and shorter) story with the White Power guys.  No finale in which Walt confronts the White Power guys could have been as powerful as the end of Gus.\n\nRelated to this is the Chekov's gun problem.  If you hang a gun on the wall in Act 1, someone has to fire it by Act 3.  As shows get dragged on in unnatural ways, especially shows with commercial breaks, you need to write in lots of cliffhangers, which often involve introducing new dimensions to the story (see: Lost).  This can easily get away for you and you end up leaving a bunch of loose threads or create continuity errors (see: Lost).  Breaking Bad ties up pretty much every plot and prop point though (i.e., the ricin).   \n\n2) Classically, narratives have a certain structure: rising action, climax, falling action, denouement (reflection).  In serial TV, the big problem is that everyone wants the finale to be a huge, blockbuster episode.  But, it isn't supposed to be.  You are supposed to have the huge climax sometime before the last hour of a 40+ hour story.  Really, the last episode should be pretty calm and character-driven (think everything in Lord of The Rings after they drop the ring in the mountain).    \n\nBreaking Bad actually dealt with falling action and denouement better than most shows.  You have the showdown in Ozymandias with Hank and, then a few episodes of Walt reflecting in New Hampshire.  But because the finale needs to have some sort of major climactic event, the show needed to build in the whole White Power showdown.  Basically, it is a very tough needle to thread, and Breaking Bad probably did it better than most.  Sopranos didn't even try.\n\n",
            "author": "gulliblegambler",
            "created_utc": 1429146890.0,
            "replies": [
                {
                    "name": "t1_cqdug1h",
                    "parent_id": "t1_cqdtvt5",
                    "body": "&gt; Lame compared to what?\n\nCompared to any ending that would have acknowledged what an awful, unforgivable person Walter White was without asking us to root for him again. \n\n&gt; What is a finale that you found highly satisfying?\n\nMost of the other shows I've watched in this \"New Golden Age of Television\" ended somewhat prematurely (*Deadwood*, *Carnivale*, *Boardwalk Empire*) but I thought the ending of *The Sopranos* was just fine. It was completely in line with what the show had been building toward thematically. It ended on a note both ambiguous and totally inevitable. It challenged the audience without dumbing itself down. \n\n&gt; No finale in which Walt confronts the White Power guys could have been as powerful as the end of Gus.\n\nDoes this contradict my view? Is your point that the show could never have finished perfectly because it continued on after it should have ended? ",
                    "author": "ANewMuleSkinner",
                    "created_utc": 1429147794.0,
                    "replies": [
                        {
                            "name": "t1_cqdv9uh",
                            "parent_id": "t1_cqdug1h",
                            "body": "&gt;Compared to any ending that would have acknowledged what an awful, unforgivable person Walter White was without asking us to root for him again.\n\nIn this whole genre of semi-ensemble \"golden age of TV\" shows, which began with the Sopranos and includes Breaking Bad, Dexter, Mad Men, Boardwalk Empire, Ray Donovan, Tudors, Weeds, Girls (sort of), the writer's central thesis is: can we make you root for a terrible person, just by making them the main character/telling the story from their point of view?  Is this enough to make you compromise your morals?\n\nThis is a big part of why these shows are engaging.  The audience ends up fighting this battle where they have to resist identifying with someone who is doing horrible things.  The way the show gets you to do this emotional/intellectual work is why you keeping tuning in.  \n\nSo, it wasn't really that they asked you to root for Walt again at the end.  They were asking you to root for Walt the whole time.  Maybe you were resisting well, but they got to you in the end, and that frustrates you.   \n\n&gt;Does this contradict my view? Is your point that the show could never have finished perfectly because it continued on after it should have ended?\n\nSort of.  I'm saying that I think you are comparing the show to an idealized, but not really possible, ending.  In the real-world of television production, Breaking Bad actually wrapped up relatively well.  ",
                            "author": "gulliblegambler",
                            "created_utc": 1429149091.0,
                            "replies": [
                                {
                                    "name": "t1_cqdvtmx",
                                    "parent_id": "t1_cqdv9uh",
                                    "body": "&gt; In this whole genre of semi-ensemble \"golden age of TV\" shows ... the writer's central thesis is: can we make you root for a terrible person, just by making them the main character/telling the story from their point of view?\n\nWhile we're seeing this idea on TV more and more lately, it's hardly new. You can find it throughout the works of Dostoevsky and Shakespeare. Point being it's been done better many times before. \n\nThe problem is that the show clearly wanted us to *start out* rooting for Walter, then spent a *lot* of time and effort making him unsympathetic ... until at the end we're supposed to kind of like him again? The question of *why* the writers turned back, so to speak, at the end is very important and I've answered it for myself a few times here.\n\n&gt; Maybe you were resisting well, but they got to you in the end, and that frustrates you. \n\nNot really. I was definitely curious to see what happened to the character but I had no interest whatsoever in seeing him redeemed or excused. I'm perfectly capable of being interested in what happens to a character without rooting for them. I just sat through *The Jinx* and while there were moments when Robert Durst seemed somewhat human / pitiable I still wanted him to be punished unequivocally. ",
                                    "author": "ANewMuleSkinner",
                                    "created_utc": 1429149967.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "name": "t1_cqdvgx3",
            "parent_id": "t3_32qyul",
            "body": "&gt;Concerning Walter's \"I did it for me\" speech ... Are we meant to understand that, at the end of the day, Walter did what he did not necessarily for money or power but for the love of cooking meth / being a chemist? I kinda feel like they pulled that one out of their asses to - again - leave us feeling more sympathy for the character than we should all things considered.\n\nReally?  This was established way back in the first season when he chooses to be a meth cook instead of accepting the Elliot's money, and is further shown in season 2 when he freaks out after his cancer goes into remission because he no longer has a justification for his criminal activity.",
            "author": "Sadsharks",
            "created_utc": 1429149403.0,
            "replies": []
        },
        {
            "name": "t1_cqe3vov",
            "parent_id": "t3_32qyul",
            "body": "1. Sort of agree, not much to add\n\n2. Disagree. I think you might have read a bit too much into it. It was just to show he was back in track *but* not quite (headed Walter's way)\n\n3. I don't think that was implied so not much to add here\n\n4. Why was that so improbable? It looked believable when I saw it, especially since they made it so Walter himself gets shot by accident given the risky nature of the move.\n\n5. I think you misunderstood his speech. Walter had been living a terribly boring life until one morning he wakes up to discover he has cancer and little time to live. Yes, at the beginning it *is* about his family and the situation he's leaving them in. But 'Breaking Bad' is precisely about that - about how a father doing everything to provide for his family slowly *breaks bad* into someone who starts doing it for the thrill, to make up for his wasted life. That includes power, money, respect. It includes the recognition he never got for his genius, particularly in the Gray Matter line. That's what he meant by doing it for him, not his family or anyone else. I don't think the point of the speech was to draw much sympathy - the character already enjoyed an immensely positive relationship with the viewership. At most it could be to make us realize that Walter was aware of what he had become in spite of it all, thus making him look more human.\n\n---\n\nAll in all, decent episode, didn't blow my mind. But then again I never bothered to conceive a better ending, so I have not many issues with it.",
            "author": "snkifador",
            "created_utc": 1429167190.0,
            "replies": []
        },
        {
            "name": "t1_cqevg02",
            "parent_id": "t3_32qyul",
            "body": "The finale of Breaking Bad was 3 episodes long. In *Ozymandias*, we got to see Walt's world come crashing down around him. In *Granite State*, he was sent to a sort of purgatory, forced to finally confront the awful things he had done, instead of continually running from them. \n\n*Felina* wasn't an example of Walt becoming an \"Avenging Hero\". Only in that episode did he fully understand the extent to which his actions had ruined so many lives. He was taking his biggest skill - solving problems - and applying it to the purpose of atoning for his sins, in whatever small way he could. \n\nAs for the \"I did it for me\" speech: however thoroughly Walt had convinced himself that he was doing everything to provide for his family, the truth is it was fueled by greed, ambition, and a lifetime of feeling stifled and meek. It was entirely selfish of him to continue in the drug trade after the events of the first 3 episodes. That speech was the only time he was actually honest with Skyler - or anyone - about his motivations. ",
            "author": "feedmesweat",
            "created_utc": 1429225217.0,
            "replies": [
                {
                    "name": "t1_cqfl45t",
                    "parent_id": "t1_cqevg02",
                    "body": "",
                    "author": "",
                    "created_utc": NaN,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cqewvus",
            "parent_id": "t3_32qyul",
            "body": "&gt; It turned Walter from an evil criminal back into an avenging hero\n\nHe literally just murdered several people, poisoned Lydia, and took the fall as Heisenberg all along. It was absolutely fantastic. Don't know how you saw him as a hero.\n\nedit: Guess I should add: Killing bad guys doesn't automatically make you a hero.",
            "author": "limeade09",
            "created_utc": 1429227824.0,
            "replies": []
        }
    ]
}