{
    "name": "t3_3gxyja",
    "title": "CMV: Grandpa Joe from Willy Wonka &amp; the Chocolate Factory is a self absorbed, selfish narcissist.",
    "body": "Grandpa Joe does nothing all day except for lie in bed. As soon as Charlie comes home with the golden ticket grandpa Joe breaks out into a lengthy musical number, where he also proclaims \"I've got a golden ticket\", although it is Charlie who has a golden ticket. He also instantly invites himself to go on the tour with Charlie, completely disregarding Mrs. Bucket who works practically everyday to keep the family out of deeper poverty, and is a widow; if he's so suddenly spry he should have given his daughter, or daughter-in-law, the day off and took her place at the laundry mat for a day. While they are in the Chocolate factory, Wonka tells them to not touch anything. Of course grandpa Joe completely disregards that and almost leads Charlie and himself to their deaths after drinking the fizzy lifting drink. When Charlie was the last child standing and Wonka said that Charlie gets nothing after violating the rules, grandpa Joe almost immediately says that they are going to Slugworth to screw over Wonka. Also, when they are in the glass elevator and Wonka tells Charlie that he wants him to inherit the Factory and to live there, grandpa Joe so eloquently states \"And me?\", never mind the rest of the family. Sorry for the length, but please change my view about grandpa Joe being a narcissist.\n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "analrapist_theralist",
    "num_comments": 8,
    "created_utc": 1439529674.0,
    "url": "http://www.reddit.com/r/changemyview/comments/3gxyja/cmv_grandpa_joe_from_willy_wonka_the_chocolate/",
    "comments": [
        {
            "name": "t1_cu2hzxm",
            "parent_id": "t3_3gxyja",
            "body": "Your view hinges on whether you accept the psychological definition of narcissist, which is \"a person who suffers from narcissism, deriving erotic gratification from admiration of his or her own physical or mental attributes.\"\n\nAs the movie made clear, G-Joe derived no pleasure from his limited physical attributes, and likely even less pleasure from his severely limited mental attributes. He basically sat in bed all day, and achieved nothing. It would be accurate to describe G-Joe as an idiotic inattentive asshole. :)\n\nEdit: I think it was G-Joe who gave Charlie the money to buy that chocolate in the first place. I may be wrong about his part, so please correct me if I've misremembered.",
            "author": "RustyRook",
            "created_utc": 1439530657.0,
            "replies": [
                {
                    "name": "t1_cu2s644",
                    "parent_id": "t1_cu2hzxm",
                    "body": "To your edit, Charlie found a dollar in the gutter to but the golden ticket bar.",
                    "author": "KrustyFrank27",
                    "created_utc": 1439561973.0,
                    "replies": [
                        {
                            "name": "t1_cu2w6p8",
                            "parent_id": "t1_cu2s644",
                            "body": "True, but Grandpa Joe did give up his money for the second candy bar (the first was a birthday gift and the third golden ticket bar was gutter money).\n\nJoe was willing to give up probably the only thing in his life that he enjoyed - his tobacco - just so Charlie could have a few extra moments of hope of finding a golden ticket.  That is pretty altruistic.",
                            "author": "Ansuz07",
                            "created_utc": 1439568412.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "name": "t1_cu2vmyi",
                    "parent_id": "t1_cu2hzxm",
                    "body": "I'm using narcissist in the sense of Grandpa Joe being selfish and self-interested. Also, I may be slightly contradicting myself, but in the movie Grandpa Joe seemingly doesn't stay in bed all day, he has a secret stash of chocolate (in the book a secret coin purse). Grandpa Joe also accepts what little money Charlie has and gives him for his tobacco habit. He is also always saying he is going to get out of bed and contribute to the household, but of course he never does until something worthwhile happens, i.e. going to Willy Wonka's Chocolate Factory. ",
                    "author": "analrapist_theralist",
                    "created_utc": 1439567573.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cu2l0t2",
            "parent_id": "t3_3gxyja",
            "body": "Grandpa Joe had depression.  He had nothing to live for in his miserable, bread-sandwich eating life.\n\nHe was resigned to his fate.  The guy's at the end credits of his life and he's got nothing.  He's a failure.  The point of a parent's life is to make their kid's life turn out at least a little better than theirs and the water soup his daughter made him for lunch is hard proof that he wasted his life.\n\nDepression is a bitch of a drug.  Some days, yes, you can't get out of bed.\n\nAnd Charlie comes home and basically faith-heals his depression with a jolt of endorphins at seeing his grandson happy for the first time in years and years.\n\nIt makes more sense that Grandpa Joe was faking the happiness for Charlie's sake.\n\nBecause after the tour of the factory, Charlie's entire life goes downhill.  For the rest of his miserable existence, he'll be telling people the story of the one day out of his entire life that he was happy.  Charlie was going to peak at 10 and Grandpa Joe knew it.\n\nFuck.",
            "author": "DO_YOU_EVEN_LIFT_BRO",
            "created_utc": 1439540921.0,
            "replies": [
                {
                    "name": "t1_cu2v4xr",
                    "parent_id": "t1_cu2l0t2",
                    "body": "It's possible that he might have had depression, maybe bipolar disorder. It could have something to do with Mr. Bucket's death, the family's dire living conditions, his health or etc. I'd have to watch the movie again before committing to this theory.",
                    "author": "analrapist_theralist",
                    "created_utc": 1439566802.0,
                    "replies": []
                }
            ]
        },
        {
            "name": "t1_cu2lj3q",
            "parent_id": "t3_3gxyja",
            "body": "You completely disregard the political context of the moment. \n\nBritain was still living in the wake of the work houses that ended in the thirties and were incredibly relevant to the factory ideals in the novel. They were something between a concentration camp and Lowell Mill. They took everyone. Kids, adults, the elderly. No one was fed or educated, the conditions were basically inhumane. Real, Dickensian poverty that over-lasted its moment. \n\nThe four old people in bed are a burden as much as they are a triumph. By having the family together, there's a sense of success. Charlie's family is at the very bottom of the rung, but they've made it this far. The infirm in bed aren't toiling, they are being cared for, which is a step up from 30 years ago. The hopelessness is what is being dramatized. There's no hope for the old in a work house/post-war world. That's sad for a generation that once was able to care for the elderly in different ways and is mourning the workhouse as a way of handling the issue. By giving hope, the golden ticket, the figure of Grandpa Joe comes alive and is revitalized. It is a mark as to the new industrial state of England. The young will be the future, but their wisdom and balance rests on the weathered shoulders of the elders once again. \n\nIn one breath, it heals the old workhouse stigma, presents a path for moving forward, and rescues the working class from the guilt of carrying the water for the older generation. It is fucking genius. ",
            "author": "Exis007",
            "created_utc": 1439543021.0,
            "replies": [
                {
                    "name": "t1_cu3b0fe",
                    "parent_id": "t1_cu2lj3q",
                    "body": "You might be reading a bit too much into it.",
                    "author": "Bratmon",
                    "created_utc": 1439591100.0,
                    "replies": []
                }
            ]
        }
    ]
}