{
    "name": "t3_35oiz5",
    "title": "CMV: The Moth and The Flame stolen video was a genuine cry for help and not a marketing ploy.",
    "body": "Reddit seems a bit like the place conspiracy theories are born.   There seems to be a natural level of cynicism here that presents itself often.  When a band member from TM&amp;TF cried out for help, he could have been genuinely desperate.   \n\nI know they are signed... but that doesn't mean they can't be victims.   No one has presented any evidence to back up that this is just some marketing stunt.  \n\nAt any rate, redditers are a powerful bunch in their numbers so he could have easily decided this would be a good place to call for reinforcements.   Any money he made from all of this was just a fortunate accident. \n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*",
    "author": "votemedownnow2",
    "num_comments": 2,
    "created_utc": 1431409434.0,
    "url": "http://www.reddit.com/r/changemyview/comments/35oiz5/cmv_the_moth_and_the_flame_stolen_video_was_a/",
    "comments": [
        {
            "name": "t1_cr706at",
            "parent_id": "t3_35oiz5",
            "body": "Reasonable question! Now, as for WHY your post was downvoted for a post in CMV, which is (now, you there with the itchy downvote finger, pay attention!) a subreddit *devoted to this very type of question*. And yet, because it was evidently such a enormously tragic lie from the band which resulted in the deaths of thousands of...oh, wait. \n\nAnyway, I gave you an upvote but the inexplicable collective butt hurt of thousands of Redditors over a band (who most had never *heard* of before yesterday) drowned it.\n\n",
            "author": "thebeesremain",
            "created_utc": 1431464161.0,
            "replies": []
        },
        {
            "name": "t1_cr71uyn",
            "parent_id": "t3_35oiz5",
            "body": "Perhaps a bit of an explanation for what this moth and flame thing is for all of us not in the know and why we should care about it?",
            "author": "ppmd",
            "created_utc": 1431466780.0,
            "replies": []
        }
    ]
}